Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: SELinux prevented httpd $ACCESS access to $TARGET_PATH. httpd scripts are not allowed to write to content without explicit labeling of all files. If $TARGET_PATH is writable content. it needs to be labeled httpd_sys_rw_content_t or if all you need is append you can label it httpd_sys_ra_content_t. Please refer to 'man httpd_selinux' for more information on setting up httpd and selinux.
as: SELinux এ $TARGET_PATH লে httpd $ACCESS অভিগম প্ৰতিৰোধ কৰিলে। httpd লিপিসমূহক সকলো নথিপত্ৰৰ এক্সপ্লিচিট লেবেলিং নহোৱাকৈ বিষয়বস্তুলে লিখাৰ অনুমতি নাই। যদি $TARGET_PATH লিখিব পৰা বিষয়বস্তু হয় ইয়াক httpd_sys_rw_content_t লেবেল কৰিব লাগিব অথবা আপুনি যদি কেৱল সংযোজন কৰিব বিচাৰে তেন্তে আপুনি ইয়াক httpd_sys_ra_content_t লেবেল কৰিব পাৰিব। httpd আৰু selinux সংহতি কৰাৰ বিষয়ে অধিক তথ্যৰ বাবে 'man httpd_selinux' চাওক।
es: SELinux evitó acceso httpd $ACCESS a $TARGET_PATH. Los scripts de httpd no tienen permitido modificar contenidos sin etiquetado específico de todos los archivos. Si $TARGET_PATH es contenido modificable necesita ser etiquetado como httpd_sys_rw_content_t, o , si todo lo que necesita es agregar, se lo puede etiquetar conmo httpd_sys_ra_content_t. Por favor, lea 'man httpd_selinux' para más información sobre la configuración de httpd y selinux.
gu: SELinux એ httpd $ACCESS વપરાશને $TARGET_PATH થી અટકાવેલ છે. httpd સ્ક્રિપ્ટો એ બધી ફાઇલોનાં બરાબર લેબલ કર્યા વગર સમાવિષ્ટને લખવા માટે પરવાનગી આપતુ નથી. જો $TARGET_PATH એ લખી શકાય તેવું સમાવિષ્ટ હોય તો. તેની httpd_sys_rw_content_t ને લેબલ કરવા માટે જરૂર છે અથવા જો તમારી જરૂર ને જોડવી હોય તો તમારે તેનું httpd_sys_ra_content_t લેબલ કરી શકો છો. મહેરબાની કરીને httpd અને selinux ને સુયોજિત કરવા પર વધારે જાણકારી માટે 'man httpd_selinux' નો સંદર્ભ લો.
ja: SELinux は httpd の $TARGET_PATH への $ACCESS アクセスを阻止しました。 httpd スクリプトは、全てのファイルの明示的なラベル無しではコンテンツに 書き込む許可を持ちません。$TARGET_PATH が書き込み可能なコンテンツである 場合、httpd_sys_rw_content_t のラベルが必要となり、追記が必要なだけの場合は、 httpd_sys_ra_content_t のラベルを付けます。httpd と selinux のセットアップに関する 詳細には、'man httpd_selinux' を参照して下さい。
kn: httpd ಯು $ACCESS ಅನ್ನು http ಕಡತಗಳನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ SELinux ನಿರ್ಬಂಧಿಸಿದೆ. ಎಲ್ಲಾ ಕಡತಗಳಿಗೂ ವಿಶಿಷ್ಟವಾದ ಲೇಬಲ್‌ ಮಾಡದೆ ವಿಷಯಗಳನ್ನು ಬರೆಯಲು httpd ಸ್ಕ್ರಿಪ್ಟುಗಳಿಗೆ ಅನುಮತಿ ಇರುವುದಿಲ್ಲ. ಎಲ್ಲಿಯಾದರೂ $TARGET_PATH ವು ಬರೆಯಬಹುದಾದ ವಿಷಯವಾಗಿದ್ದಲ್ಲಿ, ಅದನ್ನು httpd_sys_rw_content_t ಇಂದ ಲೇಬಲ್ ಮಾಡಬೇಕು ಅಥವ ಅದರೊಂದಿಗೆ httpd_sys_ra_content_t ಎಂಬ ಲೇಬಲ್‌ ಅನ್ನು ಸೇರಿಸಬೇಕು. ದಯವಿಟ್ಟು httpdಯನ್ನು ಸಿದ್ಧಗೊಳಿಸುವ ಬಗೆಗೆ ಹಾಗು SELinux ಬಗ್ಗೆ ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗಾಗಿ man httpd_selinux ಅನ್ನು ನೋಡಿ.
or: SELinux httpd $ACCESS କୁ $TARGET_PATH ରେ ଅଭିଗମ୍ୟତା ପାଇଁ ବାରଣ କରିଥାଏ। httpd ସ୍କ୍ରିପ୍ଟଗୁଡ଼ିକ ବିଷୟବସ୍ତୁରେ ସମସ୍ତ ଫାଇଲଗୁଡ଼ିକରେ ବିନା ସ୍ପଷ୍ଟ ନାମକରଣ ଲେଖିବା ପାଇଁ ଅନୁମତି ପ୍ରାପ୍ତ ନୁହଁନ୍ତି। ଯଦି $TARGET_PATH ଟି ଗୋଟିଏ ଲିଖନଯୋଗ୍ୟ ବିଷୟବସ୍ତୁ। ଏହା httpd_sys_rw_content_t କୁ ନାମକରଣ କରିବା ଉଚିତ ଅଥବା ଯଦି ଆପଣ ସମସ୍ତକୁ ଯୋଡ଼ିବା ପାଇଁ ଚେଷ୍ଟାକରନ୍ତି ତେବେ ଆପଣ httpd_sys_ra_content_t କୁ ନାମକରଣ କରିପାରିବେ। ଦୟାକରି httpd ଏବଂ selinux କୁ ବିନ୍ୟାସ କରିବା ବିଷୟରେ ଅଧିକ ସୂଚନା ପାଇଁ 'man httpd_selinux' କୁ ଅନୁସରଣ କରନ୍ତୁ।
te: SELinux అనునది httpd $ACCESS యాక్సెస్‌ను $TARGET_PATHకు నిరోధిస్తుంది. అన్ని ఫైళ్ళ యొక్క బహిర్గత లేబులింగ్ లేకుండా httpd స్క్రిప్టులు వ్రాయుటకు అనుమతించబడవు. ఒక వేళ $TARGET_PATH వ్రాయదగు సారమైతే. అది httpd_sys_rw_content_t గా లేబుల్ చేయబడాలి లేదా మీకు కావలసింది వున్నదానికి జతచేయడమైతే మీరు దానిని httpd_sys_ra_content_t గా లేబుల్ చేయవచ్చును. htttp మరియు selinux అమర్చుటపై మరింత సమాచారము కొరకు దయచేసి 'man httpd_selinux' చూడండి.
uk: SELinux забороняє httpd ($SOURCE_PATH) доступ $ACCESS до $TARGET_PATH. Сценаріям httpd не дозволений запис без явного позначення всіх файлів. Якщо $TARGET_PATH допускає запис, його треба позначити як httpd_sys_rw_content_t чи httpd_sys_ra_content_t (якщо потрібно лише додавання). Докладну інформацію можна знайти на сторінці довідки «man httpd_selinux».
zh_tw: SELinux 防止 httpd $ACCESS 存取 $TARGET_PATH。 在所有檔案未明確標記之前，httpd 指令稿不 允許對於內容進行寫入。若 $TARGET_PATH 為可寫入的內容的話，它需要 被標記為 httpd_sys_rw_content_t，或是若您只需要進行附加的話，您可將其標記為 httpd_sys_ra_content_t。欲取得更多有關於設定 httpd 和 selinux 上的相關資訊，請參閱「man httpd_selinux」。

source: You need to change the label on '$FIX_TARGET_PATH'
as: আপুনি '$FIX_TARGET_PATH' ত লেবেল সলনি কৰিব লাগিব'
es: Necesita modificar la etiqueta a '$FIX_TARGET_PATH'
gu: તમારે '$FIX_TARGET_PATH' પર લેબલને બદલવાની જરૂર છે
ja: '$FIX_TARGET_PATH' のラベルを変更する必要があります
kn: '$FIX_TARGET_PATH' ನಲ್ಲಿ ಲೇಬಲ್ ಅನ್ನು ಬದಲಾಯಿಸುವ ಅಗತ್ಯವಿದೆ'
or: ଆପଣଙ୍କୁ '$FIX_TARGET_PATH' ଉପରେ ନାମପଟିକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ହେବ'
te: మీరు '$FIX_TARGET_PATH' పైని లేబుల్‌ను మార్చాలి
uk: Вам слід змінити мітку на «$FIX_TARGET_PATH»
zh_tw: 您需要更改 '$FIX_TARGET_PATH' 上的標籤

source: Your system may be seriously compromised! $SOURCE_PATH tried to modify kernel configuration.
as: আপোনাৰ চিস্টেমত গুৰুতৰভাৱে সাল সালনি হব পাৰে! $SOURCE_PATH এ কাৰনেল সংৰূপ সলনি কৰাৰ চেষ্টা কৰিছিল।
es: ¡Su sistema puede estar seriamente comprometido! $SOURCE_PATH intentó modificar la configuración del kernel.
gu: તમારી સિસ્ટમ ગંભીરતા થી સમાધાન કરી શકે છે! $SOURCE_PATH એ કર્નલ રૂપરેખાંકનને બદલવા માટે પ્રયત્ન કરતુ હતુ.
ja: ご使用のシステムには深刻な侵害の可能性があります! $SOURCE_PATH がカーネル設定を変更しようとしました。
kn: ನಿಮ್ಮ ಗಣಕವು ಗಂಭೀರವಾಗಿ ರಾಜಿ ಮಾಡಿಕೊಂಡಿರಬಹುದು! ಒಂದು ಕರ್ನಲ್ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಲು $SOURCE_PATH ಪ್ರಯತ್ನಿಸಿದೆ.
or: ଆପଣଙ୍କର ତନ୍ତ୍ରଟି ଗୁରୁତର ଭାବରେ କ୍ଷତିଗ୍ରସ୍ତ ହୋଇପାରେ! $SOURCE_PATH କର୍ଣ୍ଣଲ ବିନ୍ୟାସକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଚେଷ୍ଟା କରିଥିଲା।
te: మీ సిస్టమ్ తీవ్రంగా రాజీ పడవచ్చు! $SOURCE_PATH కెర్నల్ ఆకృతీకరణను సవరించుటకు పయత్నిస్తుంది.
uk: Вашу систему може бути скомпрометовано! $SOURCE_PATH намагається змінити конфігурацію ядра.
zh_tw: 您的系統可能已嚴重遭到入侵！$SOURCE_PATH 已嘗試修改內核組態。

source: SELinux has prevented $SOURCE from modifying $TARGET. This denial indicates $SOURCE was trying to modify the way the kernel runs or to actually insert code into the kernel. All applications that need this access should have already had policy written for them. If a compromised application tries to modify the kernel this AVC will be generated. This is a serious issue. Your system may very well be compromised.
as: SELinux এ $SOURCE ক $TARGET সলনি কৰাৰ পৰা প্ৰতিৰোধ কৰিছে। এই প্ৰতিৰোধে ইংগিত দিয়ে যে $SOURCE এ কাৰনেল চলাৰ পদ্ধতি অথবা কাৰনেল প্ৰকৃততে ক'ড সুমুৱাৰ চেষ্টা কৰি আছিল। সকলো অনুপ্ৰয়োগ যাৰ এই অভিগমৰ প্ৰয়োজন সিহতৰ বাবে নীতি লিখা থাকিব লাগিব। যদি এটা ভুল অনুপ্ৰয়োগে কাৰনেল সলনি কৰাৰ চেষ্টা কৰে AVC সৃজন কৰা হব। ই এটা গুৰত্বপূৰ্ণ সমস্যা। আপোনাৰ চিস্টেমত ভাল সাল সলনি হব পাৰে।
es: SELinux le ha negado a $SOURCE la posibilidad de modificar el $TARGET. Esta negación indica que $SOURCE estaba intentando modificar la forma en que se ejecuta el kernel, o que en realidad estaba intentando insertar un código en él Todas las aplicaciones que necesiten este acceso deberían de haber tenido alguna política definida para él. Si alguna aplicación comprometida trata de modificar el kernel, se habrá generado este AVC. Este es un problema serio. Su sistema puede estar comprometido.
gu: SELinux એ $TARGET બદલવાથી $SOURCE ને અટકાવેલ છે. આ નામંજૂરી સૂચવે છે કે $SOURCE જેમ કર્નલ જે રીતે ચાલે છે તે રીતે બદલવાનો પ્રયત્ન કરતુ હતુ અથવા કર્નલમાં કોડ ને વાસ્તવમાં દાખલ કરવા માટે. બધા કાર્યક્રમો કે જે તેઓ માટે આ વપરાશની જરૂર પહેલેથી જ લખાયેલ પોલિસીમાં હોવુ જ જોઇએ. જો સમાધાન થયેલ કાર્યક્રમ કર્નલને બદલવા માટે પ્રયત્ન કરે છે આ AVC ઉત્પન્ન થયેલ હશે. આ ગંભીર સમસ્યા છે. તમારી સિસ્ટમને સારી રીતે સમાધાન કરી શકાય છે.
ja: SELinux は $SOURCE による $TARGET の修正を阻止しました。この否定は $SOURCE が、カーネルの実行方法を修正する試みか、又はそのカーネルに 実際にコードを挿入する試みをしていたことを示します。このアクセスを要する 全てのアプリケーションは自身の為のポリシーを書かせておくべきでした。侵害を 受けている アプリケーションがカーネルを修正しようとすると、この AVC が生成されます。 これは 重大な問題です。ご使用のシステムは既に侵害されている可能性があります。
kn: $SOURCE ಅನ್ನು ಮಾರ್ಪಡಿಸದಂತೆ $TARGET ಅನ್ನು SELinux ತಡೆದಿದೆ. ಈ ನಿರಾಕರಣೆಯು $SOURCE ಕರ್ನಲ್ ಚಾಲನೆಗೊಳ್ಳುವ ರೀತಿಯನ್ನು ಬದಲಾಯಿಸಲು ಅಥವ ಕರ್ನಲ್‌ಗೆ ಸಂಕೇತವನ್ನು ಸೇರಿಸಲು ಪ್ರಯತ್ನಿಸಿದೆ ಎನ್ನುವುದನ್ನು ಸೂಚಿಸುತ್ತದೆ. ಇದರ ಅಗತ್ಯವಿರುವ ಎಲ್ಲಾ ಅನ್ವಯಗಳಿಗೂ ಪಾಲಿಸಿಯನ್ನು ಈ ಮೊದಲೆ ಬರೆದಿರುವ ಅಗತ್ಯವಿರುತ್ತದೆ. ರಾಜಿ ಮಾಡಿಕೊಳ್ಳಲಾದ ಯಾವುದೆ ಅನ್ವಯವು ಕರ್ನಲ್ ಅನ್ನು ಮಾರ್ಪಡಿಸಲು ಪ್ರಯತ್ನಿಸಿದಲ್ಲಿ ಈ AVC ಯನ್ನು ತೋರಿಸಲಾಗುತ್ತದೆ ಇದು ಒಂದು ಗಂಭೀರವಾದ ಸಮಸ್ಯೆಯಾಗದ್ದು. ನಿಮ್ಮ ಗಣಕವು ರಾಜಿ ಮಾಡಿಕೊಂಡಿರುವಂತೆ ತೋರುತ್ತಿದೆ.
or: SELinux $SOURCE କୁ $TARGET ପରିବର୍ତ୍ତନ କରିବାରୁ ବାରଣ କରିଥାଏ। ଏହି ବାରଣ ସୂଚାଇଥାଏ ଯେ $SOURCE ଟି କର୍ଣ୍ଣଲ ଚାଲୁଥିବା ପଥକୁ ପରିବର୍ତ୍ତନ କରୁଥିଲା ଅଥବା ପ୍ରକୃତରେ ସଂକେତକୁ କର୍ଣ୍ଣଲ ମଧ୍ଯରେ ଭର୍ତ୍ତି କରିଥାଏ। ଏହି ଅବିଗମ୍ୟତା ଆବଶ୍ୟକ କରୁଥିବା ସମସ୍ତ ପ୍ରୟୋଗଗୁଡ଼ିକ ପାଇଁ ପୂର୍ବରୁ ନିତୀ ଲିଖିତ ହୋଇଛି। ଯଦି ଗୋଟିଏ ବୁଝାମଣା ପ୍ରୟୋଗ କର୍ଣ୍ଣଲକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଚେଷ୍ଟାକରେ ତେବେ ଏହି AVC ସୃଷ୍ଟି ହୋଇଥାଏ। ଏହା ଗୋଟିଏ ଗୁରୁତର ସମସ୍ୟା। ଆପଣଙ୍କର ତନ୍ତ୍ର ଅତିମାତ୍ରାରେ ବୁଝାମଣା ହୋଇଥାଏ।
te: SELinux అనునది $SOURCEను $TARGET సవరించుటనుండి నిరోధిస్తోంది. ఈ తిరస్కరణ $SOURCE అనునది కెర్నల్ నడుచు విధానాన్ని మార్చుటకు ప్రయత్నించుటను సూచిస్తుంది లేదా యధార్దంగా కోడ్‌ను కెర్నల్‌కు చేర్చుతుంది. ఈ యాక్సెస్ కావలిసిన అన్ని అనువర్తనములు వాటి కొరకు వొక విధానాన్ని కలిగివుండవలెను. ఒకవేళ రాజీపడిన అనువర్తనము కెర్నల్‌ను సవరించుటకు ప్రయత్నిస్తే ఈ AVC వుద్భవించబడుతుంది. ఇది వొక తీవ్రమైన సమస్య. మీ సిస్టమ్ చాలా బాగా రాజీపడవచ్చును.
uk: SELinux забороняє $SOURCE змінювати $TARGET. $SOURCE намагається змінити поведінку ядра чи вставити код в ядро. Для всіх програм, котрим потрібен такий доступ, мають бути власні правила. Якщо скомпрометована програма намагається змінити ядро, буде згенеровано AVC. Це є серйозною проблемою та може бути ознакою того, що систему було скомпрометовано.
zh_tw: SELinux 已防止 $SOURCE 修改 $TARGET。這項拒絕動作 顯示 $SOURCE 嘗試修改內核的執行方式或是 實際地將程式碼插入內核中。所有需要這項存取許可的應用程式 都應該已有針對於它們的方針被編寫。若有項受到入侵的 應用程式嘗試修改內核的話，這個 AVC 便會產生。這是個 嚴重的問題。您的系統可能已遭到入侵。

source: you do not think $SOURCE_BASE_PATH should try $ACCESS access on $TARGET_BASE_PATH.
as: আপুনি নাভাৱে যে $SOURCE_BASE_PATH এ $TARGET_BASE_PATH ত $ACCESS অভিগমৰ চেষ্টা কৰিব লাগে।
es: no cree que $SOURCE_BASE_PATH deba intentar acceso $ACCESS sobre $TARGET_BASE_PATH.
gu: તમે એવુ વિચારો નહિં કે $TARGET_BASE_PATH પર $SOURCE_BASE_PATH એ $ACCESS વપરાશનો પ્રયત્ન કરવો જોઇએ.
ja: $SOURCE_BASE_PATH が $TARGET_BASE_PATH の $ACCESS access を試みるべきではありません。
kn: $TARGET_BASE_PATH ನಲ್ಲಿ $SOURCE_BASE_PATH $ACCESS ಅನ್ನು ನಿಲುಕಿಸಕೊಳ್ಳಲು ಪ್ರಯತ್ನಿಸಬೇಕು ಎಂದು ನಿಮಗನ್ನಿಸುವುದಿಲ್ಲ.
or: ଆପଣ ଭାବୁନାହାନ୍ତିକି $SOURCE_BASE_PATH $ACCESS ଅଭିଗମ୍ୟତାକୁ$TARGET_BASE_PATH ଉପରେ ଚେଷ୍ଟାକରିବା ଉଚିତ।
uk: ви вважаєте, що $SOURCE_BASE_PATH не повинен намагатися отримувати доступ $ACCESS до $TARGET_BASE_PATH.
zh_tw: 您不認為 $SOURCE_BASE_PATH 應在 $TARGET_BASE_PATH 上嘗試 $ACCESS 存取。

source: you may be under attack by a hacker, since confined applications should not need this access.
as: আপুনি এজন হেকাৰ দ্বাৰা আক্ৰমণৰ সন্মুখিন হব পাৰে, যিহেতু গোপণ অনুপ্ৰয়োগসমূহৰ এই অভিগমৰ প্ৰয়োজন নহয়।
es: podría estar siendo víctima de un ataque, ya que las aplicaciones confinadas no deberían necesitar este tipo de acceso.
gu: તમને હેકર દ્દારા હુમલો થઇ શકે છે, જ્યાં સુધી મર્યાદિત કાર્યક્રમોને આ વપરાશની જરૂર ન હોવી જોઇએ.
ja: ハッカーから攻撃されている可能性があります。特定アプリケーションはこのアクセスをすべきではないからです。
kn: ನೀವು ಒಬ್ಬ ಹ್ಯಾಕರಿನಿಂದ ದಾಳಿಗೆ ಒಳಗಾಗಿದ್ದೀರಿ ಏಕೆಂದರೆ ನಿರ್ಬಂಧಿತ ಅನ್ವಯಗಳಿಗೆ ಈ ನಿಲುಕಣೆಯ ಅಗತ್ಯವಿರುವುದಿಲ್ಲ.
or: ଆପଣ ହୁଏତଃ କୌଣସି ଅନାଧିକୃତ ଆକ୍ରମଣକାରୀଙ୍କ ଶିକାର ହୋଇଛନ୍ତି, ଯେହେତୁ ପ୍ରୟୋଗଗୁଡ଼ିକ ଏହି ଅଭିଗମ୍ୟତା ଆଶାକରିବା ଉଚିତ ନୁହଁ।
te: మీరు హాకర్‌చే దాడికి గురై వుండవచ్చు, లొంగదీసుకొన్న అనువర్తనములు యీ యాక్సెస్ అవసరములేదు.
uk: ймовірно, вас атакують зловмисники, оскільки програми, доступ яких обмежено, такий доступ не потрібен.
zh_tw: 您可能遭受駭客攻擊，因為受限制的應用程式永遠不需要這種存取動作。

source: SELinux is preventing $SOURCE_PATH access to a leaked $TARGET_PATH file descriptor.
as: SELinux এ এটা $TARGET_PATH নথিপত্ৰ বিৱৰকলে $SOURCE_PATH অভিগম প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a $SOURCE_PATH el acceso a un descriptor de archivo $TARGET_PATH filtrado.
gu: SELinux એ $SOURCE_PATH ને $TARGET_PATH ફાઇલ વર્ણનકર્તાને લાવવાથી અટકાવી રહ્યું છે.
ja: SELinux は 漏洩した $TARGET_PATH のファイル記述子へ $SOURCE_PATH がアクセスすることを阻止しています。
kn: ಸೋರಿಹೋದ $TARGET_PATH ಕಡತ ವಿವರಣೆಗಾರವನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ $TARGET_PATH ಅನ್ನು SELinux ತಡೆದಿದೆ.
or: SELinux $SOURCE_PATH କୁ ପାଠ୍ଯ ପୁନଃବଣ୍ଟନ ଆବଶ୍ଯକ କରୁଥିବା $TARGET_PATH ଧାରଣ କରିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH యాక్సెస్‌ను లీకైన $TARGET_PATH ఫైల్ డిస్క్రిప్టార్‌కు నిరోధిస్తోంది.
uk: SELinux забороняє $SOURCE_PATH доступ до дескриптора файлу $TARGET_PATH (можливе витікання).
zh_tw: SELinux 防止 $SOURCE_PATH 存取一個溢位的 $TARGET_PATH 檔案描述符號。

source: SELinux denied access requested by the $SOURCE command. It looks like this is either a leaked descriptor or $SOURCE output was redirected to a file it is not allowed to access. Leaks usually can be ignored since SELinux is just closing the leak and reporting the error. The application does not use the descriptor, so it will run properly. If this is a redirection, you will not get output in the $TARGET_PATH. You should generate a bugzilla on selinux-policy, and it will get routed to the appropriate package. You can safely ignore this avc.
as: SELinux এ $SOURCE কমান্ড দ্বাৰা অনুৰোধ কৰা অভিগম নাকচ কৰিলে। এনে লাগিছে যেন ই হয় এটা উৰুখ বিৱৰক অথবা $SOURCE আউটপুটক এনে এটা নথিপত্ৰলে পুনৰনিৰ্দেশ কৰা হৈছে যলৈ তাৰ অভিগমৰ অনুমতি নাই। উৰুখসমূহ সাধাৰণত উপেক্ষা কৰিব পাৰি যিহেতু SELinux এ উৰুখ বন্ধ কৰি ত্ৰুটিৰ সংবাদ দি আছে। অনুপ্ৰয়োগে বিৱৰক ব্যৱহাৰ নকৰে, সেয়েহে ই সঠিকভাৱে চলিব। যদি ই এটা পুনৰনিৰ্দেশ হয়, আপুনি $TARGET_PATH ত আউটপুট নাপাব। আপুনি selinux-policy ত এটা bugzilla সৃজন কৰিব লাগিব, আৰু ই সঠিক পেকেইজ লৈকে দিশ পাব। আপুনি avc ক সুৰক্ষিতভাৱে উপেক্ষা কৰিব পাৰিব।
es: SELinux le ha negado el acceso pedido por el comando $SOURCE. Parece que éste es un descriptor filtrado o la salida de $SOURCE fue redirigida a un archivo al cual no tiene acceso. Los filtros usualmente son ignorados dado que SELinux simplemente los cierra y reporta el error. La aplicación no usa el descriptor, por lo que funcionará apropiadamente. Si esta es una redirección, no obtendrá la salida en $TARGET_PATH. Debe generar un informe en bugzilla sobre selinux-policy, y será enviado al paquete apropiado. Puede ignorar sin problemas este avc.
gu: SELinux એ $SOURCE આદેશ દ્દારા સૂચિત થયેલ પ્રવેશ નામંજૂર થયેલ છે. તે એવુ લાગે છે આ ક્યાંતો leaked વર્ણનકર્તાેલ છે અથવા $SOURCE આઉટપુટ ફાઇલમાં પુન:આવેલ હતુ તે પ્રવેશ માટે પરવાનગી આપેલ નથી. Leaks સામાન્ય રીતે અવગણી શકાય છે જ્યાં સુધી SELinux એ leak ને બંધ કરી રહ્યુ હોય અને ભૂલનો અહેવાલ કરી રહ્યુ હોય.કાર્યક્રમonવર્ણનકર્તાને વાપરતુ નથીorતેથી તે યોગ્ય રીતે ચાલશેly.જો આ બીજી દિશામાં હોય તોonતમારે TARARGET_PA માં આઉટપુટ મળશે નહિંTH.તમારે selinux-policy પર બગઝીલાને ઉત્પન્ન કરવુ જોઇએcyઅને તે અનૂકુળ પેકેજમાં રસ્તો મળશેhge.તમે આis a ને સલામત રીતે અવગણી શકો છોvc.
ja: SELinux は $SOURCE コマンドにより要求されたアクセスを拒否しました。これは、 リークした記述子か、又は $SOURCE の出力がアクセスの許可がないファイルへ再転送 されたように見えます。SELinux がリークを閉じてエラーを報告するため、リークは通常 無視されます。アプリケーションは正常の稼働するように記述子を使用しません。これが 再転送であった場合、$TARGET_PATH には出力を得ることはありません。selinux-policy 上に bugzilla を生成すべきで、そうすると、それが適切なパッケージまで巡回します。この avc は 無視しても安全です。
kn: $SOURCE ಆಜ್ಞೆಯಿಂದ ಮನವಿಸಲ್ಲಿಸಲಾದ ನಿಲುಕಣೆಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ಬಹುಷಃ ಇದು ಒಂದು ಸೋರಿಹೋದ ವಿವರಣೆಗಾರವಾಗಿದೆ(ಡಿಸ್ಕ್ರಿಪ್ಟರ್) ಅಥವ $SOURCE ಔಟ್‌ಪುಟ್ ಅನ್ನು ಅದಕ್ಕೆ ನಿಲುಕಿಸಿಕೊಳ್ಳಲು ಅನುಮತಿ ಇರದೆ ಇರುವ ಒಂದು ಕಡತಕ್ಕೆ ಕಳುಹಿಸಲಾಗಿದೆ. ಸೋರುವಿಕೆಯನ್ನು ಸಾಮಾನ್ಯವಾಗಿ ಆಲಕ್ಷಿಸಬಹುದಾಗಿದೆ ಏಕೆಂದರೆ SELinux ಸೋರಿಕೆಯನ್ನು ಮುಚ್ಚಿ ದೋಷವನ್ನು ವರದಿ ಮಾಡುತ್ತದೆ. ಅನ್ವಯವು ವಿವರಣೆಗಾರರನ್ನು ಬಳಸುವುದಿಲ್ಲ, ಆದ್ದರಿಂದ ಇದು ಸಮರ್ಪಕವಾಗಿ ಚಾಲನೆಗೊಳ್ಳುತ್ತದೆ. ಎಲ್ಲಿಯಾದರೂ ಇದು ಮರು ನಿರ್ದೇಶಿತಗೊಂಡಿದ್ದಾಗಿದ್ದರೆ, $TARGET_PATH ನಲ್ಲಿ ನಿಮಗೆ ಔಟ್‌ಪುಟ್ ದೊರೆಯುವುದಿಲ್ಲ. selinux-policy ಗಾಗಿ ನೀವು ಒಂದು ಬಗ್‌ಝಿಲ್ಲಾವನ್ನು ರಚಿಸಬೇಕಾಗುತ್ತದೆ, ಸೂಕ್ತವಾದ ಪ್ಯಾಕೇಜಿಗೆ ಕಳುಹಿಸಬೇಕಾಗುತ್ತದೆ. ನೀವು ಈ avc ಯನ್ನು ನಿಶ್ಚಿಂತೆಯಿಂದ ಆಲಕ್ಷಿಸಬಹುದು.
or: SELinux $SOURCE ନିର୍ଦ୍ଦେଶ ଦ୍ୱାରା ଅନୁରୋଧ କରାଯାଇଥିବା ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଛି। ଏହା ହୁଏତଃ ଗୋଟିଏ ଚୋରା ବର୍ଣ୍ଣନାକାରୀ ଅଥବା $SOURCE ଫଳାଫଳଟି ଗୋଟିଏ ଫାଇଲକୁ ଦର୍ଶାଇଛିଯାହାକି ଅଭିଗମ୍ୟତା ପାଇଁ ଅନୁମୋଦିତ ନୁହଁ। ଚୋରିକୁ ସାଧାରଣତଃ ଅଗ୍ରାହ୍ୟ କରାଯାଇଥାଏ ଯେହେତୁ SELinux ଟି କେବଳ ଚୋରୀକୁ ବନ୍ଦ କରିଥାଏ ଏବଂ ତ୍ରୁଟିକୁ ଖବର କରିଥାଏ। ପ୍ରୟୋଗ ବର୍ଣ୍ଣନାକାରୀଙ୍କୁ ବ୍ୟବହାର କରେନାହିଁ, ତେଣୁ ଏହା ସଠିକ ଭାବରେ ଚାଲିବ। ଯଦି ଏହା ଏକ ଦିଗ ପରିବର୍ତ୍ତନ, ତେବେ ଆପଣ $TARGET_PATH ରେ କୌଣସି ଫଳାଫଳ ପାଇବେ ନାହିଁ। ଆପଣଙ୍କୁ selinux-policy ଉପରେ ଗୋଟିଏ bugzilla ସୃଷ୍ଟି କରିବାକୁ ହେବ, ଏବଂ ଏହା ସଠିକ ପ୍ୟାକେଜରେ ବୁଲିଥାଏ। ଆପଣ ସୁରକ୍ଷିତ ଭାବରେ ଏହି avc କୁ ଅଗ୍ରାହ୍ୟ କରିପାରିବେ।
te: SELinux అనునది $SOURCE ఆదేశము ద్వారా అభ్యర్దించబడిన యాక్సెస్‌ను తిరస్కరించినది. ఇది లీకైన డిస్క్రిప్టార్ వలె కాని లేదా $SOURCE అవుట్పుట్ అనునది యిది అనుమతించబడునటువంటి దస్త్రమునకు మళ్ళించిన దానివలె కాని అనిపిస్తోంది. లీకులు సాధారణంగా వదిలివేయవచ్చు యెంచేతంటే SELinux లీకును మూసివేసి దోషమును నివేదిస్తుంది. అనువర్తనము డిస్క్రిప్టార్‌ను వుపయోగించదు, అలా యిది సరిగా నడుస్తుంది. ఒకవేళ యిది మళ్ళింపైతే, మీరు అవుట్పుట్‌ను $TARGET_PATH నందు పొందరు. మీరు bugzillaను selinux-policy నందు జనియింపచేయాలి, మరియు యిది సరైన ప్యాకేజీకు రూటు చేయబడాలి. మీరు నిశ్చింతగా ఈ avcను వదిలిలివేయవచ్చు.
uk: SELinux забороняє запит доступу, отриманий від команди $SOURCE. Ймовірне витікання дескриптора чи вивід $SOURCE був перенаправлений у файл, до якого у неї немає доступу. Витікання зазвичай можна ігнорувати, оскільки SELinux просто їх закриває та повідомляє про помилку. Програма не використовує дескриптор, тому її роботу не буде порушено. Якщо ж причиною є перенаправлення, $TARGET_PATH не буде містити вивід. У цьому випадку створіть запит у Bugzilla для компоненту selinux-policy.
zh_tw: SELinux 拒絕透過 $SOURCE 指令所發出的存取請求。這看起來應該是個檔案描述符號漏失 (descriptor leak) 或是 $SOURCE 輸出被重定向至一個它為被允許存取的檔案。漏失一般可被忽略，因為這只是 SELinux 將漏失關閉並回報錯誤。這項應用程式不使用這個檔案描述符號，因此它可正常運作。若這是項重定向的話，您將不會在 $TARGET_PATH 中得到輸出。您應針對於 selinux-policy 提交一份 bugzilla，而這將會被轉至適當的套件上。您可安全地忽略此 avc。

source: You can generate a local policy module to allow this access - see <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a>
as: আপুনি এই অভিগমৰ অনুমতি দিবলে এটা স্থানীয় নীতি মডিউল সৃজন কৰিব পাৰে - <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> চাওক
es: Puede generar un módulo de política local para permitir este acceso. Vea <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a>
gu: તમે આ વપરાશને પરવાનગી આપવા માટે સ્થાનિક પોલિસી મોડ્યુલને બનાવી શકો છો - જુઓ <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a>
ja: ローカルポリシーモジュールを生成して、このアクセスを許可するように できます：<a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> をご覧下さい。
kn: ಈ ನಿಲುಕಣೆಯನ್ನು ಅನುಮತಿಸಲು ನೀವು ಒಂದು ಸ್ಥಳೀಯ ಪಾಲಿಸಿಯನ್ನು ಉತ್ಪಾದಿಸಬಹುದು - <a href="http://fedoraredhat.com/docs/selinux-faq-fc5/#id2961385">FAQ</a> ಅನ್ನು ನೋಡಿ
or: ଆପଣ ଗୋଟିଏ ସ୍ଥାନୀୟ ନିୟମ ଏକକାଂଶ ନିର୍ମାଣ କରିବା ପାଇଁ ଅନୁମତି ଦେଇପାରନ୍ତି - <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> କୁ ଦେଖନ୍ତୁ
te: ఈ యాక్సెస్‌ను అనుమతించుటకు మీరు స్థానిక విధాన మాడ్యూల్‌ను వుద్బవింపజేయవచ్చు - <a href="http://docs.fedoraproject.org/selinux-faq-fc5/ - <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> చూడండి
uk: Щоб дозволити доступ, можна згенерувати модуль локальної локальних правил (див. <a href="http://docs.fedoraproject.org/uk-UA/Fedora/13/html/SELinux_FAQ/index.html">ЧаП</a>).
zh_tw: 您可產生一份本機方針模組來允許這項 存取 - 請參閱 <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a>

source: you want to ignore $SOURCE_BASE_PATH trying to $ACCESS access the $TARGET_BASE_PATH $TARGET_CLASS, because you believe it should not need this access.
as: আপুনি $SOURCE_BASE_PATH এ $TARGET_BASE_PATH $TARGET_CLASS $ACCESS অভিগম কৰাৰ চেষ্টা উপেক্ষা কৰিব বিচাৰে, কাৰণ আপুনি ভাৱে ইয়াৰ এই অভিগমৰ প্ৰয়োজন নহয়।
es: quiere ignorar $SOURCE_BASE_PATH intentando que $ACCESS acceda al $TARGET_BASE_PATH $TARGET_CLASS, debido a que considera que no debería necesitar este acceso.
gu: તમે $TARGET_BASE_PATH $TARGET_CLASS નાં $ACCESS પ્રવેશ કરવા $SOURCE_BASE_PATH પ્રયત્ન કરી રહ્યુ છે તે અવગણવા માંગો છો, કારણ કે તમે માનો છો કે તેને આ પ્રવેશની જરૂર હોવી જોઇએ નહિં.
ja: $SOURCE_BASE_PATH が、 $TARGET_BASE_PATH $TARGET_CLASS へ $ACCESS アクセスを試みることを、拒否したい。このアクセスが必要とは思えないため。
kn: $SOURCE_BASE_PATH ಎಂಬುದು $TARGET_BASE_PATH $TARGET_CLASS ಅನ್ನು $ACCESS ನಿಲುಕಿಸಿಕೊಳ್ಳುವುದನ್ನು ನೀವು ಕಡೆಗಣಿಸಲು ಬಯಸುತ್ತೀರಿ ಏಕೆಂದರೆ ಇದಕ್ಕೆ ಇದರ ಅಗತ್ಯ ಇರುವುದಿಲ್ಲ.
or: ଆପଣ $SOURCE_BASE_PATH କୁ ଅଗ୍ରାହ୍ୟ କରିବାକୁ ଚାହୁଁଛନ୍ତି କି ଯିଏକି $TARGET_BASE_PATH $TARGET_CLASS କୁ $ACCESS ଅଭିଗମ୍ୟ କରିବାକୁ ଚେଷ୍ଟାକରୁଅଛି, କାରଣ ଆପଣ ବିଶ୍ୱାସ କରୁଛନ୍ତି ଯେ ଏହା ସେହି ଅଭିଗମ୍ୟାତାକୁ ଆବଶ୍ୟକ କରିବା ଉଚିତ ନୁହଁ।
te: $TARGET_BASE_PATH $TARGET_CLASS ను $ACCESS యాక్సెస్ చేయుటకు ప్రయత్నించుటను $SOURCE_BASE_PATH విస్మరించవలెనని మీరు కోరుకొనుచున్నారా, యెంచేతంటే మీరు యిది యీ యాక్సిస్‌ను కలిగివుండవలసిన అవసరములేదని నమ్ముచున్న కారణంగా.
uk: ви бажаєте ігнорувати спроби $SOURCE_BASE_PATH отримання доступу $ACCESS до $TARGET_BASE_PATH $TARGET_CLASS, оскільки вважаєте, що такий доступ не потрібен.
zh_tw: 您希望忽略 $SOURCE_BASE_PATH 嘗試 $ACCESS 存取 $TARGET_BASE_PATH $TARGET_CLASS，因為您認為它不應需要此存取權限。

source: You should report this as a bug. You can generate a local policy module to dontaudit this access.
as: আপুনি ইয়াক এটা বাগ হিচাপে সংবাদ দিব লাগিব। আপুনি এই অভিগম বিশ্লেষণৰ অনুমতি নিদিবলে এটা স্থানীয় নীতি মডিউল সৃজন কৰিব পাৰে।
es: Debería reportar esto como un error. Puede generar un módulo de política local para no auditar este acceso.
gu: તમે ભૂલ તરીકે આનો અહેવાલ કરવો જોઇએ. dontaudit આ પ્રવેશ માટે તમે સ્થાનિય પોલિસીને ઉત્પન્ન કરી શકો છો.
ja: これをバグとして報告すべきです。 このアクセスを監査しないよう、ローカルポリシーモジュールを生成することが可能です。
kn: ನೀವು ಇದನ್ನು ಒಂದು ದೋಷ ಎಂದು ವರದಿ ಮಾಡಬೇಕು. ಈ ನಿಲುಕಣೆಯನ್ನು dontaudit ಮಾಡಲು ನೀವು ಒಂದು ಸ್ಥಳೀಯ ಪಾಲಿಸಿಯನ್ನು ಉತ್ಪಾದಿಸಬಹುದು.
or: ଆପଣ ଏହାକୁ ଗୋଟିଏ ତ୍ରୁଟି ଭାବରେ ଖବର କରିବା ଉଚିତ। ଏହି ଅଭିଗମ୍ୟକୁ ଯାଞ୍ଚ ପାଇଁ ଆପଣଙ୍କୁ ଗୋଟିଏ ସ୍ଥାନୀୟ ନିୟମାବଳୀ ଏକକାଂଶ ସୃଷ୍ଟିକରିବା ଉଚିତ।
te: మీరు దీనిని బగ్‌గా నివేదించవలెను. ఈ యాక్సెస్‌ను ఆడిట్ చేయకుండా వుండుటకు మీరు స్థానిక విధాన మాడ్యూల్‌ను వుద్భవింపచేయగలరు.
uk: Вам слід повідомити про цю помилку як про ваду. Ви можете створити модуль локальних правил для вимикання стеження за таким доступом.
zh_tw: 您應將此作為錯誤提交。 您可產生本機政策模組，以 dontaudit 這項存取。

source: Your system may be seriously compromised! $SOURCE_PATH attempted to mmap low kernel memory.
as: আপোনাৰ চিস্টেম গুৰুতৰভাৱে সাল সলনি হব পাৰে! $SOURCE_PATH এ নিম্ন কাৰনেল মেমৰি mmap কৰাৰ চেষ্টা কৰিছিল।
es: ¡Su sistema puede estar seriamente comprometido! $SOURCE_PATH intentó nmap la memoria baja del kernel.
gu: તમારી સિસ્ટમ ગંભીરતા થી સમાધાન કરી શકે છે!$SOURCE_PATH એ નીચી કર્નલ મેમરી mmap કરવા માટે પ્રયત્ન કર્યો હતો.
ja: ご使用のシステムには深刻な侵害の可能性があります! $SOURCE_PATH が低位置カーネルメモリーへの mmap を試行しました。
kn: ನಿಮ್ಮ ಗಣಕವು ಗಂಭೀರವಾಗಿ ರಾಜಿ ಮಾಡಿಕೊಂಡಿರಬಹುದು! $SOURCE_PATH ಕಡಿಮೆ ಕರ್ನಲ್ ಮೆಮೊರಿಯನ್ನು mmap ಮಾಡಲು ಪ್ರಯತ್ನಿಸಿದೆ.
or: ଆପଣଙ୍କ ତନ୍ତ୍ରଟି ଗୁରୁତର ଭାବରେ କ୍ଷତିଗ୍ରସ୍ତ ହୋଇପାରେ! $SOURCE_PATH ନିମ୍ନ କର୍ଣ୍ଣଲ ସ୍ମୃତିସ୍ଥାନକୁ mmap କରିବା ପାଇଁ ଚେଷ୍ଟାକରିପାରେ।
te: మీ సిస్టమ్ తీవ్రంగా రాజీ పడవచ్చు! $SOURCE_PATH అనునది తక్కువ కెర్నల్ మెమొరీ mmapనకు ప్రయత్నించినది.
uk: Вашу систему може бути серйозно скомпрометовано! $SOURCE_PATH намагається виконати mmap для нижнього діапазону пам'яті ядра.
zh_tw: 您的系統可能已嚴重遭到入侵！$SOURCE_PATH 已嘗試 mmap 低層的內核記憶體。
