Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: SELinux denied an operation requested by wine-preloader, a program used to run Windows applications under Linux. This program is known to use an unsafe operation on system memory but so are a number of malware/exploit programs which masquerade as wine. If you were attempting to run a Windows program your only choices are to allow this operation and reduce your system security against such malware or to refrain from running Windows applications under Linux. If you were not attempting to run a Windows application this indicates you are likely being attacked by some for of malware or program trying to exploit your system for nefarious purposes. Please refer to http://wiki.winehq.org/PreloaderPageZeroProblem Which outlines the other problems wine encounters due to its unsafe use of memory and solutions to those problems.
as: SELinux wine-preloader দ্বাৰা অনুৰোধ কৰা এটা কাৰ্য্য নাকচ কৰিলে, এটা প্ৰগ্ৰাম যাক Linux ত Windows অনুপ্ৰয়োগসমূহ চলোৱাৰ বাবে ব্যৱহাৰ কৰা হয়। এই প্ৰগ্ৰামক চিস্টেম মেমৰিত এটা অসুৰক্ষিত কাৰ্য্য চলোৱাৰ বাবে জনাজাত কিন্তু লগতে কেইবাটাও দ্বেষপূৰ্ণ/লুন্ঠণ প্ৰগ্ৰামসমূহ আছে যি wine হিচাপে কাৰ্য্য কৰে। যদি আপুনি এটা Windows প্ৰগ্ৰাম চলোৱাৰ চেষ্টা কৰি আছিল আপোনাৰ একমাত্ৰ বিকল্প হল এই কাৰ্য্যৰ অনুমতি দিয়া আৰু আপোনাৰ চিস্টেমৰ সুৰক্ষাক এনেধৰণৰ দ্বেষপূৰ্ণ প্ৰগ্ৰামৰ বিপৰিতে ত্ৰাস কৰা অথবা Linux ৰ অন্তৰ্গত Windows অনুপ্ৰয়োগসমূহ নচলাব। যদি আপুনি এটা Windows অনুপ্ৰয়োগ চলোৱাৰ চেষ্টা কৰা নাই ই ইংগিত দিয়ে যে আপুনি কোনোধৰণৰ দ্বৈষপূৰ্ণ প্ৰগ্ৰাম অথবা প্ৰগ্ৰাম যি আপোনাৰ চিস্টেম কিছুমান বেয়া কাৰ্য্যৰ বাবে ব্যৱহাৰ কৰিব বিচাৰে সেইসমূহৰ দ্বাৰা আক্ৰমণিত। অনুগ্ৰহ কৰি চাওক http://wiki.winehq.org/PreloaderPageZeroProblem যি wine দ্বাৰা মেমৰিৰ অসুৰক্ষিত ব্যৱহাৰৰ বাবে সন্মুখিন হোৱা অন্য সমস্যাসমূহ আৰু সিহতৰ সমাধান দেখুৱায়।
es: SELinux negó una operación pedida por el precargador de wine, un programa usado para ejecutar una aplicación Windows bajo Linux. Este programa es conocido por usar una operación insegura sobre la memoria del sistema y también hay muchos programas malware/exploit que se enmascaran como wine. Si estuvo intentando ejecutar un programa Windows, su única opción es permitir esta operación y reducir la seguridad del sistema contra esos malware o abstenerse de ejecutar aplicaciones Windows bajo Linux. Si no está intentando ejecutar una aplicación Windows, esto indica que puede estar bajo ataque de alguno de los malware o programas que explotan su sistema con fines nefastos. Por favor, vea en http://wiki.winehq.org/PreloaderPageZeroProblem donde se delinean todos los demás problemas de wine descubiertos debido a su uso inseguro de la memoria y las soluciones a esos problemas.
gu: SELinux એ wine-preloader દ્દારા સૂચવેલ ક્રિયાને નામંજૂર કરે છે, Linux હેઠળ Windows કાર્યક્રમોને ચલાવવા માટે પ્રક્રિયા વાપરેલ છે. આ પ્રક્રિયા સિસ્ટમ મેમરી પર અસલામત ક્રિયાને વાપરવા માટે જાણીતી છે પરંતુ malware/exploit પ્રક્રિયાઓની સંખ્યા છે કે જે wine તરીકે masquerade છે. જો તમે Windows પ્રક્રિયાને ચલાવવા માટે પ્રયત્ન કર્યો હોય તો તમને ફક્ત આ ક્રિયાને પરવાનગી આપવા માટેની પસંદગી છે અને આવાં માલવેર વિરુદ્દ તમારી સિસ્ટમ સુરક્ષાને ઘટાડો અથવા Linux હેઠળ Windows કાર્યક્રમોને ચલાવવાનો ટેકો આપવા માટે તમારી સિસ્ટમ સુરક્ષાને ઘટાડો. જો તમે Windows કાર્યક્રમને ચલાવવા માટે પ્રયત્ન કર્યો ન હોય તો આ માલવેરનાં કેટલાક દ્દારા હુમલો કરવા માટે આને સૂચવે છે અથવા પ્રક્રિયા system for દુષ્ટ હેતુઓ માટે તમારી સિસ્ટમનો ઉપયોગ કરવા માટે પ્રયત્ન કરી રહ્યુ છે. Please refer to http://wiki.winehq.org/PreloaderPageZeroProblem Which outlines the other problems wine encounters due to its unsafe use of memory and solutions to those problems.
ja: SELinux は Linux 上で Windows アプリケーションを実行するのに使用されるプログラムである wine-preloader で要求された操作を拒否しました。このプログラムは wine として偽装した 違法/悪意プログラムの多くと同様に、システムメモリー上で安全でない操作を使用することで 知られています。Windows プログラムの実行を試みている場合は、この操作を許可することが 唯一の操作であり、そのような悪意のあるプログラムに対してシステムセキュリティを低下します。 さもなければ、Linux 上で Windows アプリケーションの実行を避けることです。Windows アプリケーションの 実行を試みていないのであれば、これは多分極悪な目的でユーザーのシステムに侵略を試みている 悪意のあるプログラムから攻撃を受けていることを示します。 以下のサイトを参照して下さい： http://wiki.winehq.org/PreloaderPageZeroProblem このサイトはメモリーの安全でない使用の為に wine が遭遇する他の問題とその問題への ソリューションを概要しています。
kn: ಲಿನಕ್ಸಿನಲ್ಲಿ ವಿಂಡೋಸ್ ಅನ್ವಯಗಳನ್ನು ಚಲಾಯಿಸಲು ಬಳಸಲಾಗುವ ಪ್ರೊಗ್ರಾಮ್ ಆದ wine-preloader ಇಂದ ಸಲ್ಲಿಸಲಾದ ಮನವಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ವ್ಯವಸ್ಥೆಯ ಮೆಮೊರಿಯಲ್ಲಿ ಈ ಪ್ರೊಗ್ರಾಮ್ ಅಸುರಕ್ಷಿತವಾದ ಕಾರ್ಯಾಚರಣೆಯನ್ನು ನಡೆಸುವುದು ಗೊತ್ತಿರುವ ವಿಷಯ ಅಲ್ಲದೆ ಹಲವಾರು ಮ್ಯಾಲ್‌ವೇರ್/ಮೋಸ ಮಾಡುವ ಪ್ರೊಗ್ರಾಮ್‌ಗಳು wine ಎಂದು ಸೋಗು ಹಾಕುತ್ತವೆ. ನೀವು ಒಂದು ವಿಂಡೋಸ್ ಪ್ರೊಗ್ರಾಮ್ ಅನ್ನು ಬಳಸುವಂತಿದ್ದರೆ ನಿಮಗಿರುವ ಆಯ್ಕೆ ಎಂದರೆ ಈ ಕಾರ್ಯಕ್ಕೆ ಅನುಮತಿಯನ್ನು ನೀಡಿ ಆ ಮೂಲಕ ಅಂತಹ ಮ್ಯಾಲ್‌ವೇರ್ ವಿರುದ್ಧದ ವ್ಯವಸ್ಥೆಯ ಸುರಕ್ಷತೆಯನ್ನು ಕಡಿಮೆಗೊಳಿಸಿ ಅಥವ ಲಿನಕ್ಸಿನಲ್ಲಿ ವಿಂಡೋಸ್ ಅನ್ವಯವನ್ನು ಬಳಸದಿರಿ. ನೀವು ವಿಂಡೋಸ್ ಅನ್ವಯವನ್ನು ಬಳಸಲು ಪ್ರಯತ್ನಿಸದೆ ಇದ್ದಲ್ಲಿ ನಿಮ್ಮ ಗಣಕಕ್ಕೆ ಯಾವುದೋ ಒಂದು ಮ್ಯಾಲ್‌ವೇರ್ ಧಾಳಿ ನಡೆಸಿದೆ ಅಥವ ಒಂದು ಪ್ರೊಗ್ರಾಮ್ ದುಷ್ಟ ಉದ್ಧೇಶಕ್ಕಾಗಿ ನಿಮ್ಮ ವ್ಯವಸ್ಥೆಯನ್ನು ಬಳಸಿಕೊಳ್ಳಲು ಪ್ರಯತ್ನಿಸುತ್ತಿದೆ ಎಂದರ್ಥ. ಮೆಮೊರಿಯ ಅಸುರಕ್ಷಿತ ಬಳಕೆಯಿಂದಾಗಿ wine ಎದುರಿಸುವ ತೊಂದರೆಗಳನ್ನು ಸಂಕ್ಷಿಪ್ತವಾಗಿ ವಿವರಿಸುವ ಹಾಗು ಆ ತೊಂದರೆಗಳಿಗೆ ಪರಿಹಾರಗಳನ್ನು ಸೂಚಿಸುವ ತಾಣವಾದಂತಹ http://wiki.winehq.org/PreloaderPageZeroProblem ಅನ್ನು ನೋಡಿ.
or: SELinux wine-preloader ଦ୍ୱାରା ଅନୁରୋଧ କରାଯାଇଥିବା ଗୋଟିଏ ପ୍ରୟୋଗକୁ ବାରଣ କରିଥାଏ, ଏହା Linux ଅନ୍ତର୍ଗତରେ Windows ପ୍ରୟୋଗଗୁଡ଼ିକ ଚଲାଉଥିବା ଗୋଟିଏ ପ୍ରଗ୍ରାମ ଅଟେ। ଏହି ପ୍ରଗ୍ରାମଟି ଗୋଟିଏ ଅସୁରକ୍ଷିତ ପ୍ରୟୋଗକୁ ତନ୍ତ୍ର ସ୍ମୃତିସ୍ଥାନରେ ବ୍ୟବହାର କରୁଥିବାର ଜଣାପଡ଼େ କିନ୍ତୁ ସେହିପରି କିଛି ସଂଖ୍ୟକ କ୍ଷତିକାରକ/ଠକ ପ୍ରଗ୍ରାମଗୁଡ଼ିକ ଯାହାକି wine ପରି ଅଭିନୟ କରିଥାଏ। ଯଦି ଆପଣ ଗୋଟିଏ Windows ପ୍ରଗ୍ରାମକୁ ଚଲାଇବା ପାଇଁ ଚେଷ୍ଟାକରନ୍ତି ତେବେ ଆପଣଙ୍କର କେବଳ ମାତ୍ର ଗୋଟିଏ ପସନ୍ଦ ହେଉଛି ଏହି ପ୍ରୟୋଗକୁ ଅନୁମତି ଦେବା ଏବଂ ଆପଣଙ୍କର ତନ୍ତ୍ର ସୁରକ୍ଷାକୁ ଏହିପରି କ୍ଷତିରୁ ସୁରକ୍ଷା ପ୍ରଦାନ କରିବା ପାଇଁ ଅନୁମତି ଦେଇ Windows ପ୍ରୟୋଗଗୁଡ଼ିକୁ Linux ଅନ୍ତର୍ଗତରେ ଚଲାଇଥାଏ। ଯଦି ଆପଣ ଗୋଟିଏ Windows ପ୍ରୟୋଗକୁ ଚଲାଇବା ପାଇଁ ଚେଷ୍ଟାକରୁନଥାନ୍ତି ତେବେ ଏହା ସୂଚାଇଥାଏ ଯେ ଆପଣ ସମ୍ଭବତଃ କାହା ଦ୍ୱାରା ଆକ୍ରମଣ ହୋଇଛନ୍ତି କିମ୍ବା କ୍ଷତିକାରକ ଅଥବା ପ୍ରଗ୍ରାମ ଆପଣଙ୍କର ତନ୍ତ୍ରକୁ ଖରାପ ଉଦ୍ଦେଶ୍ୟରେ ଠକିବା ପାଇଁ ଚେଷ୍ଟାକରିଥାଏ। ଦୟାକରି http://wiki.winehq.org/PreloaderPageZeroProblem କୁ ଅନୁସରଣ କରନ୍ତୁ ଯାହାକି ଅନ୍ୟାନ୍ୟ ସମସ୍ୟାଗୁଡ଼ିକୁ ରେଖାଙ୍କିତ କରିଥାଏ ସ୍ମୃତିସ୍ଥାନ ଏବଂ ସେହି ସମସ୍ୟାର ସମାଧାନ ପାଇଁ wine ର ସମ୍ମୁଖୀନ ହୋଇଥାଏ ଅସୁରକ୍ଷିତ ବ୍ୟବହାର ହେତୁ।
te: SELinux అనునది wine-preloader ద్వారా అభ్యర్ధించబడిన ఆపరేషన్‌ను తిరస్కరిస్తుంది, Windows అనువర్తనములను Linux క్రిందన నడుపుటకు వుపయోగించు ప్రోగ్రామ్. ఈ ప్రోగ్రామ్ సురక్షితంకాని ఆపరేషన్‌ను సిస్టమ్ మెమొరీ పైన వుపయోగిస్తుంది అందువలన చాలా చెడ్డ/ప్రమాదకరమైన ప్రోగ్రామ్స్ wine వలె భ్రమింపచేస్తాయి. మీరు Windows ప్రోగ్రాములను నడుపవలెననుకుంటే మీకు వున్న మార్గం దానిని అనుమతించి మీ సిస్టమ్ రక్షణను తగుప్రకారం తగ్గించడం లేదా Windows అనువర్తనములను Linux క్రింద నడుపకుండా వుండటం. మీరు Windows అనువర్తనమును నడుపుటకు ప్రయత్నించకపోతే, అది ఏమి సూచిస్తుందంటే, మీ సిస్టమ్‌కు ఘోరమైన నష్టమును కలుగజేయు ప్రోగ్రామ్ లేదా చెడ్డసాఫ్టువేర్ తో మీరు దాడికి గురైనట్లు సూచిస్తుంది. దయచేసి దీనిని చూడండి http://wiki.winehq.org/PreloaderPageZeroProblem ఇక్కడ మీరు wine అభద్ర మెమొరీ వినియోగం వలన కలుగు యితర సమస్యలను మరియు వాటి పరిష్కారాలను చూడగలరు.
uk: SELinux заборонив виконання операції, запитаної wine-preloader, програмою для запуску програм Windows на Linux. Відомо, що ця програма використовує небезпечні операції з системною пам'яттю, як і зловмисні програми, що маскуються під wine. Якщо ви намагаєтесь запустити програму Windows, можна або дозволити цю операцію, тим самим послабляючи захист системи, або відмовитись від використання програм Windows у Linux. Якщо ж ви не намагались запустити програму Windows, це означає, що ви атаковані однією з таких зловмисних програм або хтось намагається використати вашу систему. Докладнішу інформацію наведено у статті http://wiki.winehq.org/PreloaderPageZeroProblem Там описані інші проблеми,з якими зіштовхуються програма wine через небезпечні операції з пам'яттю, та можливі шляхи їх вирішення.
zh_tw: SELinux 拒絕一項來自於 wine-preloader 的作業請求，這是個用來 在 Linux 下執行 Windows 應用程式的程式。已得知這項程式會在系統記憶體上 進行一項不安全的作業，而有些惡意軟體/安全漏洞程式 也會假冒成 wine。若您要嘗試 執行一項 Windows 程式，您唯一的選擇就是允許這項 作業進行，並降低您系統對於此種惡意軟體的安全性，或是 避免在 Linux 下執行 Windows 應用程式。若您並未嘗試 執行一項 Windows 應用程式，這表示您很可能 已經受到惡意軟體的攻擊，或是某些程式正嘗試攻擊您 系統的安全性漏洞。 請參閱 http://wiki.winehq.org/PreloaderPageZeroProblem 在此描述 wine 基於未安全使用記憶體，而遇上的其它 問題，以及相關問題的解決方法。

source: you want to ignore this AVC because it is dangerous and your wine applications are working correctly.
as: আপুনি এই AVC ক উপেক্ষা কৰিব বিচাৰে কাৰণ ই বিপদজনক আৰু আপোনাৰ wine অনুপ্ৰয়োগসমূহ সঠিকভাৱে কাৰ্য্য কৰি আছে।
es: quiere ignorar este AVC ya que es peligroso y pareciera ser que sus plicaciones wine están funcionando correctamente.
gu: તમે આ AVC ને અવગણવા માંગો છો કારણ કે તે ખતરનાક છે અને તમારા wine કાર્યક્રમો યોગ્ય રીતે કામ કરી રહ્યા છે.
ja: このAVCを無効にしたい。このAVCは警告だが、wine アプリケーションは正常に動作しているため。
kn: ನೀವು ಈ AVC ಯನ್ನು ಕಡೆಗಣಿಸಲು ಬಯಸುತ್ತೀರಿ ಏಕೆಂದರೆ ಇದು ಅಪಾಯಕಾರಿಯಾಗಿದೆ ಹಾಗು ನಿಮ್ಮ wine ಅನ್ವಯಗಳು ಸರಿಯಾಗಿ ಕೆಲಸಮಾಡುತ್ತಿದೆ ಎಂದು ತೋರುತ್ತಿದೆ.
or: ଆପଣ ଏହି AVC କୁ ଅଗ୍ରାହ୍ୟ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି କାରଣ ଏହା ବିପଦ ଜନକ ଅଟେ ଏବଂ ଆପଣଙ୍କର wine ପ୍ରୟୋଗଗୁଡ଼ିକ ସଠିକ ଭାବରେ କାର୍ଯ୍ୟ କରୁଅଛି ପରି ଲାଗୁଛି।
te: ఈ AVC ప్రమాదకరమైంది మరియు మీ వైన్ అనువర్తనములు సరిగానే పనిచేయుచున్నట్లే వున్న కారణంగా మీరు దీనిని విస్మరించాలని అనుకొనుచున్నారు.
uk: ви бажаєте ігнорувати це повідомлення AVC, оскільки воно може бути небезпечним, ваші програми wine працюють у звичному режимі.
zh_tw: 您希望忽略此 AVC 因為其風險性高，並且您的 wine 應用程式正常運作中。

source: you must tell SELinux about this by enabling the wine_mmap_zero_ignore boolean.
as: আপুনি SELinux ক ইয়াৰ বিষয়ে wine_mmap_zero_ignore বুলিয়ান সামৰ্থবান কৰি কব লাগিব।
es: debe informarle esto a SELinux habilitando el booleano wine_mmap_zero_ignore.
gu: wine_mmap_zero_ignore બુલિયનને સક્રિય કરવા વિશે તમારે SELinux ને કહેવુ જ જોઇએ.
ja: これについては、SELinux に wine_mmap_zero_ignore を有効にする設定をしなければいけません。
kn: wine_mmap_zero_ignore ಬೂಲಿಯನ್ ಅನ್ನು ಶಕ್ತಗೊಳಿಸುವ ಮೂಲಕ ನೀವು SELinux ಗೆ ಇದರ ಬಗ್ಗೆ ಹೇಳಬೇಕು.
or: wine_mmap_zero_ignore ବୁଲିଆନକୁ ସକ୍ରିୟ କରି ଆପଣ SELinux କୁ ଏହା ବିଷୟରେ କହିବା ଉଚିତ।
te: wine_mmap_zero_ignore బూలియన్‌ను చేతనము చేయుట ద్వారా మీరు SELinuxకు దీని గురించి తెలుపాలి.
uk: вам слід повідомити про це SELinux наданням логічному параметру wine_mmap_zero_ignore значення true.
zh_tw: 您必須透過啟用 wine_mmap_zero_ignore 布林值來告知 SELinux 有關於此。

source: SELinux is preventing xen ($SOURCE_PATH) "$ACCESS" access to $TARGET_PATH.
as: SELinux এ $TARGET_PATH লে xen ($SOURCE_PATH) "$ACCESS" অভিগম প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a xen ($SOURCE_PATHcp
gu: SELinux એ xen ($SOURCE_PATH) "$ACCESS" વપરાશને $TARGET_PATH થી અટકાવી રહ્યું છે.
ja: SELinux は $TARGET_PATH への xen ($SOURCE_PATH) による "$ACCESS" アクセスを阻止しています。
kn: $TARGET_PATH ಅನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ xen ($SOURCE_PATH) "$ACCESS" ಅನ್ನು SELinux ತಡೆದಿದೆ.
or: SELinux xen ($SOURCE_PATH) "$ACCESS" କୁ $TARGET_PATH ରେ ଅଭିଗମ୍ୟ କରିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది xen ($SOURCE_PATH) "$ACCESS" యాక్సెస్‌ను $TARGET_PATHకు నిరోధిస్తోంది.
uk: SELinux забороняє xen ($SOURCE_PATH) доступ «$ACCESS» до $TARGET_PATH.
zh_tw: SELinux 防止 xen（$SOURCE_PATH）存取 $TARGET_PATH。

source: SELinux denied xen access to $TARGET_PATH. If this is a XEN image, it has to have a file context label of xen_image_t. The system is setup to label image files in directory /var/lib/xen/images correctly. We recommend that you copy your image file to /var/lib/xen/images. If you really want to have your xen image files in the current directory, you can relabel $TARGET_PATH to be xen_image_t using chcon. You also need to execute semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a xen image it could indicate either a bug or an intrusion attempt.
as: SELinux এ $TARGET_PATH লে xen অভিগম নাকচ কৰিলে। যদি ই এটা XEN ছবি হয়, ইয়াৰ এটা xen_image_t নথিপত্ৰ পৰিপ্ৰেক্ষতিত লেবেল থাকিব লাগিব। চিস্টেম ডাইৰেকটৰি /var/lib/xen/images ত ছবি নথিপত্ৰসমূহ সঠিকভাৱে লেবেল কৰিবলে সংস্থাপিত। আমি উপদেশ দিও যে আপুনি আপোনাৰ ছবি নথিপত্ৰক /var/lib/xen/images ছবিত কপি কৰক। যদি আপুনি সঁচাকৈ আপোনাৰ xen ছবি নথিপত্ৰসমূহক বৰ্তমান ডাইৰেকটৰিত বিচাৰে, আপুনি chcon ব্যৱহাৰ কৰি $TARGET_PATH ক xen_image_t হিচাপে পুনৰ লেবেল কৰিব পাৰিব। আপুনি লগতে এই নতুন পথক চিস্টেম অবিকল্পিত যোগ কৰিবলে semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' এক্সিকিউট কৰিব লাগিব। যদি আপুনি $TARGET_PATH ক এটা xen ছবি হিচাপে ব্যৱহাৰ কৰিম বুলি ভবা নাই ই এটা বাগ অথবা এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে।
es: SELinux le ha negado a xen el acceso a $TARGET_PATH. Si ésta es una imagen XEN, tiene que tener un contexto de archivo etiquetado como xen_image_t. El sistema está configurado para etiquetar correctamente los archivos de imagen en el directorio /var/lib/xen/images. Le recomendamos que copie su archivo de imagen en este directorio. Si realmente quiere mantener su archivo de imagen xen en el directorio actual, puede reetiquetar $TARGET_PATH para que sea un archivo xen_image_t utilizando chcon. Si hace esto, también necesitará ejecutar semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' para agregar esta nueva ruta a las predeterminadas del sistema. Si no pretende utilizar $TARGET_PATH como una imagen xen, esto puede indicar o bien un error, o bien un intento de ataque.
gu: SELinux એ $TARGET_PATH માં xen પ્રવેશ માટે નામંજૂર થયેલ છે. જો XEN ઇમેજ હોય તો, તેની પાસે xen_image_t ની ફાઇલ સંદર્ભ લેબલ હોવુ જ જોઇએ. સિસ્ટમ એ ડિરેક્ટરી /var/lib/xen/images માં ઇમેજ ફાઇલોને લેબલ કરવા માટે સુયોજિત છે. અમે માન્ય રાખેલ છે કે /var/lib/xen/ ઇમેજોમાં તમારી ઇમેજ ફાઇલની નકલ કરો. જો હાલની ડિરેક્ટરીમાં તમારી xen ઇમેજ ફાઇલોને રાખવા માટે ખરેખર ઇચ્છતા હોય તો, તમે chcon ની મદદથી xen_image_t નાં $TARGET_PATH ને પુન:લેબલ કરી શકો છો. તમને સિસ્ટમ મૂળભૂતોનાં આ નવા પાથને ઉમેરવા માટે semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' ને ચલાવવાની જરૂર પડશે. જો તમે xen તરીકે $TARGET_PATH ને વાપરવા માટે ઇરાદો ન હોય તો તે ક્યાંતો બૂલ અથવા ઘૂંસણખોરીનો પ્રયત્ન કરી શક્યુ હોત.
ja: SELinux は xen の $TARGET_PATH へのアクセスを拒否しました。 これが XEN イメージの場合は、xen_image_t のファイルコンテキストラベルが必要です。 システムは /var/lib/xen/image ディレクトリー内で正しくイメージファイルをラベル付けするようにセットアップされています。 ユーザーのイメージファイルをこの /var/lib/xen/image ディレクトリーへコピーすることを推奨します。 xen イメージファイルを本当に現在のディレクトリー内に置きたい場合は、chcon を使用して $TARGET_PATH を xen_image_t にラベル付け替えをすることができます。 また、semanage fcontext -a -t xen_image_t $FIX_TATGET_PATH も実行して、 この新しいパスをシステムデフォルトに追加する必要があります。$TARGET_PATH を xen イメージとして使用するつもりでなかった場合は、 それは、バグを示すか、又は不正侵入の試みの示す可能性があります。
kn: $TARGET_PATH ಗೆ xen ಅನುಮತಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ಇದು ಒಂದು XEN ಚಿತ್ರಿಕೆಯಾಗಿದ್ದರೆ, xen_image_t ನ ಒಂದು ಕಡತ ಸನ್ನಿವೇಶ ಲೇಬಲ್ ಅನ್ನು ಹೊಂದಿರಬೇಕು. ಗಣಕವು ಕೋಶ /var/lib/xen/images ದಲ್ಲಿನ ಕಡತಗಳಿಗೆ ಸಮರ್ಪಕವಾಗಿ ಲೇಬಲ್ ಮಾಡಲು ಸಜ್ಜುಗೊಳಿಸಲಾಗಿದೆ /var/lib/xen/images ಗೆ ನಿಮ್ಮ ಕಡತಗಳನ್ನು ನಕಲು ಮಾಡಲು ಸೂಚಿಸುತ್ತೇವೆ. ನಿಮ್ಮ xen ಚಿತ್ರಿಕಾ ಕಡತಗಳನ್ನು ಈಗಿನ ಕಡತಕೋಶದಲ್ಲಿ ನಿಜವಾಗಲೂ ಇರಿಸಲು ಬಯಸಿದಲ್ಲಿ, ನೀವು$TARGET_PATH ಅನ್ನು chcon ಬಳಸಿಕೊಂಡು xen_image_t ಆಗಿ ಮರು ಲೇಬಲ್ ಮಾಡಬಹುದು. ಗಣಕ ಪೂರ್ವನಿಯೋಜಿತಗಳಿಗೆ ಈ ಹೊಸ ಮಾರ್ಗವನ್ನು ಸೇರಿಸಲು semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಬೇಕಾಗುತ್ತದೆ ನೀವು $TARGET_PATH ಅನ್ನು ಒಂದು xen ಚಿತ್ರಿಕೆಯಾಗಿ ಬಳಸಲು ಬಯಸಿಲ್ಲದೆ ಹೋಗಿದ್ದರೆ ಇದು ಒಂದು ದೋಷ ಅಥವ ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲಾಗುವುದು.
or: SELinux $TARGET_PATH ରେ xen ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଅଛି। ଯଦି ଏହା ଗୋଟିଏ XEN ପ୍ରତିଛବି, ତେବେ ଏଥିରେ xen_image_t ର ଗୋଟିଏ ଫାଇଲ ପ୍ରସଙ୍ଗ ନାମପଟି ଥିବା ଉଚିତ। ତନ୍ତ୍ରରେ ନାମପଟି ଫାଇଲଗୁଡ଼ିକୁ ଡିରେକ୍ଟୋରୀ /var/lib/xen/images ରେ ନକଲ କରିବା ପାଇଁ ସଠିକ ଭାବରେ ସେଟ କରାଯାଇଛି। ଆମେ ପରାମର୍ଶ ଦେଉଅଛୁ ଯେ ଆପଣ ଆପଣଙ୍କର ପ୍ରତିଛବି ଫାଇଲକୁ /var/lib/xen/images ରେ ନକଲ କରନ୍ତୁ। ଯଦି ଆପଣ ପ୍ରକୃତରେ ପ୍ରଚଳିତ ଡିରେକ୍ଟୋରୀରେ xen ପ୍ରତିଛବିକୁ ରଖିବାକୁ ଚାହୁଁଛନ୍ତି, ତେବେ ଆପଣ $TARGET_PATH କୁ xen_image_t ଭାବରେ chcon ବ୍ୟବହାର କରି ପୁନଃନାମକରଣ କରିପାରିବେ। ଆପଣଙ୍କୁ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ତନ୍ତ୍ରରେ ନୂତନ ପଥ ଯୋଗ କରିବା ପାଇଁ semanage fcontext -a -t xen_image_t'$TARGET_PATH' କୁ ମଧ୍ଯ ନିଷ୍ପାଦନ କରିବାକୁ ହୋଇପାରେ। ଯଦି ଆପଣ $TARGET_PATH କୁ xen ଭାବରେ ବ୍ୟବହାର କରିବାକୁ ଚାହୁଁନାହାନ୍ତି ତେବେ ଏହା ଗୋଟିଏ ତ୍ରୁଟି ଭାବରେ ଦୃଶ୍ୟମାନ ହୋଇପାରେ ଅଥବା ବିନାଅନୁମତିରେ ପ୍ରବେଶ ପ୍ରଚେଷ୍ଟା କରିପାରେ।
te: SELinux అనునది xen యాక్సెస్‌ను $TARGET_PATHకు నిరాకరిస్తుంది. ఇది XEN ప్రతిబింబము అయితే గనుక, ఇది xen_image_t యొక్క దస్త్ర సందర్భ లేబుల్ కలిగివుండాలి. సిస్టమ్ అనునది లేబుల్ ప్రతిబింబము దస్త్రములకు డైరెక్టరీ /var/lib/xen/images నందు సరిగా అమర్చాలి. మీరు మీ ప్రతిబింబ దస్త్రమును /var/lib/xen/images కు నకలుతీయుట మేము సమర్దస్తున్నాము. మీరు నింజగా మీ xen ప్రతిబింబము దస్త్రములను ప్రస్తుత డైరెక్టరీనందు కలిగివుండాలని అనుకుంటే, మీరు $TARGET_PATH అనుదానిని xen_image_tకు chcon వుపయోగించి తగిలించవచ్చు. ఈ కొత్త పాత్‌ను సిస్టమ్ అప్రమేయాలకు జతచేయుటకు మీరు దీనిని కూడా నిర్వర్తుంచవలసివుంటుంది fcontext -a -t xen_image_t '$FIX_TARGET_PATH'. మీరు $TARGET_PATH ను xen ప్రతిబింబమువలె వాడకపోతే అది బగ్‌ను లేదా అమర్యాద దాడిని సూచిస్తుంది.
uk: SELinux закрила доступ xen до $TARGET_PATH. Якщо це образ XEN, він повинен мати мітку контексту xen_image_t. Система налаштована правильно маркувати образи у, /var/lib/xen/image. Ми рекомендуємо скопіювати файл у цей каталог. Якщо ви справді бажаєте працювати з образами xen у цьому каталозі, ви можете перемаркувати $TARGET_PATH як файл/каталог xen_image_t, використовуючи chcon. Після цього треба також виконати команду «semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'», щоб додати новий шлях у типовий системний список. Якщо ви не планували використовувати $TARGET_PATH як образ xen, можливо це помилка, або спроба вторгнення.
zh_tw: SELinux 拒絕 xen 存取 $TARGET_PATH。 若這是個 XEN 映像檔的話，它必須要有個檔案情境標籤 為 xen_image_t。該系統已被設置能正確地標記 /var/lib/xen/images 目錄中的映像檔。我們建議您將您的映像檔複製至 /var/lib/xen/images。 若您希望您的 xen 映像檔位於目前的目錄中的話，您可透過使用chcon 來將 $TARGET_PATH 重新標記為 xen_image_t。您也需要執行 semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' 才可將此 新路徑新增至系統預設值。若您並未嘗試使用 $TARGET_PATH 來作為一個 xen 映像檔的話，這顯示可能有項錯誤或是系統已遭到入侵的警訊。

source: You can alter the file context by executing chcon -t xen_image_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
as: আপুনি chcon -t xen_image_t '$TARGET_PATH' এক্সিকিউট কৰি নথিপত্ৰ পৰিপ্ৰেক্ষতিত সলনি কৰিব পাৰিব আপুনি লগতে চিস্টেমৰ অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহ সলনি কৰিব লাগিব যাতে সিহতক এটা সম্পূৰ্ণ পুনৰলেবেলত সংৰক্ষণ কৰিব পাৰি। "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo ejecutando chcon -t xen_image_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo del sistema. "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
gu: તમે chcon -t xen_image_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઈલોને પણ સંપૂર્ણ પુન:લેબલ કરવા પર તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર બદલવી જ પડશે . "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
ja: chcon -t xen_image_t '$TARGET_PATH' を実行すると、ファイルコンテキストの 変更ができます。 また、完全な再ラベルの後でもそれらが保持できるようにシステム上でデフォルトのファイルコンテキストファイルの変更もしなければなりません。"semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
kn: chcon -t xen_image_t '$TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ ಕಡತದ ಸನ್ನಿವೇಶವನ್ನು ಬದಲಾಯಿಸಬಹುದು ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
or: ଆପଣ chcon -t xen_image_t '$TARGET_PATH' କୁ ନିଷ୍ପାଦନ କରି ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ବଦଳାଇପାରିବେ ସେମାନଙ୍କୁ ସମ୍ପୂର୍ଣ୍ଣ ପୁନଃ ନାମକରଣରେ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ଆପଣ ମଧ୍ଯ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ଫାଇଲକୁ ତନ୍ତ୍ରରେ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "semanage fcontext -a -t xen_image_t '$TARGET_PATH'"
te: మీరు దస్త్ర సందర్భమును chcon -t xen_image_t '$TARGET_PATH' నిర్వర్తించుట ద్వారా మీరు మార్చవచ్చు మీరు అప్రమేయ దస్త్రము సందర్భ దస్త్రములను కూడా సిస్టమ్ నందు పూర్తి చేరికతో వుంచుటకు క్రమానుగతంగా మార్చవలెను. "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
uk: Файловий контекст можна змінити, виконуючи команду «chcon -t xen_image_t '$TARGET_PATH'» Також треба змінити типові контексти файлів= у системі, щоб вони збереглись навіть при повторній розмітці. «semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'»
zh_tw: 您可透過執行 chcon -t xen_image_t '$TARGET_PATH' 來修改檔案情境 您也必須更改系統上的預設檔案情境檔，才能在完整標記的情況下將它們保留住。「semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'」

source: If you want to allow ftp to read and write files in the user home directories
as: যদি আপুনি ftp ক ব্যৱহাৰকাৰী ঘৰ ডাইৰেকটৰিসমূহত নথিপত্ৰসমূহ পঢ়া আৰু লিখাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir a ftp que lea y genere archivos en los directorios personales del usuario
gu: જો તમે વપરાશકર્તા ઘર ડિરેક્ટરીઓમાં ફાઇલોને વાંચવા અને લખવા માટે ftp ને પરવાનગી આપવા માંગો છો
ja: ftp が、 ユーザのホームディレクトリのファイルを読み書きすることを、もし許可したい場合
kn: ftp ಯು ಬಳಕೆದಾರ ನೆಲೆ ಕೋಶಗಳನ್ನು ಓದಲು ಹಾಗು ಬರೆಯಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ
or: ଯଦି ଆପଣ ଚାଳକ ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକରେ ଫାଇଲଗୁଡ଼ିକୁ ପଢ଼ିବା ଏବଂ ଲେଖିବା ପାଇଁ ftp କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: వాడుకరి నివాస డైరెక్టరీలనందు మీరు ఫైళ్ళను చదువుటకు మరియు వ్రాయుటకు ftp ను అనుమతించాలంటే
uk: Якщо ви бажаєте надати доступ ftp до читання і запису файлів до домашніх каталогів користувачів
zh_tw: 若您希望允許 ftp 能在使用者家目錄中讀取和寫入檔案

source: If you want to allow privoxy to connect to all ports, not just HTTP, FTP, and Gopher ports.
as: যদি আপুনি privoxy ক কেৱল HTTP, FTP, আৰু Gopher পোৰ্টসমূহৰ বাহিৰেও সকলো পোৰ্টলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que privoxy se conecte con todos los puesrtos, y no solamente con los puertos HTTP, FTP y Gopher.
gu: જો તમે બધા પોર્ટો સાથે જોડાવા માટે privoxy ને પરવાનગી આપવા માંગો છો, HTTP, FTP, અને Gopher પોર્ટો ફક્ત જ નથી.
ja: privoxy が、HTTP, FTP, Gopherを含むすべてのポートに接続することを、もし許可したい場合
kn: privoxy ಯು ಕೇವಲ HTTP, FTP, ಹಾಗು Gopher ಸಂಪರ್ಕಸ್ಥಾನಗಳಲ್ಲದೆ ಎಲ್ಲಾ ಸಂಪರ್ಕಸ್ಥಾನಗಳಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ privoxy କୁ HTTP, FTP, ଏବଂ Gopher ପୋର୍ଟଗୁଡ଼ିକ ସହିତ ବାକି ସମସ୍ତ ପୋର୍ଟଗୁଡ଼ିକ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: HTTP, FTP, మరియు Gopher పోర్ట్సే కాకుండా, అన్ని పోర్టులకు అనుసంధానించుటకు మీరు ప్రోక్సీను అనుమతించాలంటే.
uk: Якщо ви бажаєте надати доступ privoxy на встановлення з’єднань на всіх портах, а не лише портах HTTP, FTP і Gopher.
zh_tw: 若您希望允許 privoxy 連至所有連接埠，而非只是 HTTP、FTP 以及 Gopher 連接埠。

source: If you want to allow the graphical login program to login directly as sysadm_r:sysadm_t
as: যদি আপুনি গ্ৰাফীয় প্ৰৱেশ প্ৰগ্ৰামক sysadm_r:sysadm_t হিচাপে প্ৰত্যক্ষভাৱে প্ৰৱেশ কৰাব বিচাৰে
es: Si desea permitir que el programa gráfico de registro se registre directamente como sysadm_r:sysadm_t
gu: જો તમે sysadm_r:sysadm_t તરીકે સીધુ જ પ્રવેશવા માટે ગ્રાફિકલ લૉગિન કાર્યક્રમને પરવાનગી આપવા માંગો છો
ja: グラフィカルログインプログラムが、 sysadm_r:sysadm_t として直接ログインすることを、 もし許可したい場合
kn: sysadm_r:sysadm_t ಆಗಿ ಚಿತ್ರಾತ್ಮಕ ಪ್ರೊಗ್ರಾಮ್ ನೇರವಾಗಿ ಪ್ರವೇಶಿಸಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ଆଲେଖିକ ଲଗଇନ ପ୍ରଗ୍ରାମକୁ ସିଧାସଳଖ sysadm_r:sysadm_t ଭାବରେ ଲଗଇନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଇଚ୍ଛା କରୁଛନ୍ତି
te: మీరు గ్రాఫికల్ లాగిన్ ప్రోగ్రామ్‌ను నేరుగా sysadm_r:sysadm_t గా లాగిన్ అగుటకు అనుమతించాలంటే
uk: Якщо ви бажаєте дозволити графічній програмі входу до системи впускати користувача sysadm_r:sysadm_t
zh_tw: 若您希望允許使用圖形化登錄程式，直接以 sysadm_r:sysadm_t 身份登入

source: If you want to allow xen to manage nfs files
as: যদি আপুনি xen ক nfs নথিপত্ৰসমূহ ব্যৱস্থাপনা কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que xen administre archivos nfs
gu: જો તમે nfs ફાઇલોને સંચાલિત કરવા માટે xen ને પરવાનગી આપવા માંગો છો
ja: xen が、 nfs ファイルを管理することを、もし許可したい場合
kn: nfs ಕಡತಗಳನ್ನು ನಿರ್ವಹಿಸಲು ನೀವು xen ಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ xen କୁ nfs ଫାଇଲଗୁଡ଼ିକୁ ପରିଚାଳନା କରିବା ପାଇଁ
te: మీరు xenను nfs ఫైళ్ళను నిర్వహించుటకు అనుమతించాలంటే
uk: Якщо ви бажаєте надати доступ xen на керування файлами nfs
zh_tw: 若您希望允許 xen 來管理 nfs 檔案
