Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: The $SOURCE application attempted to load $TARGET_PATH which requires text relocation. This is a potential security problem. Most libraries should not need this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html"> SELinux Memory Protection Tests</a> web page explains this check. This tool examined the library and it looks like it was built correctly. So setroubleshoot can not determine if this application is compromized or not. This could be a serious issue. Your system may very well be compromised. Contact your security administrator and report this issue.
as: $SOURCE অনুপ্ৰয়োগে $TARGET_PATH ল'ড কৰাৰ চেষ্টা কৰিছে যাৰ পাঠ আবন্টনৰ প্ৰয়োজন। ই এটা বিভৱীয় সুৰক্ষা সমস্যা। বেছিৰভাগ লাইব্ৰেৰীৰ এই অনুমতিৰ প্ৰয়োজন নহয়। <a href="http://people.redhat.com/drepper/selinux-mem.html"> SELinux মেমৰি সুৰক্ষা পৰিক্ষাসমূহ</a> ৱেব পৃষ্ঠায় এই নীৰিক্ষণৰ বিৱৰণ দিয়ে। এই সঁজুলিয়ে লাইব্ৰেৰী পৰিক্ষণ কৰিলে আৰু এনে উপলব্ধ হৈছে যে ইয়াক সঠিকভাৱে নিৰ্মাণ কৰা হৈছিল। সেয়েহে setroubleshoot এ নিৰ্ধৰণ কৰিব নোৱাৰে এই অনুপ্ৰয়োগ সঠিক হয় নে নহয়। ই এটা গুৰুতৰ সমস্যা হব পাৰে। আপোনাৰ চিস্টেমত সলসলনি হব পাৰে। আপোনাৰ সুৰক্ষা প্ৰশাসকক যোগাযোগ কৰক আৰু এই বিষয়ে সূচীত কৰক।
es: La aplicación $SOURCE intentó cargar $TARGET_PATH que requiere reasignación de texto. Esto es un problema de seguridad potencial. La mayoría de las bibliotecas no necesitan este permiso. La página web de <a href="http://people.redhat.com/drepper/selinux-mem.html">Pruebas de Protección de Memoria en SELinux</a> explica cómo eliminar este requerimiento. Esta herramienta examinó la biblioteca y parece que fue construida correctamente. Por eso setroubleshoot no puede determinar si esta aplicación está comprometida o no. Esto puede ser algo serio. Su sistema bien puede estar comprometido. Contacte a su administrador de seguridad e informe esto.
gu: $SOURCE કાર્યક્રમ એ $TARGET_PATH લોડ કરવા જઈ રહ્યું છે કે જેને લખાણ પુનઃસ્થાનિકરણ જરૂરી છે. આ સંભવિત સુરક્ષા સમસ્યા છે. મોટા ભાગની લાઈબ્રેરીઓને આ પરવાનગીની જરૂર નથી. લાઈબ્રેરીઓ અમુકવાર અયોગ્ય રીતે કોડ થયેલ હોય છે અને આ પરવાનગી માટે અરજી કરે છે. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> વેબ પાનું કેવી રીતે આ જરૂરીયાત દૂર કરવી તે સમજાવે છે. તમે $TARGET_PATH ને કામ કરવા માટે પુનઃસ્થાનિકરણ વાપરવા માટે પરવાનગી આપવા માટે SELinux ને કામચલાઉ રીતે રૂપરેખાંકિત કરી શકો છો, જ્યાં સુધી લાઈબ્રેરી ચોક્કસ નહિં થાય. મહેરબાની કરીને આ પેકેજ વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો.
ja: $SOURCE アプリケーションは、テキストのリロケーションが必要な $TARGET_PATH をロードしようとしました。 セキュリティー上の問題となる可能性があります。 ほとんどのライブラリーはこのパーミッションを必要としません。 <a href="http://people.redhat.com/drepper/selinux-mem.html"> SELinux Memory Protection Tests</a> のウェブページではこのチェックを説明しています。 このツールはライブラリーが正しく 構築されたかを調べます。だから setroubleshoot はこのアプリケーションが信用でき ないかどうかを決めません。これは重大な問題になりかねません。あなたのシステムは 損傷を受けているかもしれません。 セキュリティー管理者に連絡し、この問題をレポートしてください。
kn: ಪಠ್ಯ ಸ್ಥಳಾಂತರದ ಅಗತ್ಯವಿರುವ $TARGET_PATH ಅನ್ನು ಲೋಡ್ ‍ಮಾಡಲು $SOURCE ಅನ್ವಯವು ಪ್ರಯತ್ನಿಸಿದೆ. ಇದೊಂದು ದೊಡ್ಡದಾದ ಸುರಕ್ಷತಾ ಲೋಪ. ಹೆಚ್ಚಿನ ಲೈಬ್ರರಿಗಳಿಗೆ ಅನುಮತಿಯ ಅಗತ್ಯವಿರುವುದಿಲ್ಲ. ಲೈಬ್ರರಿಗಳು ಕೆಲವು ಬಾರಿ ತಪ್ಪಾಗಿ ಕೋಡ್ ಮಾಡಲ್ಪಟ್ಟು ಈ ಅನುಮತಿಗೆ ಮನವಿ ಸಲ್ಲಿಸುತ್ತವೆ. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> ಜಾಲ ಪುಟವು ಈ ಪರಿಶೀಲನೆಯನ್ನು ವಿವರಿಸುತ್ತದೆ. ಈ ಉಪಕರಣವು ಲೈಬ್ರರಿಯನ್ನು ಪರಿಶೀಲಿಸಿದೆ ಹಾಗು ಇದು ಸರಿಯಾಗಿ ನಿರ್ಮಿಸಲ್ಪಟ್ಟಿದೆ ಎಂದು ತೋರುತ್ತಿದೆ. ಆದ್ದರಿಂದ ಈ ಅನ್ವಯವು ಸಂಧಾನ ಮಾಡಿಕೊಂಡಿದೆಯೆ ಎಂದು ನಿರ್ಧರಿಸಲು setroubleshoot ಗೆ ಸಾಧ್ಯವಾಗಿಲ್ಲ.ಇದು ಒಂದು ಗಂಭೀರವಾದ ಸಮಸ್ಯೆಯಾಗಿದೆ. ನಿಮ್ಮ ಗಣಕವು ನಿಮ್ಮ ಗಣಕ ವ್ಯವಸ್ಥಾಪಕರನ್ನು ಸಂಪರ್ಕಿಸಿ ಹಾಗು ಈ ತೊಂದರೆಯ ಬಗೆಗೆ ವರದಿಯನ್ನು ಸಲ್ಲಿಸಿ.
or: $SOURCE ପ୍ରୟୋଗ $TARGET_PATH କୁ ଧାରଣ କରିବା ପାଇଁ ଚେଷ୍ଟା କରିଛି ଯାହାକି ପାଠ୍ୟ ପୁନଃସ୍ଥାପନ ଆବଶ୍ୟକ କରିଥାଏ। ଏହା ଗୋଟିଏ ଶକ୍ତି ସାମର୍ଥ୍ୟ ସୁରକ୍ଷା ସମସ୍ୟା। ଅଧିକାଂଶ ଲାଇବ୍ରେରୀ ଏହି ଅନୁମତିକୁ ଆବଶ୍ୟକ କରନ୍ତି ନାହିଁ। ଏହି <a href="http://people.redhat.com/drepper/selinux-mem.html"> SELinux Memory Protection Tests</a> ୱେବ ପୃଷ୍ଠା ଆବଶ୍ୟକତାକୁ କିପରି ପୁରଣ କରାଯିବ ତାହା ବର୍ଣ୍ଣନା କରିଥାଏ। ଏହି ଉପକରଣ ଲାଇବ୍ରେରୀକୁ ପରୀକ୍ଷା କରିଥାଏ ଏବଂ ଏହା ଠିକ ଭାବରେ ନିର୍ମିତ ହୋଇଛି ପରି ଦେଖାଯାଏ। ତେଣୁ setroubleshoot ଏହାକୁ ନିର୍ଦ୍ଧାରଣ କରିପାରିନଥାଏ ଯଦି ଏହା ପ୍ରୟୋଗକୁ ସମର୍ପଣ କରାହୋଇଛି କି ନାହିଁ। ଏହା ଗୋଟିଏ ଗୁରୁତର ସମସ୍ୟା ହୋଇପାରେ। ଆପଣଙ୍କର ତନ୍ତ୍ର ସମର୍ପଣ କରିଥାଇପାରେ। ଆପଣଙ୍କର ସୁରକ୍ଷା ପ୍ରଶାସକଙ୍କ ସହିତ ଯୋଗାଯୋଗ କରନ୍ତୁ ଏବଂ ଏହି ସମସ୍ୟାକୁ ଖବର କରନ୍ତୁ। ....
te: $SOURCE అనువర్తనం అనునది $TARGET_PATH ను నింపుటకు ఏదైతే పాఠ్యము పునఃస్థానీకరిణ అవసరమౌతుందో యత్నిస్తుంది. ఇది ఖచ్చితంగా రక్షణ సమస్య. చాలా లైబ్రరీస్ కు ఈ అనుమతి అవసరం లేదు. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> వెబ్‌పుట ఈ చెక్‌ను వివరిస్తుంది. ఈ సాధనము లైబ్రరీను పరీక్షిస్తుంది మరియు యిది సరిగా నిర్మించబడినట్లు కనిపిస్తోంది. అందుకని setroubleshoot ఈ అనువర్తనము రాజీబడినదో లేదో నిర్దారించ లేదు. ఇది తీవ్రమైన సమస్య కాగలదు. మీ సిస్టమ్ చాలా బాగా రాజీపడవచ్చు. మీ రక్షణ నిర్వహణాధికారిని సంప్రదించండి ఈ సమస్యను నివేదించండి.
uk: Програма $SOURCE спробувала завантажити $TARGET_PATH, яка вимагає переміщення. Це потенційна проблема з точки зору безпеки. Більшість бібліотек цього не вимагають. Іноді бібліотеки написані некоректно та вимагають таку можливість. У документі <a href="http://people.redhat.com/drepper/selinux-mem.html">Тести захисту пам'яті SELinux</a> пояснюється як відмовитись від використання такої можливості. Ця утиліта проаналізувала бібліотеку, але, швидше за все, її зібрано правильно. setroubleshoot не може точно визначити, чи була ця програма скомпрометована. Це досить серйозна проблема. Повідомте про цю проблему вашого адміністратора з безпеки.
zh_tw: $SOURCE 應用程式嘗試載入需要文字重定位 的 $TARGET_PATH。這是個潛在的安全性問題。 大部分的函式庫都應該不需要此許可。 <a href="http://people.redhat.com/drepper/selinux-mem.html"> SELinux 記憶體保護測試</a> 網頁解釋這項檢查。此工具檢查函式庫並且該函式庫看 起來已正確建置。因為如此，setroubleshoot 無法判斷此應用程式 是否已自訂化。這會是個嚴重的問題。您的 系統可能會遭到入侵。 請聯絡您的安全性管理員並回報這項問題。

source: If you trust $TARGET_PATH to run correctly, you can change the file context to textrel_shlib_t. "chcon -t textrel_shlib_t '$TARGET_PATH'" You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
as: যদি আপুনি $TARGET_PATH সঠিকভাৱে চলিব বুলি ভৰষা কৰে, আপুনি নথিপত্ৰ পৰিপ্ৰেক্ষতিতক textrel_shlib_t. "chcon -t textrel_shlib_t '$TARGET_PATH'" লে সলনি কৰিব পাৰে আপুনি লগতে চিস্টেমত অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহ সলনি কৰিব পাৰে সিহতক এটা সম্পূৰ্ণ পুনৰলেবেলত সংৰক্ষণ কৰিবলে "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
es: Si confía en que $TARGET_PATH se ejecutará correctamente, puede modificar el contexto de archivo a textrel_shlib_t. "chcon -t textrel_shlib_t '$TARGET_PATH'" También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
gu: જો તમને $TARGET_PATH ને ચલાવવાનો વિશ્વાસ હોય, તો તમે ફાઈલ સંદર્ભને textrel_shlib_t માં બદલી શકો છો. "chcon -t textrel_shlib_t $TARGET_PATH" તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઈલોને સંપૂર્ણ પુન:લેબલ પર પણ તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર બદલવી જ પડશે. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
ja: $TARGET_PATH が正しく実行することを信用できる場合は、ファイルコンテキストを textrel_shlib_t へ変更することができます。"chcon -t textrel_shlib_t $TARGET_PATH" また、システム上のデフォルトファイルコンテキストのファイルを完全な再ラベルでも保持するようにそれらを変更しなければなりません。"semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
kn: $TARGET_PATH ವು ಸರಿಯಾಗಿ ಚಲಾಯಿತಗೊಳ್ಳಲು ನೀವು ನಂಬುವುದಾದರೆ, ಕಾರ್ಯಗತಗೊಳಿಸಬಹುದಾದ ಸನ್ನಿವೇಶವನ್ನು ನೀವು textrel_shlib_t ಗೆ ಬದಲಾಯಿಸಬಹುದಾಗಿದೆ. "chcon -t textrel_shlib_t '$TARGET_PATH'" ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
or: ଯଦି ଆପଣ $TARGET_PATH କୁ ସଠିକ ବାବରେ ଚାଲୁ ବୋଲି ବିଶ୍ୱାସ କରନ୍ତି, ତେବେ ଆପଣ ଏହି ଫାଇଲର ପ୍ରସଙ୍ଗକୁ textrel_shlib_t ରେ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "chcon -t textrel_shlib_t '$TARGET_PATH'" ଆପଣ ମଧ୍ଯ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ତନ୍ତ୍ରରେ ସମ୍ପୂର୍ଣ ପୁନଃନାମକରଣ କରି ସଂରକ୍ଷଣ କରିବା ପାଇଁ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
te: మీరు $TARGET_PATH ను సరిగానడుపుటకు నమ్మినట్లైతే, మీరు దస్త్రము సందర్భంను textrel_shlib_t కు మార్చవచ్చు. "chcon -t textrel_shlib_t 'TARGET_PATH'" మీరు అప్రమేయ దస్త్ర సందర్భ దస్త్రములను సిస్టమ్ నందు క్రమానుగతంగా పూర్తి చేరికతో వుంచుటకొరకు మార్చవలెను. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
uk: Якщо ви довіряєте $TARGET_PATH, то можна замінити контекст файлу на textrel_shlib_t. «chcon -t textrel_shlib_t $TARGET_PATH» Також треба змінити типові контексти файлів у системі, щоб вони збереглись навіть при повторній розмітці. «semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'»
zh_tw: 若您信任 $TARGET_PATH 可正確執行的話，您可將 檔案 context 更改為 textrel_shlib_t。「chcon -t textrel_shlib_t '$TARGET_PATH'」 您也必須要更改系統上的預設檔案情境檔才可將它們保留（就算是進行完全重新標記後）。「semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'」

source: SELinux is preventing $SOURCE_PATH from making the program stack executable.
as: SELinux এ $SOURCE_PATH ক প্ৰগ্ৰাম স্টেকক এক্সিকিউটেবুল কৰাৰ পৰা প্ৰতিৰোধ কৰি আছে।
es: SELinux está previniendo acerca de la intención de $SOURCE_PATHde hacer la pila del programa ejecutable.
gu: SELinux એ $SOURCE_PATH ને કાર્યક્રમ સ્ટેક એક્ઝેક્યુટેબલ બનાવવાથી અટકાવી રહ્યું છે.
ja: SELinux は $SOURCE_PATH がプログラムスタックを実行可能にすることを阻止しています。
kn: ಪ್ರೋಗ್ರಾಂ ಸ್ಟಾಕ್ ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸದಂತೆ $SOURCE_PATH ಅನ್ನು SELinux ತಡೆದಿದೆ.
or: SELinux $SOURCE_PATH କୁ ପ୍ରୋଗ୍ରାମ ଥାକକୁ ନିଷ୍ପଦନୀୟ ଭାବରେ ପ୍ରସ୍ତୁତ କରିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH ను ప్రోగ్రామ్ ను స్టాక్ ఎక్సిక్యూటబుల్ గా మార్చుటనుండి నిరోధిస్తుంది.
uk: SELinux забороняє $SOURCE_PATH визначати програмний стек як виконуваний.
zh_tw: SELinux 防止 $SOURCE_PATH 使程式堆疊變得可執行。

source: The $SOURCE application attempted to make its stack executable. This is a potential security problem. This should never ever be necessary. Stack memory is not executable on most OSes these days and this will not change. Executable stack memory is one of the biggest security problems. An execstack error might in fact be most likely raised by malicious code. Applications are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. If $SOURCE does not work and you need it to work, you can configure SELinux temporarily to allow this access until the application is fixed. Please file a bug report.
as: $SOURCE অনুপ্ৰয়োগে তাৰ স্টেককক এক্সিকিউটেবুল কৰাৰ চেষ্টা কৰিলে। ই এটা বিভৱীয় সুৰক্ষা সমস্যা। ই কেতিয়াও প্ৰয়োজনীয়ও হব নালাগে। আজিকালী ক্টেক মেমৰি বহুতো OS ত প্ৰেৰণ কৰিব নোৱাৰি আৰু ই সলনি নহয়। এক্সিকিউটেবুল স্টেক মেমৰি গুৰুত্বপূৰ্ণ সুৰক্ষা সমস্যাসমূহৰ এটা। এটা execstack ত্ৰুটি ত্ৰুটিপূৰ্ণ ক'ড দ্বাৰা উত্থাপন হব পাৰে। অনুপ্ৰয়োগসমূহক কেতিয়াবা ভূলভাৱে ক'ড কৰা হয় আৰু এই অনুমতি অনুৰোধ কৰে। <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux মেমৰি সুৰক্ষা পৰিক্ষাসমূহ</a> ৱেব পৃষ্ঠায় কেনেদৰে এই প্ৰয়োজনীয়তা আতৰাব তাৰ বিৱৰণ দিয়ে। যদি $SOURCE কাৰ্য্যত নহয় আৰু আপোনাৰ ইয়াক কাৰ্য্যত কৰাৰ প্ৰয়োজন হয়, আপুনি SELinux ক অস্থায়ীভাৱে এই অভিগমৰ অনুমতি দিবলে সংৰূপণ কৰিব পাৰে যেতিয়ালৈকে অনুপ্ৰয়োগ ঠিক হৈ নাযায়। অনুগ্ৰহ কৰি এটা বাগ সংবাদ জমা দিয়ক।
es: La aplicación $SOURCE intentó hacer su pila ejecutable. Este es un problema de seguridad potencial. Nunca debe ser necesario. La memoria de la pila no es ejecutable en la mayoría de los sistemas operativos actuales y esto no cambiará. Una memoria de pila ejecutable es uno de los mayores problemas de seguridad. Un error de ejecución en pila puede en realidad ser generado a propósito por código malicioso. Las aplicaciones son a a veces codificadas incorrectamente y requieren este permiso. La página web de <a href="http://people.redhat.com/drepper/selinux-mem.html">Pruebas de Protección de Memoria en SELinux</a> explica cómo eliminar este requerimiento. Si $SOURCE no funciona y necesita que lo haga, puede configurar SELinux para que permita temporalmente este acceso hasta que se corrija la aplicación. Por favor, haga un <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">informe de error</a> contra este paquete.
gu: $SOURCE કાર્યક્રમે તેનો સ્ટેક એક્ઝેક્યુટેબલ બનાવવાનું પસંદ કરેલ છે. આ સંભવિત સુરક્ષા સમસ્યા છે. આ ક્યારેય હંમેશ માટે જરૂરી હોવું જોઈએ નહિં. સ્ટેક મેમરી મોટા ભાગની OS પર આ દિવસોમાં એક્ઝેક્યુટેબલ નથી અને આ બદલાશે નહિં. એક્ઝેક્યુટેબલ સ્ટેક મેમરી એ સુરક્ષા સમસ્યાઓમાંનો મોટામાં મોટો છે. execstack ભૂલ કદાચ વાસ્તવમાં મોટે ભાગે મલીન કોડ દ્વારા પેદા કરાયેલ છે. કાર્યક્રમો અમુક સમયે અયોગ્ય રીતે કોડ થયેલ હોય છે અને આ પરવાનગીની અરજી કરે છે. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> વેબ પાનું કેવી રીતે જરૂરીયાત દૂર કરવી તે સૂચવે છે. જો $SOURCE કામ નહિં કરે અને તમારે તેને કામ કરવાની જરૂર હોય, તો તમે SELinux ને કામચલાઉ રીતે આ વપરાશની પરવાનગી આપવા માટે રૂપરેખાંકિત કરી શકો છો જ્યાં સુધી કાર્યક્રમ ચોક્કસ નહિં થઈ જાય. મહેરબાની કરીને આ આ પેકેજ વિરુદ્ધ ભૂલનો અહેવાલ જમા કરો.
ja: $SOURCE アプリケーションが自身のスタックを実行可能にしようと試みました。 セキュリティー上の問題となる可能性があります。これは完全に不要な動作です。 最近の OS ではほとんどの場合スタックメモリーは実行可能になっていません。また、 これが変更されることもありません。実行可能なスタックメモリーはセキュリティー上の 重大な問題のひとつです。実際、execstack エラーは悪意のあるコードに よって発生する可能性が最も高いのです。アプリケーションは誤って記述 されることがあり、このパーミッションを要求することがあります。 <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> のウェブページにはこの要求の削除方法が記載されています。$SOURCE が動作しなくて 動作させる必要がある場合、アプリケーションが修正されるまでの間、 SELinux を設定して一時的にこのアクセスを許可することができます。 バグレポートを提出してください。
kn: $SOURCE ಅನ್ವಯವು ಅದರ ಸ್ಟಾಕ್ ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಲು ಪ್ರಯತ್ನಿಸಿದೆ. ಇದೊಂದು ದೊಡ್ಡ ಸುರಕ್ಷತಾ ಲೋಪ. ಇದು ಎಂದಿಗೂ ಅಗತ್ಯವಿಲ್ಲ. ಇತ್ತೀಚಿನ ದಿನಗಳಲ್ಲಿ, ಹೆಚ್ಚಿನ OS ಗಳಲ್ಲಿ ಸ್ಟಾಕ್ ಮೆಮೊರಿಯು ಕಾರ್ಯಗತಗೊಳಿಸಬಲ್ಲದಾಗಿರುವುದಿಲ್ಲ ಹಾಗು ಇದು ಎಂದಿಗೂ ಬದಲಾಗುವುದಿಲ್ಲ. ಕಾರ್ಯಗತಗೊಳಿಸಬಹುದಾದ ಸ್ಟಾಕ್ ಮೆಮೊರಿಯು ಒಂದು ಮಹತ್ತರವಾದ ಸುರಕ್ಷತಾ ತೊಂದರೆಯಾಗಿದೆ. ಒಂದು execstack ದೋಷವು ಸರಿಯಲ್ಲದ ಕೋಡ್‍ನ ಕಾರಣದಿಂದಾಗಿ ಉಂಟಾಗಿರುವ ಸಾಧ್ಯತೆ ಇದೆ. ಅನ್ವಯಗಳು ಕೆಲವು ಬಾರಿ ತಪ್ಪಾಗಿ ಕೋಡ್ ಮಾಡಲ್ಪಡುವದರಿಂದ ಈ ಬಗೆಯ ಅನುಮತಿಗಾಗಿ ಮನವಿ ಮಾಡುತ್ತವೆ. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> ಜಾಲ ಪುಟವು ಈ ಅಗತ್ಯವನ್ನು ಹೇಗೆ ತೆಗೆದು ಹಾಕುವುದೆಂದು ವಿವರಿಸುತ್ತದೆ. ಎಲ್ಲಿಯಾದರೂ $SOURCE ಕೆಲಸ ಮಾಡದೆ ಇದ್ದು ಹಾಗು ನಿಮಗೆ ಅದು ಕೆಲಸ ಮಾಡುವುದುಬೇಕಿದ್ದಲ್ಲಿ, ಅನ್ವಯದ ತೊಂದರೆಯು ನಿವಾರಣೆಯಾಗುವವರೆಗೆ SELinux ಅನ್ನು ತಾತ್ಕಾಲಿಕವಾಗಿ ನೀವು ಈ ಅನುಮತಿಯನ್ನು ಒದಗಿಸುವಂತೆ ಸಂರಚಿಸಬಹುದು. ದಯವಿಟ್ಟು ಈ ಪ್ಯಾಕೇಜಿನ ವಿರುದ್ದ ಒಂದು ದೋಷ ವರದಿಯನ್ನು ಸಲ್ಲಿಸಿ.
or: $SOURCE ପ୍ରୟୋଗ ଏହାର ଷ୍ଟାକକୁ ନିଷ୍ପାଦନ ଯୋଗ୍ୟ କରିବା ପାଇଁ ଚେଷ୍ଟାକରିଥାଏ। ଏହା ଗୋଟିଏ ସୁରକ୍ଷା ସମସ୍ୟା। ଏହା କଦାପି ଆବଶ୍ୟକ ହୋଇନଥାଏ। ଷ୍ଟାକ ସ୍ମୃତି ସ୍ଥାନଟି ଅଧିକାଂଶ OSes ରେ ନିଷ୍ପାଦନ ଯୋଗ୍ୟ ନୁହଁ। ନିଷ୍ପାଦନ ଯୋଗ୍ୟ ଷ୍ଟାକ ସ୍ମୃତି ସ୍ଥାନଟି ଗୋଟିଏ ବହୁତ ବଡ଼ ସୁରକ୍ଷା ସମସ୍ୟା। ଗୋଟିଏ execstack ତ୍ରୁଟି ଘଟିପାରେ। ପ୍ରକୃତରେ କ୍ଷତିକାରକ ସଂକେତ ଦ୍ୱାରା ବଢ଼ିଥାଏ। ପ୍ରୟୋଗଗୁଡ଼ିକ ବେଳେ ବେଳେ ଭୁଲ ଭାବରେ ସାଙ୍କେତିକରଣ ହୋଇଥାଏ ଏବଂ ଏହି ଅନୁମତିକୁ ଅନୁରୋଧ କରିଥାଏ। ଏହି <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> ୱେବ ପୃଷ୍ଠା ଆବଶ୍ୟକତାକୁ କିପରି କଢ଼ାଯିବ ତାହା ବର୍ଣ୍ଣନା କରିଥାଏ। ଯଦି $SOURCE କାମ ନକରେ ଏବଂ ଆପଣ ଏହାକୁ କାର୍ଯ୍ୟକାରୀ କରିବାକୁ ଚାହାନ୍ତି, ଆପଣ SELinux କୁ ଅସ୍ଥାୟୀ ଭାବରେ ବିନ୍ୟାସ କରିପାରିବେ। ଦୟାକରି ଗୋଟିଏ ତ୍ରୁଟି ବିବରଣୀ ଦାଖଲ କରନ୍ତୁ।
te: ఆ $SOURCE అనువర్తనం దాని స్టాక్‌ను ఎక్సిక్యూటబుల్ గా చేయుటకు యత్నము చేసింది. ఇది ఒక సామర్ధ్యపు రక్షణ సమస్య. ఇది ఎప్పడూ ఎప్పటికి అవసరంకాదు. స్టాక్ మెమోరి అనునది చాలా OSలలో ఈరోజులలో నిర్వర్తించ దగినది కాదు మరియు ఇది మార్చబడదు. నిర్వర్తించదగిన స్టాక్ మెమోరి అనునది ఒక పెద్ద భద్రతా సమస్య. ఒక execstack దోషము అనునది నిజానికి చాలా సాదారణంగా తప్పైన కోడ్ ద్వారా లేవనెత్తబడివుండవచ్చు. అనువర్తనములు కొన్ని సార్లు తప్పుగా కోడ్ చేయబడివుంటాయి మరియు ఈ అనుమతిని అభ్యర్దిస్తాయి. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> వెబ్ పుట ఈ అవసరాన్ని ఎలా తీసివేయాలో తెలుపుతుంది. ఒకవేళ $SOURCE పనిచేయకపోతే మీరు పనిచేయించవలసి వస్తే, మీరు SELinux ను ఆకృతీకరించవచ్చు తాత్కాలికంగా ఈ వాడుక అనుమతిని అనువర్తనం సిద్దముకాబడునంతవరకు అనుమతించునట్లు. దయచేసి బగ్ నివేదికను నమోదు చేయండి.
uk: Програма $SOURCE спробувала зробити свій стек виконуваним. Це потенційна загроза безпеки. Така операція не має використовуватись. Стекова пам'ять не є виконуваною у більшості ОС на сьогоднішній день, і це не зміниться у майбутньому. Виконуваний стек - це одна з найсерйозніших проблем безпеки. Подібні помилки можуть бути викликані програмою зловмисника. Іноді некоректно написані програми вимагають таку можливість. У документі <a href="http://people.redhat.com/drepper/selinux-mem.html">Тести захисту пам'яті SELinux</a> пояснюється як виключити вживання такої можливості. Якщо $SOURCE не працює, а вам неодмінно треба ця програма, можна налаштувати SELinux для тимчасового дозволу цієї можливості, доки програма не буде виправлена. Будь ласка надішліть у цьому пакеті.
zh_tw: $SOURCE 應用程式嘗試使它的堆疊 變得可執行。這是個潛在的安全性問題。這應該從未是 必要的。堆疊記憶體在大多數現今的作業系統上是無法執行的， 並且這是不會改變的。可執行的堆疊記憶體 屬於最大的安全性問題之一。實際上，execstack 錯誤最可能 是因為有害的程式碼所造成的。應用程式 有時會被錯誤編寫因而請求此許可。 <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux 記憶體保護測試</a> 網頁解釋如何移除此需求。若 $SOURCE 無法運作 而您需要它運作的話，您可透過暫時性地 設定 SELinux，以允許此存取，直到應用程式被修復。請提交一份 錯誤報告。

source: Sometimes a library is accidentally marked with the execstack flag, if you find a library with this flag you can clear it with the execstack -c LIBRARY_PATH. Then retry your application. If the app continues to not work, you can turn the flag back on with execstack -s LIBRARY_PATH. Otherwise, if you trust $SOURCE to run correctly, you can change the context of the executable to execmem_exec_t. "chcon -t execmem_exec_t '$SOURCE_PATH'" You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'"
as: কেতিয়াবা এটা লাইব্ৰেৰীক ভূলকৈ execstack ফ্লেগৰ সৈতে চিহ্নিত কৰা হয়, যদি আপুনি এই ফ্লেগৰ সৈতে এটা লাইব্ৰেৰী পায় আপুনি ইয়াক execstack -c LIBRARY_PATH ৰ সৈতে পৰিষ্কাৰ কৰিব পাৰিব। তাৰ পিছত আপোনাৰ অনুপ্ৰয়োগ পুনৰ চেষ্টা কৰক। যদি অনুপ্ৰয়োগ তথাপি কাৰ্য্যত নহয়, আপুনি ফ্লেগক execstack -s LIBRARY_PATH ৰ সৈতে অন কৰিব পাৰিব। নহলে, যদি আপুনি $SOURCE ক সঠিকভাৱে চলিব বুলি ভৰষা কৰে, আপুনি এক্সিকিউটেবুলৰ পৰিপ্ৰেক্ষতিতক execmem_exec_t. "chcon -t execmem_exec_t '$SOURCE_PATH'" লে সলনি কৰিব পাৰিব আপুনি লগতে চিস্টেমৰ অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহক সলনি কৰিব লাগিব যাতে সিহতক এটা সম্পূৰ্ণ পুনৰলেবেলত সংৰক্ষৰণ কৰিব পাৰি। "semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'"
es: A veces una biblioteca es marcada accidentalmente con la bandera execstack; si encuentra una biblioteca con esta bandera, la puede limpiar con execstack -c LIBRARY_PATH. Entonces reintente con su aplicación. Si aún así no fucniona, puede volverla a activar con execstac -s LIBRARY_PATH. Sino, si Ud. confía en que $SOURCE se ejecutará correctamente, puede cambiar el contexto del ejecutable a execmem_exec_t. "chcon -t execmem_exec_t '$SOURCE_PATH'" También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, a los efectos de preservarlos en caso de un reetiquetado completo. "semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'"
gu: અમુક વાર લાઈબ્રેરી આકસ્મિક રીતે execstack ફ્લેગ સાથે ચિહ્નિત થાય છે, જો તમને આ ફ્લેગ સાથે લાઈબ્રેરી મળે તો તમે તેને execstack -c LIBRARY_PATH સાથે સાફ કરી શકો છો. પછી તમારા કાર્યક્રમનો પુનઃપ્રયાસ કરો. જો કાર્યક્રમ નહિં કામ કરવાનું ચાલુ રાખે, તો તમે ફ્લેગને ફરીથી execstack -s LIBRARY_PATH વડે ચાલુ કરી શકો છો. નહિંતર, જો તમે $SOURCE નો યોગ્ય રીતે ચલાવવામાં વિશ્વાસ કરો, તો તમે એક્ઝેક્યુટેબલનો સંદર્ભ execmem_exec_t. "chcon -t execmem_exec_t '$SOURCE_PATH'" માં બદલી શકો છો તમારે સિસ્ટમ પર મૂળભૂત ફાઈલ સંદર્ભ ફાઈલો પણ તેમને સંપૂર્ણ પુનઃલેબલ પર જાળવી રાખવા માટે બદલવી જ પડશે. "semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'"
ja: 誤って execstack フラグがライブラリーに付けられてしまうことがあります。 このフラグの付いたライブラリーを見つけた場合、 execstack -c LIBRARY_PATH で消去することができます。 その後にアプリケーションを再試行してくだ さい。これを行ってもアプリケーションが動作しない場合は、 execstack -s LIBRARY_PATH でフラグをオンに戻すことができます。 $SOURCE が 正常に実行していると信用できる場合、その実行可能ファイルのコンテキストを execmem_exec_t に変更できます。"chcon -t execmem_exec_t '$SOURCE_PATH'" また、システム上のデフォルトファイルコンテキストのファイルが完全な再ラベルでも保持できるようにそれらを変更しなければなりません。"semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'"
kn: ಕೆಲವೊಮ್ಮೆ ಒಂದು ಲೈಬ್ರರಿಯು ಅಚಾತುರ್ಯವಾಗಿ execstack ಫ್ಲಾಗ್‍ನಿಂದ ಗುರುತು ಹಾಕಲ್ಪಟ್ಟಿರುತ್ತದೆ, ಹಾಗು ನಿಮಗೆ ಇದು ಎಲ್ಲಿಯಾದರು ಕಂಡು ಬಂದಲ್ಲಿ ನೀವು execstack -c LIBRARY_PATH ಅನ್ನು ಬಳಸಿಕೊಂಡು ಇದನ್ನು ತೆರವುಗೊಳಿಸಿ, ನಂತರ ಅನ್ವಯವನ್ನು ಪುನಃ ಚಲಾಯಿಸಿ ನೋಡಬಹುದು. ಆದರೂ ಅನ್ವಯವು ಕೆಲಸ ಮಾಡದೆ ಹೋದಲ್ಲಿ, execstack -s LIBRARY_PATH ಅನ್ನು ಬಳಸಿಕೊಂಡು ನೀವು ಫ್ಲಾಗ್ ಅನ್ನು ಮರಳಿ ಹಿಂದಿನ ಸ್ಥಿತಿಗೆ ತರಬಹುದಾಗಿದೆ. ಇಲ್ಲದೆ ಹೋದಲ್ಲಿ, $SOURCE ಅನ್ನು ಸರಿಯಾಗಿ ಚಾಲನೆ ಮಾಡಬೇಕೆಂದು ನೀವು ಬಯಸಿದಲ್ಲಿ ಕಾರ್ಯಗತಗೊಳಿಸಬಲ್ಲದರ ಸನ್ನಿವೇಶವನ್ನು execmem_exec_t. "chcon -t execmem_exec_t '$SOURCE_PATH'" ಗೆ ಬದಲಾಯಿಸಬಹುದು ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'"
or: କିଛି ସମୟରେ ଲାଇବ୍ରେରୀଟି ହଠାତ ଉପରେ execstack ସୂଚକ ସହିତ ଚିହ୍ନଟ ହୋଇଥାଏ, ଯଦି ଆପଣ ସୂଚକ ସହିତ ଗୋଟିଏ ଲାଇବ୍ରେରୀକୁ ଖୋଜି ପାରିବେ, ତେବେ ଆପଣ ତାହାକୁ execstack -c LIBRARY_PATH ଦ୍ୱାରା ସଫାକରିପାରିବେ। ତାପରେ ଆପଣଙ୍କର ପ୍ରୟୋଗକୁ ପୁନଃ ପ୍ରୟାସ କରନ୍ତୁ। ଯଦି app କାମ ନକରେ, ତେବେ ଆପଣ ସୂଚକକୁ execstack -s LIBRARY_PATH ସହିତ ପଛକୁ ଆଣି ପରିବେ। ଅନ୍ୟଥା, ଯଦି ଆପଣ $SOURCE କୁ ସଠିକ ଭାବରେ ଚାଲୁଅଛି ବୋଲି ବିଶ୍ୱାସ ନକରନ୍ତି, ତେବେ ଆପଣ ନିଷ୍ପାଦ୍ୟର ପ୍ରସଙ୍ଗକୁ unconfined_execmem_exec_tକୁ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "chcon -t execmem_exec_t '$SOURCE_PATH'" ଆପଣ ମଧ୍ଯ ସେହି ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ଫାଇଲଗୁଡ଼ିକୁ ତନ୍ତ୍ରରେ ସମ୍ପୂର୍ଣ୍ଣ ପୁନଃ ନାମକରଣ ପାଇଁ ସଂରକ୍ଷଣ ନକରନ୍ତି। "semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'"
te: కొన్ని సమయాలలో లైబ్రరీ అనుకోకుండా execstack ఫ్లాగ్ తో గుర్తుంచబడుతుంది, మీరు ఒక లైబ్రరీని ఈ ఫ్లాగ్‌తో కనుగొంటే మీరు దానిని execstack -c LIBRARY_PATH అనుదానితో తీసివేయవచ్చు. అప్పుడు మీ అనువర్తనంను తిరిగిప్రయత్నించండి. ఒకవేళ app అనునది పనిచేయకుండా వుంటుంటే, మీరు ఫ్లాగ్‌ను తిరిగిఆన్ చేయవచ్చు execstack -s LIBRARY_PATH ఉపయోగించి. లేకపోతే, మీరు $SOURCE ను సరిగా నడుపునది అని నమ్మినట్లైతే, మీరు నిర్వర్తించదగిన దాని సందర్భమును unconfined_execmem_exec_t కు మార్చవచ్చు. "chcon -t unconfined_execmem_exec_t '$SOURCE_PATH'" మీరు అప్రమేయ దస్త్ర సందర్భ దస్త్రములను సిస్టమ్ నందలివాటిని పూర్తిచేరికతో వుంచుటకు క్రమానుగతంగా మార్చవలసి వుంటుంది. "semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'"
uk: Іноді бібліотека випадково позначається ознакою execstack, якщо ви знайдете подібну бібліотеку, ви зможете змінити це командою execstack -c LIBRARY_PATH. Потім спробуйте запустити програму знову. Якщо вона не запрацює, увімкніть ознаку назад за допомогою execstack -s LIBRARY_PATH. Якщо ж, ви вважаєте, що $SOURCE працює стабільно, можете змінити його контекст на execmem_exec_t. «chcon -t execmem_exec_t '$SOURCE_PATH'» Також треба змінити типові файли контексту, щоб запобігти їх зміні при повторній розмітці. «semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'»
zh_tw: 有時函式庫會不小心地被以 execstack 旗標標記， 若您發現一個含有此旗標的函式庫，您可透過 execstack -c LIBRARY_PATH 來將它清除，然後再次嘗試您的應用程式。若該 應用程式持續無法運作的話，您可透過使用 execstack -s LIBRARY_PATH 來將旗標重新啟用。否則，若您信任 $SOURCE 可 正確運作的話，您可將該可執行檔的 context 更改為 execmem_exec_t。「chcon -t execmem_exec_t '$SOURCE_PATH'」 您還必須更改系統上預設的檔案情境檔才可將它們保留（就算是進行完整重新標記後）。「semanage fcontext -a -t execmem_exec_t '$FIX_SOURCE_PATH'」
