Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: If you want to allow $SOURCE to connect to $PORT_NUMBER, you can execute # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER where PORT_TYPE is one of the following: %s.
as: যদি আপুনি $SOURCE ক $PORT_NUMBER লে সংযোগ কৰাব বিচাৰে, আপুনি প্ৰেৰণ কৰিব পাৰে # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER যত PORT_TYPE নিম্নলিখিতৰ এটা: %s.
es: Si quiere permitir a $SOURCE conectarse al puerto $PORT_NUMBER, puede ejecutar # semanage port -a -t TIPO_DE_PUERTO -p %s $PORT_NUMBER</b> donde TIPO_DE_PUERTO es uno de los siguientes: %s.
gu: જો તમે $PORT_NUMBER સાથે જોડાવા માટે $SOURCE ને પરવાનગી આપવા માંગો તો, તમે ચલાવી શકો છો # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER જ્યાં PORT_TYPE એ નીચેનાં માંનુ એક છે: %s.
ja: $SOURCE による $PORT_NUMBER への接続を許可する場合は、 以下を実行します。 # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ここで、PORT_TYPE は 以下の１つとなります: %s 。
kn: $SOURCE ಅನ್ನು ಈ ಸಂಪರ್ಕಸ್ಥಾನಕ್ಕೆ ಸಂಪರ್ಕಿತಗೊಳ್ಳಲು ನೀವು ಬಯಸಿದಲ್ಲಿ # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ಅನ್ನು ಚಲಾಯಿಸಿ, <br>ಇಲ್ಲಿ PORT_TYPE ಎನ್ನುವುದ ಈ ಕೆಳಗಿನವುಗಳಲ್ಲಿ ಒಂದಾಗಿರುತ್ತದೆ: %s.
or: ଯଦି ଆପଣ $SOURCE କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି ତେବେ $PORT_NUMBER ସହିତ ସଂଯୁକ୍ତ କରନ୍ତୁ,ଆପଣ ନିମ୍ନଲିଖିତକୁ ନିଷ୍ପାଦନ କରିପାରିବେ # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ଯେଉଁଠି PORT_TYPE ଟି ନିମ୍ନଲିଖିତ ମଧ୍ଯରୁ ଗୋଟିଏ: %s.
uk: Щоб дозволити підключення $SOURCE до порту $PORT_NUMBER, виконайте команду # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER де PORT_TYPE може приймати значення: %s.
zh_tw: 若您希望允許 $SOURCE 連至 $PORT_NUMBER，您可執行 # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ，PORT_TYPE 則為下列其中之一：%s。

source: SELinux is preventing cvs ($SOURCE_PATH) "$ACCESS" access to $TARGET_PATH
as: SELinux এ $TARGET_PATH লে cvs ($SOURCE_PATH) "$ACCESS" অভিগম প্ৰতিৰোধ কৰি আছে
es: SELinux está negando cvs ($SOURCE_PATH) "$ACCESS" el acceso a $TARGET_PATH.
gu: SELinux એ cvs $SOURCE_PATH "$ACCESS" વપરાશને TARGET_PATH થી અટકાવી રહ્યું છે.
ja: SELinux は cvs ($SOURCE_PATH) による $TARGET_PATH への "$ACCESS" アクセスを阻止しています
kn: ಸಾಧನ $TARGET_PATH ಕ್ಕೆ ($SOURCE_PATH) "$ACCESS" ನ ನಿಲುಕಣೆಯನ್ನು SELinux ತಡೆದಿದೆ.
or: SELinux cvs ($SOURCE_PATH) କୁ $TARGET_PATH ଉପକରଣରେ "$ACCESS" କରିବାରୁ ଅଟକାଉଛି
te: SELinux అనునది cvs ($SOURCE_PATH) "$ACCESS" యాక్సెస్‌ను $TARGET_PATHకు నిరోధిస్తోంది.
uk: SELinux запобігає cvs ($SOURCE_PATH) доступ «$ACCESS» до $TARGET_PATH.
zh_tw: SELinux 防止 cvs（$SOURCE_PATH）「$ACCESS」存取 $TARGET_PATH。

source: SELinux denied cvs access to $TARGET_PATH. If this is a CVS repository it needs to have a file context label of cvs_data_t. If you did not intend to use $TARGET_PATH as a CVS repository it could indicate either a bug or it could signal an intrusion attempt.
as: SELinux এ $TARGET_PATH লে cvs অভিগম নাকচ কৰিলে। যদি ই এটা CVS ভঁৰাল হয় ইয়াৰ এটা নথিপত্ৰ পৰিপ্ৰেক্ষতিত লেবেল cvs_data_t থাকিব লাগিব। যদি আপুনি $TARGET_PATH ক এটা CVS ভঁৰাল হিচাপে ব্যৱহাৰ কৰিব নিবিচাৰে ই এটা বাগ হব পাৰে অথবা ই এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত হব পাৰে।
es: SELinux negó a cvs el acceso a $TARGET_PATH. Si éste es un repositorio CVS, tiene que tener la etiqueta de contexto de archivo cvs_data_t. Si su intención no es usar $TARGET_PATH como un repositorio cvs, ésto puede ser indicio de un ataque o bien un error.
gu: SELinux એ $TARGET_PATH નો cvs વપરાશ નામંજૂર કર્યો. જો આ CVS રીપોઝીટરી હોય તો તેને cvs_data_t લેબલવાળો ફાઈલ સંદર્ભ હોવો જોઈએ. જો તમે $TARGET_PATH ને cvs રીપોઝીટરી તરીકે વાપરવાનો હેતુ રાખ્યો નહિં હોય તો તે ક્યાં તો ભૂલ સૂચવી શક્યો હોત અથવા તે ઘૂંસણખોરી પ્રવેશ સંકેત સૂચવી શક્યો હોત.
ja: SELinux は $TARGET_PATH への cvs アクセスを拒否しました。 これが CVS リポジトリーの場合は、 cvs_data_t のファイルコンテキストラベルを 持っていなければなりません。CVS リポジトリーとして $TARGET_PATH を 使用するつもりではなかった場合、これはバグであるか不正侵入の試行を示している可能性があります。
kn: $TARGET_PATH ಗೆ SELinux cvs ಅನುಮತಿಯನ್ನು ನಿರಾಕರಿಸಿದೆ. ಎಲ್ಲಿಯಾದರೂ ಇದು ಒಂದು CVS ರೆಪೊಸಿಟರಿಯಾಗಿರ ಬೇಕಿದ್ದಲ್ಲಿ ಇದರ ಕಡತ ಸನ್ನಿವೇಶದ ಲೇಬಲ್ cvs_data_t ಆಗಿರಬೇಕು. ನೀವು $TARGET_PATH ಅನ್ನು ಒಂದು CVS ರೆಪೊಸಿಟರಿಯಾಗಿ ಬಳಸುವ ಬಯಸದೆ ಹೋಗಿದ್ದಲ್ಲಿ, ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲಾಗುತ್ತದೆ.
or: SELinux $TARGET_PATH ରେ cvs ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଥାଏ। ଯଦି ଏହା ଗୋଟିଏ CVS ସଂଗ୍ରହାଳୟ ତେବେ ଏଥିରେ cvs_data_t ନାମକ ଗୋଟିଏ ଫାଇଲ ପ୍ରସଙ୍ଗ ନାମପଟି ଥିବା ଉଚିତ। ଯଦି ଆପଣ $TARGET_PATH କୁ ଗୋଟିଏ CVS ସଂଗ୍ରହାଳୟଭାବରେ ବ୍ୟବହାର କରିବା ପାଇଁ ଇଚ୍ଛାକରିନଥାନ୍ତି ତେବେ ଏହା ହୁଏତଃ ଗୋଟିଏ ତ୍ରୁଟିକୁ ସୂଚାଇଥାଏ ଅଥବା ବିନାଅନୁମତିରେ ପ୍ରବେଶ ପ୍ରଚେଷ୍ଟାକୁ ସୂଚାଇଥାଏ।
te: SELinux అనునది cvs వాడుకను $TARGET_PATH కు తిరస్కరిస్తుంది. ఒకవేల ఇది cvs రిపోజిటరీ అయితే అది దస్త్రము సందర్భం లేబుల్ cvs_data_t యొక్కది కలిగివుండాలి. మీరు $TARGET_PATH ను cvs రిపోజిటరీలాగా ఉపయోగించాలని అనుకోకపోతే ఇది ఒక బగ్‌నుగాని లేదా ఇది అమర్యాద యత్నమును సూచిస్తుంది.
uk: SELinux заборонила доступ cvs до $TARGET_PATH. Якщо це репозиторій CVS, він повинен мати контекст cvs_data_t. Якщо ви не використовуєте $TARGET_PATH як репозиторій cvs, можливо це помилка або спроба вторгнення.
zh_tw: SELinux 拒絕透過 cvs 存取 $TARGET_PATH。 若這是個 CVS 軟體庫，它必須要有個檔案情境標籤 cvs_data_t。若您並未嘗試使用 $TARGET_PATH 為 cvs 儲存庫的話， 這顯示可能是項錯誤，或是它可能也代表系統已遭到嘗試入侵的警訊。

source: You can alter the file context by executing chcon -R -t cvs_data_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
as: আপুনি নথিপত্ৰ পৰিপ্ৰেক্ষতিতক chcon -R -t cvs_data_t '$TARGET_PATH' এক্সিকিউট কৰি সলনি কৰিব পাৰিব আপুনি লগতে চিস্টেমত অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহক সলনি কৰিব লাগিব যাতে সিহতক এটা সম্পূৰ্ণ পুনৰলেবেলতো সংৰক্ষণ কৰিব পাৰি। "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
es: Puede alterar el contexto de archivo ejecutando chcon -R -t cvs_data_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
gu: તમે chcon -R -t cvs_data_t '$TARGET_PATH' ચલાવવાથી ફાઇલ સંદર્ભને બદલી શકો છો તમે સંપૂર્ણ પુન:લેબલ પર પણ તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર મૂળભૂત ફાઇલ સંદર્ભ ફાઇલોને પણ બદલવી જ જોઇએ. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
ja: chcon -R -t cvs_data_t '$TARGET_PATH' を実行すると、ファイルコンテキストを変更することが出来ます。 また、完全な再ラベルの後でもそれらを維持できるようにするには、システム上のデフォルトのファイルコンテキストファイルの変更もしなければなりません。"semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
kn: chcon -R -t cvs_data_t '$TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ ಕಡತದ ಸನ್ನಿವೇಶವನ್ನು ಬದಲಾಯಿಸಬಹುದು ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
or: chcon -R -t cvs_data_t '$TARGET_PATH' କୁ ନିଷ୍ପାଦନ କରି ଆପଣ ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ବଦଳାଇପାରିବେ ଆପଣ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ଫାଇଲକୁ ସମ୍ପୂର୍ଣ୍ଣ ପୁନଃ ନାମକରଣରେ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ତନ୍ତ୍ରରେ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
te: మీరు దస్త్రము సందర్భంను chcon -R -t cvs_data_t '$TARGET_PATH' నిర్వర్తించుట ద్వారా మార్చవచ్చు మీరు అప్రమేయ దస్త్ర సందర్భ దస్త్రాలను సిస్టమ్ పైన వాటిని పూర్తి నమ్మదగినవిగా వుంచుటకు మార్చవలసివుంటుంది. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
uk: Можна змінити контекст, виконавши команду: «chcon -R -t cvs_data_t '$TARGET_PATH'» Також треба змінити типові контексти файлів у системі, щоб вони збереглись навіть при повторній розмітці. «semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'»
zh_tw: 您可透過執行 chcon -R -t cvs_data_t '$TARGET_PATH' 來更改檔案情境。 您也必須更改系統上的預設檔案情境檔，才可在進行完整重新標記的情況下將它們保留住。「semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'」

source: $TARGET_BASE_PATH should be shared via the cvs daemon
as: $TARGET_BASE_PATH ক cvs ডিমৰে অংশীদাৰী কৰিব লাগিব
es: $TARGET_BASE_PATH debería compartirse mediante el demonio cvs
gu: $TARGET_BASE_PATH એ cvs ડિમન મારફતે વહેંચવુ જોઇએ
ja: $TARGET_BASE_PATH は cvs デーモンを経由して共有されているべきです。
kn: $TARGET_BASE_PATH ಅನ್ನು cvs ಡೀಮನ್ ಮೂಲಕ ಹಂಚಬೇಕಾಗುತ್ತದೆ
or: $TARGET_BASE_PATH କୁ cvs ଡେମନ ମାଧ୍ଯମରେ ସହଭାଗ କରିବା ଉଚିତ
te: $TARGET_BASE_PATH అనునది cvs డెమోన్ ద్వారా భాగస్వామ్యపరచబడాలి
uk: $TARGET_BASE_PATH має бути оприлюднено за допомогою фонової служби cvs
zh_tw: $TARGET_BASE_PATH 應該透過 cvs 幕後程式分享

source: You need to change the label on $TARGET_BASE_PATH'
as: আপুনি লেবেলক $TARGET_BASE_PATH' ত সলনি কৰিব লাগিব
es: Necesita modificar la etiqueta en $TARGET_BASE_PATH'
gu: તમારે $TARGET_BASE_PATH' પર લેબલને બદલવાની જરૂર છે
ja: $TARGET_BASE_PATH' のラベルを変更する必要があります。
kn: $TARGET_BASE_PATH' ನಲ್ಲಿ ನೀವು ಲೇಬಲ್ ಅನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ
or: ଆପଣଙ୍କୁ $TARGET_BASE_PATH' ଉପରେ ନାମପଟିକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ହେବ
te: $TARGET_BASE_PATH' పైని లేబుల్‌ను మార్చాలి
uk: Вам слід змінити мітку на $TARGET_BASE_PATH'
zh_tw: 您需要更改 $TARGET_BASE_PATH' 上的標籤

source: SELinux is preventing $SOURCE_PATH the "$ACCESS" capability.
as: SELinux এ $SOURCE_PATH ক "$ACCESS" ক্ষমতাৰ পৰা প্ৰতিৰোধ কৰি আছে।
es: SELinux está previniendo a $SOURCE_PATH la capacidad de "$ACCESS" .
gu: SELinux એ $SOURCE_PATH ની "$ACCESS" ક્ષમતાને અટકાવી રહ્યું છે.
ja: SELinux は $SOURCE_PATH の "$ACCESS" 能力を阻止しています。
kn: "$ACCESS" ಸವಲತ್ತು ಅನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ $SOURCE_PATH ಅನ್ನು SELinux ತಡೆದಿದೆ
uk: SELinux забороняє $SOURCE_PATH використовувати можливість «$ACCESS».
zh_tw: SELinux 防止 $SOURCE_PATH 「$ACCESS」的能力。

source: dac_override and dac_read_search capabilities usually indicates that the root process does not have access to a file based on the permission flags. This usually mean you have some file with the wrong ownership/permissions on it.
as: dac_override আৰু dac_read_search ক্ষমতাসমূহে সাধাৰণত ইংগিত দিয়ে যে ৰুট প্ৰক্ৰিয়াৰ অনুমতি ফ্লেগসমূহৰ উপৰত নিৰ্ভৰ কৰি এটা নথিপত্ৰলে অভিগম নাই। ই সাধাৰণত বুজায় আপোনাৰ ভূল অধিকাৰত্ব/অনুমতি থকা কিছুমান নথিপত্ৰ আছে।
es: las capacidadeds dac_override y dac_read_search por lo general indican que los procesos root no tienen aceso a un archivo basado en las marcas de permisos. Generalmente esto significa que posee algún archivo cuyo permiso o pertenencia es equivocado.
gu: dac_override and dac_read_search ક્ષમતાઓ સામાન્ય રીતે સૂચવે છે કે રુટ પ્રક્રિયા પાસે પરવાનગી ફ્લેગ પર આધારિત ફાઇલને પ્રવેશ નથી. આ સામાન્ય રીતે મતલબ એ થાય કે તમારી પાસે તેની પર ખોટી માલિકી/પરવાનગીઓ સાથે અમુક ફાઇલ છે.
ja: dac_override と dac_read_search の機能は通常、root プロセスがパーミッションフラグを 基にしたファイルへのアクセスを持たないことを表示します。これは通常、ユーザーがそのファイルに 間違えた所有権/パーミッションを持っていることを意味します。
kn: dac_override ಹಾಗು dac_read_search ಸಾಮರ್ಥ್ಯಗಳು ಅನುಮತಿ ಫ್ಲ್ಯಾಗ್‌ಗಳ ಆಧರಿತವಾದ ಕಡತವನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳುವ ಅನುಮತಿಗಳನ್ನು ಹೊಂದಿರುವುದಿಲ್ಲ ಎನ್ನುವುದನ್ನು ಸೂಚಿಸುತ್ತದೆ. ಸಾಮಾನ್ಯವಾಗಿ ಇದರ ಅರ್ಥ ನೀವು ತಪ್ಪು ಮಾಲಿಕತ್ವ/ಅನುಮತಿಗಳನ್ನು ಹೊಂದಿರುವ ಕೆಲವು ಕಡತಗಳು ನಿಮ್ಮಲ್ಲಿ ಇವೆ ಎನ್ನುವುದಾಗಿರುತ್ತದೆ.
uk: повідомлення щодо можливостей dac_override і dac_read_search зазвичай означають, що процес користувача root не має доступу до файла через параметри прав доступу. Отже, ймовірно, у вас є якийсь файл з помилковими параметрами належності або прав доступу.
zh_tw: dac_override 與 dac_read_search 能力通常表示根程序基於許可權旗標設定而沒有檔案的存取權。這通常代表您有些擁有者/許可權設定有誤的檔案。

source: you want to help identify if domain needs this access or you have a file with the wrong permissions on your system
as: আপুনি ডমেইনৰ এই অভিগমৰ প্ৰয়োজন আছে নে অথবা আপোনাৰ চিস্টেমত ভুল অনুমতি থকা এটা নথিপত্ৰ আছে নে সেয়া চিনাক্ত কৰাত সহায় কৰিব বিচাৰে
es: desea ayudar a identificar si el dominio necesita este acceso, o posee un archivo con permisos equivocados en el sistema
gu: ઓળખવા માટે તમારે મદદ માંગો છો જો ડોમેઇનને આ પ્રવેશની જરૂર હોય તો અથવા તમારી પાસે તમારી સિસ્ટમપર ખોટી પરવાનગીઓ હોય
ja: ドメインがこのアクセスを必要とするか、又は使用システム上に間違えたパーミッションで ファイルを所有しているかを確認すると良いでしょう
kn: ಡೊಮೈನಿಗೆ ಆ ಅನುಮತಿಯ ಅಗತ್ಯವಿದೆಯೆ ಅಥವ ನಿಮ್ಮ ವ್ಯವಸ್ಥೆಯಲ್ಲಿನ ಕಡತವೊಂದು ತಪ್ಪು ಅನುಮತಿಗಳನ್ನು ಹೊಂದಿದೆಯೆ ಎನ್ನುವುದನ್ನು ಪತ್ತೆ ಮಾಡಲು ಬಯಸುತ್ತೀರಿ
uk: ви хочете допомогти у визначенні того, чи потрібні домену ці права доступу, або у вашій системі є файл з помилковими правами доступу
zh_tw: 您希望協助辨識區域是否需要此存取權限，或是您的系統上是否有錯誤權限的檔案

source: turn on full auditing to get path information about the offending file and generate the error again.
as: নিয়ম নমনা নথিপত্ৰৰ পথ তথ্য প্ৰাপ্ত কৰিবলে আৰু ত্ৰুটিক আকৌ সৃজন কৰিবলে সম্পূৰ্ণ সম্পাদন আৰম্ভ কৰক।
es: activa auditoría completa para obtener información de la ruta relacionada con el archivo conflictivo, y generar el error nuevamente.
gu: ઑફેન્ડીંગ ફાઇલ વિશે પાથ જાણકારી મેળવવા માટે સંપૂર્ણ ઓડિટીંગ ને ચાલુ કરો અને ફરીથી ભૂલને ઉત્પન્ન કરો.
ja: 全面的な監査を開始して違反しているファイルに関するパス情報を取得し、 再度エラーを生成します。
kn: ತಪ್ಪೆಸಗುತ್ತಿರುವ ಕಡತವು ಇರುವ ಸ್ಥಳದ ಬಗೆಗೆ ಮಾಹಿತಿಯನ್ನು ಪಡೆಯಲು ಹಾಗು ದೋಷವನ್ನು ಇನ್ನೊಮ್ಮೆ ಉತ್ಪಾದಿಸಲು ಸಂಪೂರ್ಣ ಆಡಿಟಿಂಗ್ ಅನ್ನು ಆನ್ ಮಾಡಿ.
uk: увімкніть повну перевірку, щоб отримати дані щодо розташування файла з помилкою і повторно створіть повідомлення про помилку.
zh_tw: 開啟完整稽核以取得有關於違例檔案的相關資訊，並再次產生錯誤。

source: Turn on full auditing # auditctl -w /etc/shadow -p w Try to recreate AVC. Then execute # ausearch -m avc -ts recent If you see PATH record check ownership/permissions on file, and fix it, otherwise report as a bugzilla.
as: সম্পূৰ্ণ সম্পাদন আৰম্ভ কৰক # auditctl -w /etc/shadow -p w AVC পুনৰ সৃষ্টি কৰাৰ চেষ্টা কৰক। তাৰ পিছত এক্সিকিউট কৰক # ausearch -m avc -ts recent যদি আপুনি PATH ৰেকৰ্ড দেখা পায় নথিপত্ৰত অধিকাৰ/অনুমতি নীৰিক্ষণ কৰক, ইয়াক ঠিক কৰক, আৰু নহলে bugzilla হিচাপে সংবাদিত কৰক।
es: Active auditoría completa # auditctl -w /etc/shadow -p w Intente recrear el AVC. Luego ejecute # ausearch -m avc -ts recent Si observa un registro PATH verifique permisos y pertenencia del archivo, y solucionelo, de lo contrario, repórtelo en bugzilla.
gu: સંપૂર્ણ ઑડિટીંગને ચાલુ કરો # auditctl -w /etc/shadow -p w AVC ને પુન:બનાવવાનો પ્રયત્ન કરો. પછી ચલાવો # ausearch -m avc -ts recent જો તમે ફાઇલ પર PATH રેકોર્ડની માલિકી/પરવાનગીઓને ચકાસવાનું જુઓ, તેને સુધારો, નહિંતો બગઝીલા તરીકે અહેવાલ કરો.
ja: 全面的な監査を開始します # auditctl -w /etc/shadow -p w AVC の再作成を試みます。そして以下を実行します。 # ausearch -m avc -ts recent PATH 記録が見える場合は、ファイルの所有権/パーミッションをチェックして修正し、 見えない場合はバグとして報告します。
kn: ಸಂಪೂರ್ಣ ಆಡಿಟಿಂಗ್ ಅನ್ನು ಆನ್ ಮಾಡಿ # auditctl -w /etc/shadow -p w AVC ಅನ್ನು ಮರಳಿ ರಚಿಸಲು ಪ್ರಯತ್ನಿಸಿ. ನಂತರ ಇದನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಿ # ausearch -m avc -ts recent ಕಡತದಲ್ಲಿ PATH ದಾಖಲೆ ಚೆಕ್ ಮಾಲಿಕತ್ವ/ಅನುಮತಿಗಳು ನಿಮಗೆ ಕಂಡುಬಂದಲ್ಲಿ ಅದನ್ನು ಸರಿಪಡಿಸಿ, ಅಥವ ಬಗ್‌ಝಿಲ್ಲಾದಲ್ಲಿ ವರದಿ ಮಾಡಿ.
uk: Увімкніть повну перевірку # auditctl -w /etc/shadow -p w Спробуйте повторно створити AVC, потім віддайте команду # ausearch -m avc -ts recent Якщо вам буде показано запис PATH, перевірте параметри належності і прав доступу до файла і виправте їх значення. Якщо помилок у цих параметрах не буде виявлено, повідомте до системи сповіщення про вади.
zh_tw: 開啟完整稽核 # auditctl -w /etc/shadow -p w 嘗試重新建立 AVC。然後執行 # ausearch -m avc -ts recent 若您看見 PATH record，請檢查檔案上的擁有權/權限，並將它修正， 否則請將它提交至 bugzilla。

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access to device $TARGET_PATH.
as: SELinux এ যন্ত্ৰ $TARGET_PATH লে $SOURCE_PATH "$ACCESS" অভিগম প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a $SOURCE_PATH "$ACCESS" acceso al dispositivo a $TARGET_PATH.
gu: SELinux એ $SOURCE_PATH "$ACCESS" વપરાશને ઉપકરણ $TARGET_PATH થી અટકાવી રહ્યું છે.
ja: SELinux は デバイス $TARGET_PATH への $SOURCE_PATH による "$ACCESS" アクセスを阻止しています。
kn: ಸಾಧನ $TARGET_PATH ಕ್ಕೆ $SOURCE_PATH "$ACCESS" ನ ನಿಲುಕಣೆಯನ್ನು SELinux ತಡೆದಿದೆ.
or: SELinux $SOURCE_PATH କୁ $TARGET_PATH ଉପକରଣରେ "$ACCESS" କରିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH "$ACCESS" యాక్సెస్‌ను పరికరం $TARGET_PATHకు నిరోధిస్తుంది.
uk: SELinux забороняє $SOURCE_PATH доступ «$ACCESS» до при строю $TARGET_PATH.
zh_tw: SELinux 防止 $SOURCE_PATH「$ACCESS」存取裝置 $TARGET_PATH。
