Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: If you want to allow users to run TCP servers (bind to ports and accept connection from the same domain and outside users) disabling this forces FTP passive mode and may change other protocols.
as: যদি আপুনি ব্যৱহাৰকাৰীসমূহক TCP চাৰ্ভাৰসমূহ চলোৱাৰ (পোৰ্টসমূহলে সংযুক্ত হোৱা আৰু একেটা) ডমেইনৰ আৰু বাহিৰৰ ব্যৱহাৰকাৰীসমূহৰ পৰা সংযোগ গ্ৰহণ কৰা) অনুমতি দিব বিচাৰে। এই বলসমূহ FTP নিষ্ক্ৰিশ অৱস্থা অসামৰ্থবান কৰিলে অন্য প্ৰটোকলসমূহ সলনি হব পাৰে।
es: Si desea permitir que los usuarios ejecuten servidores TCP (asociados a puertos y aceptando conexiones desde el mismo dominio o de usuarios externos). Deshabilitar esto hace que FTP se ejecute en modo pasivo, y tal vez pueda modificar otros protocolos.
gu: જો તમે TCP સરવરોને ચલાવવા માટે વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો (પોર્ટોને બાંધો અને એજ ડોમેઇન એને બહારનાં વપરાશકર્તાઓમાંથી જોડાણને સ્વીકારો) આને નિષ્ક્રિય કરવાથી FTP નિષ્ક્રિય સ્થિતિ પર દબાણ આવે છે અને બીજા પ્રોટોકોલો બદલાઇ શકે છે.
ja: ユーザが、 TCP サーバを実行すること (port を関連付け、同じドメインの外部ユーザの通信を許可すること) を、もし許可したい場合。これを無効にすると、 FTP は強制的に passive モードになります。他のプロトコルも変えてしまうかもしれません。
kn: ಬಳಕೆದಾರರು TCP ಪರಿಚಾರಕಗಳನ್ನು ಚಲಾಯಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ (ಸಂಪರ್ಕಸ್ಥಾನಗಳಿಗೆ ಬೈಂಡ್ ಮಾಡಿ ಹಾಗು ಅದೇ ಡೊಮೈನ್‌ನಿಂದ ಹಾಗು ಹೊರಗಿನ ಬಳಕೆದಾರರಿಂದ ಸಂಪರ್ಕವನ್ನು ಸ್ವೀಕರಿಸಲು) ಇದನ್ನು ಅಶಕ್ತಗೊಳಿಸುವುದರಿಂದ FTP ನಿಷ್ಕ್ರಿಯ ಕ್ರಮವನ್ನು ಒತ್ತಾಯಿಸಬಹುದು ಹಾಗು ಇತರೆ ಪ್ರೊಟೊಕಾಲ್‌ಗಳನ್ನು ಬದಲಾಯಿಸಬಹುದು.
or: ଯଦି ଆପଣ ଚାଳକମାନଙ୍କୁ TCP ସର୍ଭରଗୁଡ଼ିକୁ ଚଲାଇବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି (ତେବେ ପୋର୍ଟକୁ ଲଗାନ୍ତୁ ଏବଂ ସମାନ ଡମେନରୁ ସଂଯୋଗକୁ ବାହାର ଚାଳକପାଖରୁ ଗ୍ରହଣ କରନ୍ତୁ) ଏହାକୁ ନିଷ୍କ୍ରିୟ କରିବା ଫଳରେ FTP ନିଷ୍କ୍ରିୟ ଧାରାକୁ ଆଣିଥାଏ ଏବଂ ହୁଏତଃ ଅନ୍ୟ ପ୍ରଟୋକଲଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିଥାଏ।
te: మీరు వాడుకరులను TCP సర్వర్లను (పోర్ట్సుకు బందనం అయివుండి మరియు అనుసంధానమును అదే డొమైన్ నుండి మరియు బయటి వాడుకరులనుండి ఆమోదించుచు) దీనిని అచేతనపరచి నడుపుట FTP పాసివ్ రీతిని వత్తిడి చేయును మరియు యితర ప్రోటోకాల్సును మార్చును.
uk: Якщо ви бажаєте дозволити користувачам запускати сервери TCP (здійснювати прив'язку портів та приймати з'єднання з того ж домену та зовнішніх користувачів). Вимикання цієї можливості викличе перехід у пасивний режим FTP та може змінити інші протоколи.

source: If you want to allow mysqld to connect to all ports
as: যদি আপুনি mysqld ক সকলো পোৰ্টলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que mysqld se conecte a todos los puertos
gu: જો તમે બધા પોર્ટો સાથે જોડાવા માટે mysqld ને પરવાનગી આપવા માંગો છો
ja: mysqld が、全ての port に接続することを、もし許可したい場合
kn: mysqld ಎಲ್ಲಾ ಸಂಪರ್ಕಸ್ಥಾನಗಳಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ
or: ଯଦି ଆପଣ mysqld କୁ ସମସ୍ତ ପୋର୍ଟଗୁଡ଼ିକ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: అన్ని యితర పోర్టులకు అనుసంధానమగుటకు మీరు mysqld అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити mysqld встановлення з’єднань на всіх портах

source: If you want to allow regular users direct mouse access
as: যদি আপুনি সাধাৰণ ব্যৱহাৰকাৰীসমূহৰ প্ৰত্যক্ষ মাউছ অভিগম ৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que usuarios regulares tengan acceso directo a través del ratón
gu: જો તમે નિયમિત વપરાશકર્તાઓને સીધો જ માઉસ પ્રવેશ માટે પરવાનગી આપવા માંગો છો
ja: 通常ユーザに、 direct マウスアクセスを、もし許可したい場合
kn: ಸಾಮಾನ್ಯವಾದ ಬಳಕೆದಾರರು ನೇರವಾದ ಮೌಸ್‌ ಅನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳುವುದನ್ನು ಅನುಮತಿಸಲು ನೀವು ಅನುಮತಿಸಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ସାଧାରଣ ଚାଳକକୁ ମାଉସ ଚଲାଇବାକୁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
te: మీరు రోజువారి వాడుకరుల సూటి మౌస్ యాక్సెస్‌ను అనుమతించగోరితే
uk: Якщо ви бажаєте надати звичайним користувачам безпосередній доступ до миші

source: If you want to allow xend to run blktapctrl/tapdisk. Not required if using dedicated logical volumes for disk images.
as: যদি আপুনি xend ক blktapctrl/tapdisk চলোৱাৰ অনুমতি দিব বিচাৰে। প্ৰয়োজনীয় নহয় যদি ডিস্ক ছবিসমূহৰ বাবে উৎসৰ্গিত যৌক্তিক আয়তনসমূহ ব্যৱহাৰ কৰা হৈ আছে।

source: If you want to allow confined virtual guests to interact with the sanlock
as: যদি আপুনি sanlock ৰ সৈতে ভাৱবিনিময় কৰিবলে গোপন ভাৰছুৱেল অতিথিসমূহৰ অনুমতি দিব বিচাৰে

source: If you want to allow all domains to have the kernel load modules
as: যদি আপুনি সকলো ডমেইনৰ কাৰনেল ল'ড মডিউলসমূহ থকাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que todos los dominios tengan los módulos de carga del kernel.
gu: જો તમે કર્નલ લોડ મોડ્યુલોને રાખવા માટે બધા ડોમેઇનોને પરવાનગી આપવા માંગો છો
ja: 全てのドメインが、 kernel load モジュールを持つことを、もし許可したい場合
kn: ಎಲ್ಲಾ ಡೊಮೈನ್‌ಗಳು ಕರ್ನಲ್ ಲೋಡ್ ಘಟಕಗಳನ್ನು ಹೊಂದಿರಲು ನೀವು ಅನುಮತಿಸಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ସମସ୍ତ ଡମେନକୁ କର୍ଣ୍ଣଲ ଧାରଣ ଏକକାଂଶଗୁଡ଼ିକୁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
te: మీరు అన్ని డొమైన్సు కెర్నల్ లోడ్ మాడ్యూళ్ళను కలిగివుండుట అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити всім доменам завантажувати модулі ядра

source: If you want to allow confined virtual guests to use usb devices
as: যদি আপুনি গোপন ভাৰছুৱেল অতিথিসমূহক usb যন্ত্ৰসমূহ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que los huéspedes confinados virtuales puedan utilizar dispositivos usb
gu: જો તમે usb ઉપકરણોને વાપરવા માટે મર્યાદિત વર્ચ્યુઅલ મહેમાનોને વાપરવા માંગો છો
ja: 特定の仮想ゲストが、 usb デバイスを使用することを、もし許可したい場合
kn: usb ಸಾಧನಗಳನ್ನು ಬಳಸಲು ನೀವು ನಿರ್ಬಂಧಿತ ವರ್ಚುವಲ್ ಅತಿಥಿಗಳಿಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ବନ୍ଧିତ ଆଭାସୀ ଅତିଥିମାନଙ୍କୁ usb ଉପକରଣଗୁଡ଼ିକୁ ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: లోబడిన వర్చ్యువల్ గెస్టులు usb పరికరములను వుపయోగించుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ обмеженим гостьовим віртуальним системам використовувати пристрої USB

source: If you want to enable additional permissions needed to support devices on 3ware controllers.
as: যদি আপুনি 3ware নিয়ন্ত্ৰকসমূহত যন্ত্ৰসমূহ সমৰ্থন কৰিবলে প্ৰয়োজনীয় অতিৰিক্ত অনুমতিসমূহ সামৰ্থবান কৰিব বিচাৰে।
es: Si desea habilitar permisos adicionales necesarios para soportar dispositivos en controladores 3ware.
gu: જો તમે 3ware નિયંત્રકો પર ઉપકરણોને આધાર આપવા માટે જરૂરી વધારાની પરવાનગીઓને સક્રિય કરવા માંગો છો.
ja: 必要な追加権限を有効にし、3ware controllers のデバイスを、もしサポートしたい場合。
kn: 3ware ನಿಯಂತ್ರಕಗಳಲ್ಲಿ ಬೆಂಬಲಿಸಲು ಅಗತ್ಯವಿರುವ ಹೆಚ್ಚುವರಿ ಅನುಮತಿಗಳನ್ನು ಶಕ್ತಗೊಳಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ 3ware ନିୟନ୍ତ୍ରକରେ ସହାୟତା ପାଇଁ ଆବଶ୍ୟକ ଅତିରିକ୍ତ ଅଧିକାରକୁ ସକ୍ରିୟ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
te: 3ware నియంత్రికలపైని పరికరములకు తోడ్పాటునిచ్చుటకు అవసరమైన అదనపు అనుమతులను మీరు చేతనపరచగోరితే.
uk: Якщо ви бажаєте увімкнути додаткові права доступу, потрібні для підтримки пристроїв на контролерах 3ware.

source: If you want to allow httpd processes to manage IPA content
as: যদি আপুনি IPA সমল ব্যৱস্থাপনা কৰিবলে httpd প্ৰক্ৰিয়াসমূহক অনুমতি দিব বিচাৰে

source: If you want to allow java executable stack
as: যদি আপুনি java এক্সিকিউটেবুল স্টেকৰ অনুমতি দিব বিচাৰে
es: Si desea permitir una porción java ejecutable
gu: જો તમે java એક્સિક્યૂટેબલ સ્ટેકને પરવાનગી આપવા માંગો છો
ja: java に、実行可能 stack を、もし許可したい場合
kn: java ಕಾರ್ಯಗತಗೊಳಿಸುವ ಸ್ಟ್ಯಾಕ್ ಅನ್ನು ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ java ନିଷ୍ପାଦନଯୋଗ୍ୟ କାର୍ଯ୍ୟକୁ ଅନୁମତି ଦେବା ପାଇଁ ଛାହୁଁଛନ୍ତି
te: మీరు java యెగ్జిక్యూటబుల్ స్టాక్‌ను అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити використання стосу виконання java

source: If you want to allow http daemon to send mail
as: যদি আপুনি http ডিমনক মেইল প্ৰেৰণৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que el demonio http envíe correos
gu: જો તમે મેઇલને મોકલવા માટે http ડિમનને વાપરવા માંગો છો
ja: http デーモンが、メールを送信することを、もし許可したい場合
kn: ಮೈಲ್ ಅನ್ನು ಕಳುಹಿಸಲು http ಡೀಮನ್‌ಗೆ ಅನುಮತಿಸಲು ನೀವು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ମେଲ ପଠାଇବା ପାଇଁ http ଡେମନକୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି କି
te: మెయిల్ పంపుటకు మీరు http డెమోన్‌ను అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ фоновій службі http до надсилання пошти

source: If you want to allow samba to export ntfs/fusefs volumes.
as: যদি আপুনি samba ক ntfs/fusefs আয়তনসমূহ এক্সপোৰ্ট কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que samba exporte volúmenes ntfs/usefs.
gu: જો તમે ntfs/fusefs વોલ્યુમોનું નિકાસ કરવા માટે samba ને પરવાનગી આપવા માંગો છો.
ja: samba が、 ntfs/fusefs ボリュームを転送することを、もし許可したい場合。
kn: samba ವು ntfs/fusefs ಪರಿಮಾಣಗಳನ್ನು ಆಮದು ಮಾಡಿಕೊಳ್ಳಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ ntfs/fusefs ଭଲ୍ୟୁମକୁ ପଠାଇବା ପାଇଁ samba କୁ ଅନୁମତି ଦିଅନ୍ତି।
te: ntfs/fusefs వాల్యూమ్‌లను యెగుమతి చేయుటకు మీరు sambaను అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ samba до експортування томів ntfs/fusefs.

source: If you want to enable support for upstart as the init program.
as: যদি আপুনি init প্ৰগ্ৰাম হিচাপে upstart ৰ বাবে সমৰ্থন সামৰ্থবান কৰিব বিচাৰে।
es: Si desea habilitar soporte para que upstart sea el programa init.
gu: જો તમે init કાર્યક્રમ તરીકે અપસ્ટાર્ટ માટે આધારને સક્રિય કરવા માંગો છો.
ja: init プログラムとしての unstart サポートを、もし有効にしたい場合。
kn: init ಪ್ರೊಗ್ರಾಮ್‌ನಂತೆ ಅಪ್‌ಸ್ಟಾರ್ಟಿಗಾಗಿ ಬೆಂಬಲವನ್ನು ಶಕ್ತಗೊಳಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ init ପ୍ରଗ୍ରାମ ଭାବରେ upstart ପାଇଁ ସହାୟତାକୁ ସକ୍ରିୟ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
te: మీరు upstart కొరకు తోడ్పాటును init ప్రోగ్రామ్ వలె చేతనపరచగోరితే.
uk: Якщо ви бажаєте увімкнути підтримку upstart як програми ініціалізації системи.

source: If you want to allow zebra daemon to write it configuration files
as: যদি আপুনি zebra ডিমনক তাৰ সংৰূপ নথিপত্ৰসমূহ লিখাৰ অনুমতি দিব বিচাৰে
es: Si desea permitirle al demonio zebra la modificación de archivos de configuración
gu: જો તમે તેને રૂપરેખાંકન ફાઇલો પર લખવા માટે zebra ડિમનને પરવાનગી આપવા માંગો છો
ja: zebra デーモンが、 設定ファイルに書き込むことを、もし許可したい場合
kn: zebra ಡೀಮನ್‌ ಅದರ ಸಂರಚನಾ ಕಡತಗಳಿಗೆ ಬರೆಯಲು ಅನುಮತಿಸಲು ನೀವು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ଜେବ୍ରା ଡେମନକୁ ଏହାର ବିନ୍ଯାସ ଫାଇଲ ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте надати доступ фоновій службі zebra для запису її файлів налаштувань

source: If you want to allow httpd to use built in scripting (usually php)
as: যদি আপুনি httpd ক পুৰ্বনিৰ্মিত স্ক্ৰিপ্টিং (সাধাৰণত php) ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: SI desea permitir que httpd utilice secuencias de comandos (por lo general php)
gu: જો તમે સ્ક્રિપ્ટીંગ (સામાન્ય રીતે php) માં બિલ્ટને વાપરવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: httpd が、 build in されたスクリプト (通常は php) を使用することを、もし許可したい場合。
kn: httpd ಯು ಒಳನಿರ್ಮಿತ ಸ್ಕಿಪ್ಟಿಂಗ್ (ಸಾಮಾನ್ಯವಾಗಿ php) ಅನ್ನು ಬಳಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ପୂର୍ବ ନିର୍ମିତ ସ୍କ୍ରିପ୍ଟକୁ ବ୍ୟବହାର କରିବା ପାଇଁ httpd କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି (ସାଧାରଣତଃ php)
te: బుల్టిన్ స్క్రిప్టింగ్‌ (సాధారణంగా php)ను వుపయోగించుటకు మీరు httpdను అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити httpd використовувати вбудовані інструменти обробки скриптів (зазвичай php)

source: If you want to allow exim to create, read, write, and delete unprivileged user files.
as: যদি আপুনি exim ক সুবিধাবিহিন ব্যৱহাৰকাৰী নথিপত্ৰসমূহ সৃষ্টি, পঢ়া, লিখা আৰু মচাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir a exim que genere, lea, modifique y elimine archivos de usuarios no privilegiados.
gu: જો તમે બિનઅધિકારી વપરાશકર્તા ફાઇલોને બનાવવા, વાંચવા, લખવા, અને કાઢી નાંખવા માટે exim ને પરવાનગી આપવા માંગો છો.
ja: exim が、 管理されていないユーザファイルを、作成、読み書き、削除することを、もし許可したい場合。
kn: ಅಧಿಕಾರವಿಲ್ಲದ ಬಳಕೆದಾರ ಕಡತಗಳನ್ನು ರಚಿಸಲು, ಬರೆಯಲು ಹಾಗು ಓದಲು exim ಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ exim କୁ ଅଧିକାର ପ୍ରାପ୍ତ ହୋଇନଥିବା ଚାଳକ ଫାଇଲଗୁଡ଼ିକୁ ନିର୍ମାଣ, ପଠନ, ଲିଖନ, ଏବଂ ଅପସାରଣ ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు eximను అనుమతిలేని వాడుకరి ఫైళ్ళను సృష్టించుట, చదువుట, వ్రాయుట, మరియు తొలగించుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ exim на створення, читання, запис і вилучення файлів непривілейованого користувача.

source: If you want to allow cdrecord to read various content. nfs, samba, removable devices, user temp and untrusted content files
as: যদি আপুনি cdrecord বিভিন্ন বিষয়বস্তু পঢ়াৰ অনুমতি দিব বিচাৰে। nfs, samba, আতৰাব পৰা যন্ত্ৰসমূহ, ব্যৱহাৰকাৰী অস্থায়ী আৰু ভৰষাহিন বিষয়বস্তু নথিপত্ৰসমূহ
es: Si desea permitir que cdrecord tenga acceso a diversos contenidos: nfs, samba, dispositivos removibles, archivos temporales de usuario o de contenido no confiable.
gu: જો તમે વિશિષ્ટ સમાવિષ્ટને વાંચવા માટે cdrecord ને પરવાનગી આપવા માંગતા હોય. nfs, samba, દૂર કરી શકાય તેવાં ઉપકરણો, વપરાશકર્તા temp અને અવિશ્ર્વાસીત ફાઇલો
ja: cdrecord が、様々なコンテンツを読むことを、もし許可したい場合。 nfs, samba, リムーバブルデバイス, ユーザ temp, 信頼できないコンテンツファイルなどです。
kn: cdrecord ಹಲವಾರು ವಿಷಯಗಳ ಕಡತಗಳನ್ನು ಓದಲು ನೀವು ಅನುಮತಿಸಬೇಕಿದ್ದಲ್ಲಿ. nfs, samba, ತೆಗೆದುಹಾಕಬಹುದಾದ ಸಾಧನಗಳು, ಬಳಕೆದಾರ ತಾತ್ಕಾಲಿಕ ಹಾಗು ನಂಬಿಕಾರ್ಹವಲ್ಲದ ವಿಷಯ ಕಡತಗಳು
or: ଯଦି ଆପଣ cdrecord କୁ ବିଭିନ୍ନ ବିଷୟବସ୍ତୁକୁ ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି। nfs, samba, କଢ଼ାଯୋଗ୍ୟ ଉପକରଣଗୁଡ଼ିକ, ଚାଳକ temp ଏବଂ ଅବିଶ୍ୱସ୍ତ ବିଷୟବସ୍ତୁ ଫାଇଲଗୁଡ଼ିକ
te: మీరు cdrecord ను వివిధ సారములు nfs, samba, తీయదగు పరికరములు, వాడుకరి తాత్కాలికం మరియు నమ్మదగని సారపు ఫైళ్ళు వంటి వాటిని చదువుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити cdrecord читання різної інформації з NFS, Samba, з тимчасових каталогів користувачів, ненадійних файлів та змінних пристроїв
zh_tw: 如果您想要允許 cdrecord 讀取多種內容。nfs、samba、可移動裝置、使用者的暫存檔與未受信任的檔案

source: If you want to allow Cobbler to modify public files used for public file transfer services.
as: যদি আপুনি Cobbler ক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত ৰাজহুৱা নথিপত্ৰসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que Cobbler modifique archivos públicos utilizados por servicios de transferencia de archivos públicos.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરેલ સાર્વજનિક ફાઇલોને બદલવા માટે Cobbler ને પરવાનગી આપવા માંગો છો.
ja: Cobber が、 共有ファイルを編集し、共有ファイル転送サービスを使用することを、もし許可したい場合。
kn: Cobbler ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಮಾರ್ಪಡಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ Cobbler କୁ ସର୍ବସାଧାରଣ ଫାଇଲ ପରିବହନ ସର୍ଭରଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте надати доступ Cobbler до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами.

source: If you want to allow samba to export NFS volumes.
as: যদি আপুনি samba ক NFS আয়তনসমূহ এক্সপোৰ্ট কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que samba exporte volúmenes NFS.
gu: જો તમે NFS વોલ્યુમોનું નિકાસ કરવા માટે samba ને પરવાનગી આપવા માંગો છો.
ja: samba が、 NFS ボリュームを転送することを、もし許可したい場合。
kn: samba ವು NFS ಪರಿಮಾಣಗಳನ್ನು ಆಮದು ಮಾಡಿಕೊಳ್ಳಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ NFS ଭଲ୍ୟୁମକୁ ପଠାଇବା ପାଇଁ samba କୁ ଅନୁମତି ଦିଅନ୍ତି।
te: మీరు సాంబాను NFS వాల్యూమ్సును యెగుమతి చేయుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ samba до експортування томів NFS.

source: If you want to control the ability to mmap a low area of the address space, as configured by /proc/sys/kernel/mmap_min_addr.
as: যদি আপুনি /proc/sys/kernel/mmap_min_addr দ্বাৰা সংৰূপণ কৰা ধৰণেঠিকনা স্থানৰ নিম্ন স্থান mmap কৰাৰ ক্ষমতা নিযন্ত্ৰণ কৰিব বিচাৰে।
es: Si desea controlar la posibilidad de realizar mmap sobre una área inferior del espacio de dirección, de acuerdo a como se encuentra configurado en /proc/sys/kernel/mmap_min_addr.
gu: જો તમે સરનામાં જગ્યાની નીચા સ્તરની mmap ની ક્ષમતાને નિયંત્રિત કરવા માંગો છો, /proc/sys/kernel/mmap_min_addr દ્દારા રૂપરેખાંકિત થયેલ છે.
ja: mmap の、アドレス空間の低いエリアでの権限を、もし管理したい場合。 /proc/sys/kernel/mmap_min_addr によって設定されます。
kn: /proc/sys/kernel/mmap_min_addr ಇಂದ ಸಂರಚಿಸಲಾಗಿರುವಂತೆ ವಿಳಾಸ ಸ್ಥಳದಲ್ಲಿನ ಕೆಳಮಟ್ಟದ ಜಾಗದಲ್ಲಿ mmap ಮಾಡುವ ಸಾಮರ್ಥ್ಯವನ್ನು ನೀವು ನಿಯಂತ್ರಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ /proc/sys/kernel/mmap_min_addr ଭାବରେ ବିନ୍ୟାସିତ ହୋଇଥିବା ପରି, ଗୋଟିଏ ଠିକଣାର ନିମ୍ନସ୍ତରକୁ mmap କରିବା ପାଇଁ କ୍ଷମତା ପ୍ରଦାନ କରିବାକୁ ଚାହୁଁଛନ୍ତି।
te: /proc/sys/kernel/mmap_min_addr చేత ఆకృతీకరించబడినట్లు, చిరునామా స్పేస్ యొక్క లో యేరియాకు mmap అగు సామర్థ్యంను నియంత్రించగోరితే.
uk: Якщо ви бажаєте керувати можливістю використання mmap у нижніх областях простору адрес у спосіб, визначений /proc/sys/kernel/mmap_min_addr.

source: If you want to ignore wine mmap_zero errors.
as: যদি আপুনি wine mmap_zero ত্ৰুটিসমূহ উপেক্ষা কৰিব বিচাৰে।
es: Si desea ignorar errores de wine mmap_zero.
gu: જો તમે વાઇન mmap_zero ભૂલોને અવગણવા માંગો છો.
ja: mmap_zero エラーを、もし無視したい場合。
kn: wine mmap_zero ದೋಷಗಳನ್ನು ಕಡೆಗಣಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ wine mmap_zero ତ୍ରୁଟିଗୁଡ଼ିକୁ ଅଗ୍ରାହ୍ୟ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте ігнорувати помилки wine mmap_zero.

source: If you want to allow collectd to connect to the network using TCP.
as: যদি আপুনি collectd ক TCP ব্যৱহাৰ কৰি নেটৱাৰ্কলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।

source: If you want to allow logging in and using the system from /dev/console.
as: যদি আপুনি /dev/console ৰ পৰা প্ৰৱেশ আৰু চিস্টেম ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir registros y utilizar el sistema desde /dev/console.
gu: જો તમે પ્રવેશવાની પરવાનગી આપવા માંગો છો અને /dev/console માંથી સિસ્ટમને વાપરી રહ્યા છો.
ja: /dev/console からログインしてシステムの使用を許可したい場合
kn: ಒಳಗೆ ಪ್ರವೇಶಿಸಲು ಹಾಗು ವ್ಯವಸ್ಥೆಯನ್ನು /dev/console ಇಂದ ಬಳಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ.
uk: Якщо ви бажаєте надавати можливість входу до системи і користування системою за допомогою /dev/console.

source: If you want to allow user processes to change their priority
as: যদি আপুনি ব্যৱহাৰকাৰী প্ৰক্ৰিয়াসমূহক সিহতৰ প্ৰাথমিকতা সলনি কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que los procesos de usuarios modifiquen sus prioridades
gu: જો તમે તેનાં પ્રાધન્યને બદલવા માટે વપરાશકર્તાની પ્રક્રિયાઓને પરવાનગી આપવા માંગો છો
ja: ユーザプロセスが、彼らのプライオリティを変更することを、もし許可したい場合
kn: ಬಳಕೆದಾರ ಪ್ರಕ್ರಿಯೆಗಳು ತಮ್ಮ ಆದ್ಯತೆಗಳನ್ನು ಬದಲಾಯಿಸಲು ನೀವು ಅನುಮತಿಸಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ଚାଳକ ପ୍ରକ୍ରିୟାଗୁଡ଼ିକୁ ସେମାନଙ୍କର ପ୍ରାଥମିକତା ଅନୁସାରେ ପରିବର୍ତ୍ତନ କରିବାକୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: వాడుకరి క్రమణములు వాటి ప్రాముఖ్యతను మార్చుటను మీరు అనుమతించగోరితే
uk: Якщо ви бажаєте надати змогу процесам користувача змінювати власний пріоритет виконання
zh_tw: 若您希望允許使用者更改其優先權

source: If you want to allow fenced domain to connect to the network using TCP.
as: যদি আপুনি ফেনস্ড ডমেইনক TCP ব্যৱহাৰ কৰি নেটৱাৰ্কলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir dominios cercados para conectarse a la red utilizando TCP.
gu: જો તમે TCP ની મદદથી નેટવર્ક સાથે જોડાવા માટે fenced ડોમેઇનને પરવાનગી આપવા માંગો છો.
ja: 保護されたドメイン が、 TCP を使ってネットワークに接続することを、もし許可したい場合。
kn: fenced ಡೊಮೈನ್ TCP ಅನ್ನು ಬಳಸಿಕೊಂಡು ಜಾಲಬಂಧದೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ fenced ଡମେନକୁ TCP ବ୍ୟବହାର କରି ନେଟୱର୍କ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте дозволити домену fenced встановлювати з’єднання з мережею за допомогою TCP.

source: If you want to allow dhcpc client applications to execute iptables commands
as: যদি আপুনি dhcpc ক্লাএন্ট অনুপ্ৰয়োগসমূহক iptables কমান্ডসমূহ এক্সিকিউট কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que el aplicaciones del cliente dhcpc ejecuten comandos de iptables
gu: જો તમે iptables આદેશોને ચલાવવા માટે dhcpc ક્લાયન્ટ કાર્યક્રમોને પરવાનગી આપવા માંગો છો
ja: dhcpc クライアントが、 iptables コマンドを実行することを、もし許可したい場合
kn: dhcp ಕ್ಲೈಂಟ್ ಅನ್ವಯಗಳು iptables ಆಜ್ಞೆಗಳನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವಂತೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ iptables ନିର୍ଦ୍ଦେଶଗୁଡ଼ିକୁ ନିଷ୍ପାଦନ କରିବା ପାଇଁ ଯଦି ଆପଣ dhcpc କ୍ଲାଏଣ୍ଟ ପ୍ରୟୋଗକୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: iptables ఆదేశములను నిర్వర్తించుటకు dhcpc క్లైంట్ అనువర్తనములను మీరు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити клієнтським програмам dhcpc виконувати команди iptables
zh_tw: 如果您想要允許 dhcpc 用戶端應用程式執行 iptables 指令

source: If you want to allow users to connect to PostgreSQL
as: যদি আপুনি ব্যৱহাৰকাৰীসমূহক PostgreSQL লে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir a los usuarios conectarse con PostgreSQL
gu: જો તમે PostgreSQL સાથે જોડાવા માટે વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો
ja: ユーザが、 PostgreSQL に接続することを、もし許可したい場合。
kn: PostgreSQL ದೊಂದಿಗೆ ಬಳಕೆದಾರರು ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ
or: ଯଦି ଆପଣ ଚାଳକକୁ PostgreSQL ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте надати доступ користувачам на з’єднання з PostgreSQL

source: If you want to allow cvs daemon to read shadow
as: যদি আপুনি cvs ডিমনক ছায়া পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que el demonio cvs lea sobre shadow
gu: જો તમે શૅડો ને વાંચવા માટે cvs ડિમનને પરવાનગી આપવા માંગો છો
ja: cvs デーモンが、 shadow を読むことを、もし許可したい場合。
kn: ಛಾಯೆಯನ್ನು cvs ಡೀಮನ್ ಓದಲು ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ cvs ଡେମନକୁ shadow ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
uk: Якщо ви бажаєте надати доступ фоновій служби cvs до читання файла shadow

source: If you want to allow http daemon to check spam
as: যদি আপুনি http ডিমনক স্পাম নীৰিক্ষণ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que el demonio http verifique la existencia de spam
gu: જો તમે spam ને ચકાસવા માટે http ડિમનને પરવાનગી આપવા માંગો છો
ja: http デーモンが、 spam をチェックすることを、もし許可したい場合。
kn: ಸ್ಪ್ಯಾಮ್ ಅನ್ನು ನೋಡಲು http ಡೀಮನ್‌ಗೆ ಅನುಮತಿಸಲು ನೀವು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ଅବାଞ୍ଛିତ ଇମେଲ ଯାଞ୍ଚ ପାଇଁ http ଡେମନକୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте надати доступ фоновій службі http до пошуку спаму

source: If you want to allow sftp-internal to login to local users and read/write all files on the system, governed by DAC.
as: যদি আপুনি sftp-internal ক স্থানীয় ব্যৱহাৰকাৰীসমূহত প্ৰৱেশ কৰি চিস্টেমত DAC ৰে ৰাজত্ব কৰা, সকলো নথিপত্ৰ পঢ়া/লিখাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que sftp-internal registre usuarios locales y lea/modifique arvhicos en el sistema, governado por DAC.
gu: જો તમે સિસ્ટમ પર સ્થાનિય વપરાશકર્તાઓ અને વાંચતી/લખતી બધી ફાઇલોને પ્રવેશવા માટે sftp-internal ને પરવાનગી આપવા માંગો છો, DAC દ્દારા ચલાવાય છે.
ja: sftp-internal が、ローカルユーザにログインし、 DAC 管理のシステムの全ファイルを読み書きすることを、もし許可したい場合。
kn: sftp-internal ಸ್ಥಳೀಯ ಬಳಕೆದಾರರಾಗಿ ಪ್ರವೇಶಿಸಲು ಹಾಗು DAC ನಿಂದ ಮೇಲ್ವಿಚಾರಣೆ ನಡೆಸಲಾಗುತ್ತಿರುವ ವ್ಯವಸ್ಥೆಯಲ್ಲಿನ ಎಲ್ಲಾ ಕೋಶಗಳನ್ನು ಓದಲು/ಬರೆಯಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ sftp-ଆଭ୍ୟନ୍ତରୀଣ ସ୍ଥାନୀୟ ଚାଳକରେ ଲଗଇନ କରିବାକୁ ଏବଂ DAC ଦ୍ୱାରା ପରିଚାଳିତ ତନ୍ତ୍ରରେ ଥିବା ସମସ୍ତ ଫାଇଲଗୁଡ଼ିକୁ ପଢ଼ିବା/ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте надати вбудованим серверам sftp доступ до входу до системи від імені локальних користувачів і здійснювати читання або запис файлів у системі, що керується DAC.

source: If you want to allow xguest users to mount removable media
as: যদি আপুনি xguest ব্যৱহাৰকাৰীসমূহক আতৰাব পৰা মাধ্যম মাউন্ট কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que usuarios xguest monten medios removibles
gu: જો તમે દૂર કરી શકાય તેવી મીડિયાને માઉન્ટ કરવા માટે xguest વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો
ja: xguest ユーザが、リムーバブルメディアをマウントすることを、もし許可したい場合。
kn: ತೆಗೆದು ಹಾಕಬಹುದಾದ ಸಾಧನಗಳನ್ನು ಆರೋಹಿಸಲು ನೀವು xguest ಬಳಕೆದಾರರನ್ನು ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ xguest ଚାଳକମାନଙ୍କୁ କଢ଼ାଯୋଗ୍ୟ ମେଡିଆକୁ ସ୍ଥାପନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте дозволити користувачам xguest монтувати змінні носії даних

source: If you want to allow icecast to connect to all ports, not just sound ports.
as: যদি আপুনি icecast ক শব্দ পোৰ্টসমূহৰ বাহিৰেও, সকলো পোৰ্টলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitirle a icecast conectarse con todos los puertos, y no solo con los puertos de sonido.
gu: જો તમે બધા પોર્ટો સાથે જોડાવા માટે icecast ને પરવાનગી આપવા માંગો છો.
ja: icecast が、 sound port だけでなく、全ての port に接続することを、もし許可したい場合。
kn: icecast ಯು ಕೇವಲ ಧ್ವನಿ ಸಂಪರ್ಕಸ್ಥಾನಗಳಲ್ಲದೆ ಎಲ್ಲಾ ಸಂಪರ್ಕಸ್ಥಾನಗಳಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ icecast କୁ କେବଳ ଧ୍ୱନି ପୋର୍ଟ ବ୍ୟତୀତ ବାକି ସମସ୍ତ ପୋର୍ଟଗୁଡ଼ିକ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте надати доступ icecast на встановлення з’єднань на всіх портах, а не лише звукових портах.

source: If you want to allow pppd to load kernel modules for certain modems
as: যদি আপুনি pppd ক কিছুমান মডেমৰ বাবে কাৰনেল মডিউলসমূহ ল'ড কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que pppd cargue módulos del kernel para determinados modems
gu: જો તમે અમુક મોડેમ માટે કર્નલ મોડ્યુલોને લોડ કરવા માટે pppd ને પરવાનગી આપવા માંગો છો
ja: pppd が、 あるモデムから kernel module をロードすることを、もし許可したい場合。
kn: pppd ಯು ಕೆಲವು ನಿರ್ದಿಷ್ಟವಾದ ಮಾಡೆಮ್‌ಗಳಿಗಾಗಿ ಕರ್ನಲ್ ಘಟಕಗಳನ್ನು ಲೋಡ್ ಮಾಡಲು ನೀವು ಅನುಮತಿಸಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ pppd କୁ କର୍ଣ୍ଣଲ ଏକକାଂଶଗୁଡ଼ିକୁ କିଛି ମଡେମ ପାଇଁ ଧାରଣ କରିବାକୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте дозволити pppd завантажувати модулі ядра для певних модемів

source: If you want to deny user domains applications to map a memory region as both executable and writable, this is dangerous and the executable should be reported in bugzilla
as: যদি আপুনি ব্যৱহাৰকাৰী ডমেইন অনুপ্ৰয়োগসমূহক এটা মেমৰি অঞ্চলক দুয়ো এক্সিকিউটেবুল আৰু লিখিব পৰা হিচাপে মেপ কৰা নকাচ কৰিব বিচাৰে, ই বিপদজনক আৰু এক্সিকিউটেবুলক bugzilla ত সংবাদিত কৰিব লাগিব

source: If you want to allow syslogd daemon to send mail
as: যদি আপুনি syslogd ডিমনক মেইল পঠোৱাৰ অনুমতি দিব বিচাৰে

source: If you want to determine whether Polipo can access nfs file systems.
as: যদি আপুনি নিৰ্ধাৰণ কৰিব বিচাৰে Polipo এ nfs নথিপত্ৰ প্ৰণালীসমূহ অভিগম কৰিব পাৰিব নে।
