Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: You can alter the file context by executing chcon -R -t samba_share_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
as: আপুনি chcon -R -t samba_share_t '$TARGET_PATH' এক্সিকিউট কৰি নথিপত্ৰ পৰিপ্ৰেক্ষতিত সলনি কৰিব পাৰিব আপুনি লগতে চিস্টেমত অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহ সলনি কৰিব লাগিব যাতে সিহতক এটা সম্পূৰ্ণ পুনৰলেবেলত সংৰক্ষৰণ কৰিব পাৰি। "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo ejecutando chcon -R -t samba_share_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
gu: તમે chcon -R -t samba_share_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઇલોને પણ સંપૂર્ણ પુન:લેબલ પર તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર બદલવી જ પડશે. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'" ATH'"
ja: chcon -R -t samba_share_t '$TARGET_PATH' を実行すると、ファイルコンテキストを変更することができます。 また、完全な再ラベルの後にもそれらを保持するためにシステム上でデフォルトのファイルコンテキストファイルも変更しなければなりません。"semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
kn: chcon -R -t samba_share_t '$TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ ಕಡತದ ಸನ್ನಿವೇಶವನ್ನು ಬದಲಾಯಿಸಬಹುದು ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
or: ଆପଣ chcon -R -t samba_share_t '$TARGET_PATH' କୁ ନିଷ୍ପାଦନ କରି ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ବଦଳାଇପାରିବେ ସେମାନଙ୍କୁ ସମ୍ପୂର୍ଣ୍ଣ ପୁନଃ ନାମକରଣରେ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ଆପଣ ମଧ୍ଯ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ଫାଇଲକୁ ତନ୍ତ୍ରରେ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
te: మీరు దస్త్రసందర్బంను chcon -R -t samba_share_t '$TARGET_PATH' నిర్వర్తించుట ద్వారా మార్చవచ్చు.మీరు అప్రమేయ దస్త్ర సందర్భము దస్త్రములను సిస్టమ్ పైన పూర్తి చిరకను ఉంచుటకు క్రమానుగతంగా మార్చవచ్చు. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
uk: Контекст файлу можна змінити, виконавши команду «chcon -R -t samba_share_t '$TARGET_PATH'» Також треба змінити типові контексти файлів у системі, щоб вони збереглись навіть при повторній розмітці. «semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'»
zh_tw: 您可透過執行 chcon -R -t samba_share_t '$TARGET_PATH' 來修改檔案情境 您也必須更改系統上的預設檔案情境檔，才能在完整標記的情況下將它們保留住。「semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'」

source: Your system may be seriously compromised!
as: আপোনাৰ চিস্টেমত গুৰুতৰভাৱে সাল সলনি হব পাৰে!
es: ¡Su sistema puede estar seriamente comprometido!
gu: તમારી સિસ્ટમ ગંભીરતા થી સમાધાન કરી શકે છે!
ja: ご使用のシステムには深刻な侵害の可能性があります!
kn: ನಿಮ್ಮ ಗಣಕವು ಗಂಭೀರವಾಗಿ ರಾಜಿ ಮಾಡಿಕೊಂಡಿರಬಹುದು!
or: ଆପଣଙ୍କର ତନ୍ତ୍ରଟି ଗୁରୁତରଭାବରେ କ୍ଷତିଗ୍ରସ୍ତ ହୋଇପାରେ!
te: మీ సిస్టమ్ తీవ్రంగా రాజీ పడవచ్చు!
uk: Ваша система може бути серйозно скомпрометована!
zh_tw: 您的系統可能已嚴重遭到入侵！

source: SELinux has prevented $SOURCE from modifying $TARGET. This denial indicates $SOURCE was trying to modify the selinux policy configuration. All applications that need this access should have already had policy written for them. If a compromised application tries to modify the SELinux policy this AVC will be generated. This is a serious issue. Your system may very well be compromised.
as: SELinux এ $SOURCE ক $TARGET সলনি কৰাৰ পৰা প্ৰতিৰোধ কৰিছে। এই প্ৰতিৰোধে ইংগিত দিয়ে যে $SOURCE এ selinux নীতি সংৰূপ সলনি কৰাৰ চেষ্টা কৰি আছিল। সকলো অনুপ্ৰয়োগ যাৰ এই অভিগমৰ প্ৰয়োজন সিহতৰ বাবে নীতি লিখা থাকিব লাগিব। যদি এটা ভুল অনুপ্ৰয়োগে SELinux নীতি সলনি কৰাৰ চেষ্টা কৰে এই AVC সৃজন কৰা হব। ই এটা গুৰুতৰ সমস্যা। আপোনাৰ চিস্টেমত ভাল সাল সলনি হব পাৰে।
es: SELinux le ha negado a $SOURCE la posibilidad de modificar $TARGET. Esta negación muestra que $SOURCE intentaba modificar la política de configuración de selinux. Todas las aplicaciones que necesiten este acceso, deberían haber tenido algún tipo de política definida. Si una aplicación vulnerada intenta modificar la política de selinux, este AVC será generado. Este es un problema serio. Su sistema puede estar comprometido.
gu: SELinux એ $TARGET ને બદલવાથી $SOURCE ને અટકાવાયેલ છે. આ નામંજૂરી સૂચવે છે કે $SOURCE એ selinux પોલિસી રૂપરેખાંકનને બદલવા માટે પ્રયત્ન કરી રહ્યુ હતુ. બધા કાર્યક્રમો કે જે આ પ્રવેશની જરૂર તેઓ માટે પહેલેથી જ લખાયેલ પોલિસીની હોવી જોઇએ. જો સમજૂતી થયેલ કાર્યક્રમ SELinux પોલિસી ને બદલવા માટે પ્રયત્ન કરે છે આ AVC ઉત્પન્ન થશે. આ ગંભીર સમસ્યા છે. તમારી સિસ્ટમ સારી રીતે સમાધાન થયેલ હોઇ શકે છે.
ja: SELinux は、$SOURCE による $TARGET の修正を阻止しました。この拒否は $SOURCE が selinux ポリシーの設定を修正する試みをしていたことを 示します。 このアクセスを必要とする全てのアプリケーションはそれ自身用にすでにポリシーを 書かせておくべきでした。侵害されたアプリケーションが SELinux ポリシーを 修正する 試みをすると、この AVC が生成されるでしょう。これは重大な問題です。 ご使用の システムは侵害されている可能性が高くなります。
kn: $SOURCE ಅನ್ನು ಮಾರ್ಪಡಿಸದಂತೆ $TARGET ಅನ್ನು SELinux ತಡೆದಿದೆ. ಈ ನಿರಾಕರಣೆಯು $SOURCE SELinux ಪಾಲಿಸಿ ಸಂರಚನೆಯನ್ನು ಮಾರ್ಪಡಿಸಲು ಪ್ರಯತ್ನಿಸಿದೆ ಎನ್ನುವುದನ್ನು ಸೂಚಿಸುತ್ತದೆ. ಇದರ ಅಗತ್ಯವಿರುವ ಎಲ್ಲಾ ಅನ್ವಯಗಳಿಗೂ ಪಾಲಿಸಿಯನ್ನು ಈ ಮೊದಲೆ ಬರೆದಿರುವ ಅಗತ್ಯವಿರುತ್ತದೆ. ರಾಜಿ ಮಾಡಿಕೊಳ್ಳಲಾದ ಯಾವುದೆ ಅನ್ವಯವು ಕರ್ನಲ್ ಅನ್ನು ಮಾರ್ಪಡಿಸಲು ಪ್ರಯತ್ನಿಸಿದಲ್ಲಿ ಈ AVC ಯನ್ನು ತೋರಿಸಲಾಗುತ್ತದೆ ಇದು ಒಂದು ಗಂಭೀರವಾದ ಸಮಸ್ಯೆಯಾಗದ್ದು. ನಿಮ್ಮ ಗಣಕವು ರಾಜಿ ಮಾಡಿಕೊಂಡಿರುವಂತೆ ತೋರುತ್ತಿದೆ.
or: SELinux $SOURCE କୁ $TARGET କୁ ପରିବର୍ତ୍ତନ କରିବାରୁ ବାରଣ କରିଛି। ଏହି ବାରଣ ସୂଚାଇଥାଏ ଯେ $SOURCE ଟି selinux ନିତୀକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଚେଷ୍ଟାକରିଥିଲା। ଏହି ଅଭିଗମ୍ୟତା ଆବଶ୍ୟକ କରୁଥିବା ସମସ୍ତ ପ୍ରୟୋଗଗୁଡ଼ିକରେ ପୂର୍ବରୁ ସେଥିରେ ନିତୀ ଲେଖା ହୋଇଥିବା ଉଚିତ। ଯଦି ଗୋଟିଏ ସଂଶୋଧିତ ପ୍ରୟୋଗ SELinux କୁ ପରିବର୍ତ୍ତ କରିବାକୁ ଚେଷ୍ଟାକରେ ତେବେ ଏହି AVC ସୃଷ୍ଟିହେବ। ଏହା ଏକ ଗୁରୁତର ସମସ୍ୟା। ଆପଣଙ୍କର ତନ୍ତ୍ର ହୁଏତଃ ଆତ୍ମସମର୍ପଣ କରିଛି।
te: SELinux అనునది $SOURCEను $TARGET మార్చుట నుండి నిరోధిస్తుంది. ఈ తిరస్కరణ అనునది $SOURCE selinux పాలసీ ఆకృతీకరణను సవరించుటకు యత్నించుట సూచిస్తుంది. ఈ యాక్సెస్ కావలసిన అన్ని అనువర్తనములు తప్పక యిప్పటికే వాటికొరకు వ్రాయబడివున్న పాలసీను కలిగి వుండాలి. ఒకవేళ రాజీపడిన అనువర్తనము SELinux పాలసీను సవరించుటకు ప్రయత్నిస్తే ఈ AVC వుద్భవించబడుతుంది. ఇది వొక తీవ్రమైన సమస్య. మీ సిస్టమ్ చాలాబాగా రాజీ పడుతుంది.
uk: SELinux забороняє $SOURCE змінювати $TARGET. $SOURCE намагається змінити конфігурацію правил selinux. Для всіх програм, яким потрібен цей доступ, мають існувати власні правила. Якщо скомпрометована програма намагається змінити правила, буде згенеровано AVC. Це є серйозною проблемою та може бути ознакою того, що система могла бути скомпрометована.
zh_tw: SELinux 已防止 $SOURCE 修改 $TARGET。這項拒絕動作 顯示 $SOURCE 嘗試修改 selinux policy 設定。 所有需要這項存取許可的應用程式都應有個為它們而 編寫的方針。若有個遭到入侵的應用程式嘗試修改 SELinux 方針的話，此 AVC 便會產生。這是一項嚴重的問題。您的系統 可能已遭到入侵。

source: you did not directly cause this AVC through testing.
as: আপুনি এই AVC পৰিক্ষাৰে প্ৰত্যক্ষভাৱে কাৰ্য্যত কৰা নাই।
es: no provocó directamente este AVC mediante una prueba.
gu: ચકાસણી મારફતે આ AVC માટે તમે સીધા નિમિત્ત ન હતા.
ja: このAVCはこのテストによって直接起こったものではありません。
kn: ಪರೀಕ್ಷೆಯ ಮೂಲಕ ನೀವು ಈ AVC ನೇರವಾಗಿ ಕಾರಣವಾಗಲಿಲ್ಲ.
or: ଆପଣ ପରୀକ୍ଷା ସମୟରେ ସିଧାସଳଖ ଭାବରେ ଏହି AVC କୁ ଘଟାଇ ନାହାନ୍ତି।
te: మీరు పరీక్ష ద్వారా యీ AVCకు నేరుగా కారణం కాజాలరు.
uk: причиною цього запису AVC не було ваше безпосереднє тестування можливостей.
zh_tw: 您並未透過測試直接造成此 AVC。

source: if you think that you might have been hacked
as: যদি আপুনি ভাৱে আপোনাক হেক কৰা হৈছে
es: si piensa que ha sido víctima de un ataque
gu: જો તમે વિચારો છો કો તમે હેક થઇ ગયા છો
ja: もしこれがハッキングされていると考える場合
kn: ನಿಮ್ಮನ್ನು ಹ್ಯಾಕ್ ಮಾಡಲಾಗಿದೆ ಎಂದು ನಿಮಗೆ ಅನ್ನಿಸಿದರೆ
or: ଯଦି ଆପଣ ଭାବନ୍ତିଯେ ଆପଣଙ୍କୁ ହୁଏତଃ ହ୍ୟାକ କରାଯାଇଛି
te: మీరు హాక్ కాబడినారని మీరు అనుకొనుచున్నారా
uk: якщо ви вважаєте, що у вашу систему було здійснено несанкціоноване втручання
zh_tw: 如果您認為您可能已經被駭

source: Your system may be seriously compromised! $SOURCE_PATH tried to modify SELinux enforcement.
as: আপোনাৰ চিস্টেমত গুৰুতৰভাৱে সাল সলনি হব পাৰে! $SOURCE_PATH এ SELinux বলৱৎকৰণ সলনি কৰাৰ চেষ্টা কৰিছিল।
es: ¡Su sistema puede estar seriamente comprometido! $SOURCE_PATH intentó modificar el estado actual de SELinux.
gu: તમારી સિસ્ટમ ગંભીરતા થી સમાધાન કરી શકે છે! $SOURCE_PATH એ SELinux ને દબાણ કરીને બદલવા માટે પ્રયત્ન કર્યુ હતુ.
ja: ご使用のシステムには深刻な侵害の可能性があります! $SOURCE_PATH が SELinux 強制を修正しようとしました。
kn: ನಿಮ್ಮ ಗಣಕವು ಗಂಭೀರವಾಗಿ ರಾಜಿ ಮಾಡಿಕೊಂಡಿರಬಹುದು! SELinux ಅನ್ನು ಮಾರ್ಪಡಿಸಲು $SOURCE_PATH ಪ್ರಯತ್ನಿಸಿದೆ.
or: ଆପଣଙ୍କର ତନ୍ତ୍ରଟି ଗୁରୁତର ଭାବରେ କ୍ଷତିଗ୍ରସ୍ତ ହୋଇପାରେ! $SOURCE_PATH SELinux ଏନଫର୍ସମେଣ୍ଟକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ଚେଷ୍ଟାକରିପାରେ।
te: మీ సిస్టమ్ తీవ్రంగా రాజీ పడవచ్చు! $SOURCE_PATH అనునది SELinux ఎన్ఫోర్స్‌మెంట్‌ను సవరించుటకు పయత్నిస్తుంది.
uk: Ваша система може бути серйозно скомпрометована! $SOURCE_PATH намагається змінити примусовий режим SELinux.
zh_tw: 您的系統可能已嚴重遭到入侵！$SOURCE_PATH 已嘗試修改 SELinux enforcement。

source: SELinux has prevented $SOURCE from writing to a file under /selinux. Files under /selinux control the way SELinux is configured. All programs that need to write to files under /selinux should have already had policy written for them. If a compromised application tries to turn off SELinux this AVC will be generated. This is a serious issue. Your system may very well be compromised.
as: SELinux এ $SOURCE ক /selinux ৰ অন্তৰ্গত এটা নথিপত্ৰ লিখাৰ পৰা প্ৰতিৰোধ কৰিছে। /selinux ৰ অন্তৰ্গত নথিপত্ৰসমূহে SELinux সংৰূপণ কৰাৰ পদ্ধতি নিয়ন্ত্ৰণ কৰে। সকলো প্ৰগ্ৰাম যি /selinux ৰ অন্তৰ্গত নথিপত্ৰসমূহ লিখিব লাগিব সিহতৰ বাবে এটা নীতি লিখা থাকিব লাগিব। যদি এটা ভুল অনুপ্ৰয়োগে SELinux বন্ধ কৰাৰ চেষ্টা কৰে এই AVC সৃজন কৰা হব। ই এটা গুৰতৰ সমস্যা। আপোনাৰ চিস্টেমত বাল সাল সলনি হব পাৰে।
es: SELinux le ha negado a $SOURCE la escritura en un archivo bajo /selinux. Los archivos en /selinux controlan la forma en que se configura SELinux. Todos los programas que necesiten escribir en /selinux ya deberían tener alguna política escrita para las mismas. Si una aplicación comprometida intenta desactivar SElinux, este AVC será generado. Este es un problema serio. Su sistema puede estar comprometido.
gu: SELinux એ /selinux ની હેઠળ ફાઇલને લખવા માંથી SOURCE ને અટકાવેલ છે. /selinux ની હેઠળ ફાઇલો SELinux નું નિયંત્રણ કરે છે તે રૂપરેખાંકિત થયેલ છે. બધા કાર્યક્રમો કે જે તેઓ માટે પહેલેથી જ પોલિસી લખાયેલ હોવી જોઇએ તે /selinux હેઠળ ફાઇલોને લખવાની જરૂર છે જો સમજૂતી થયેલ કાર્યક્રમ આ AVC ઉત્પન્ન થશે તે SELinux ને બંધ કરવા માટે પ્રયત્ન કરે છે આ ગંભીર સમસ્યા છે. તમારી સિસ્ટમ સારી રીતે સમાધાન થયેલ હોઇ શકે છે.
ja: SELinux は $SOURCE による /selinux 以下のファイルへの書き込みを阻止しました。 /selinux 下のファイルは SELinux が設定される方法を制御します。 /selinux 下にファイルを書き込む必要のある全てのプログラムはそれ自身用に すでにポリシーを 書かせておくべきでした。侵害されたアプリケーションが SELinux を閉じる 試みをすると この AVC が生成されるでしょう。これは重大な問題です。ご使用のシステムは 既に 侵害されている可能性があります。
kn: $SOURCE ಅನ್ನು /selinux ನ ಅಡಿಯಲ್ಲಿನ ಒಂದು ಕಡತಕ್ಕೆ ಬರೆಯದಂತೆ SELinux ತಡಿದಿದೆ. /selinux ನ ಅಡಿಯಲ್ಲಿನ ಕಡತಗಳು SELinux ಸಂರಚಿಗೊಂಡಿರುವ ರೀತಿಯಲ್ಲಿ ನಿಯಂತ್ರಿಸಲ್ಪಡುತ್ತದೆ. /selinux ಅಡಿಯಲ್ಲಿ ಬರೆಯಲು ಬಯಸುವ ಎಲ್ಲಾ ಪ್ರೊಗ್ರಾಮ್‌ಗಳಿಗೂ ಪಾಲಿಸಿಯನ್ನು ಈ ಮೊದಲೆ ಬರೆದಿರುವ ಅಗತ್ಯವಿರುತ್ತದೆ. ಎಲ್ಲಿಯಾದರೂ ರಾಜಿಮಾಡಿಕೊಳ್ಳಲಾದ ಒಂದು ಅನ್ವಯವು SELinux ಅನ್ನು ಆಫ್‌ ಮಾಡಲು ಪ್ರಯತ್ನಿಸಿದಲ್ಲಿ ಈ AVC ಯು ಕಾಣಿಸಿಕೊಳ್ಳುತ್ತದೆ. ಇದು ಒಂದು ಗಂಭೀರವಾದ ಸಮಸ್ಯೆಯಾಗದ್ದು. ನಿಮ್ಮ ಗಣಕವು ರಾಜಿ ಮಾಡಿಕೊಂಡಿರುವಂತೆ ತೋರುತ್ತಿದೆ.
or: SELinux $SOURCE କୁ /selinux ଅନ୍ତର୍ଗତରେ ଫାଇଲ ମଧ୍ଯରେ ଲେଖିବାରୁ ବାରଣ କରିଛି। /selinux ଅନ୍ତର୍ଗତରେ ଥିବା ଫାଇଲଗୁଡ଼ିକ SELinux ବିନ୍ୟାସିତ ହୋଇଥିବା ଉପାୟରେ ନିୟନ୍ତ୍ରଣ କରିଥାଏ। ସମସ୍ତ ପ୍ରଗ୍ରାମଗୁଡ଼ିକ ଯାହାକି /selinux ଅନ୍ତର୍ଗତରେ ଫାଇଲଗୁଡ଼ିକରେ ଲେଖିବା ଆବଶ୍ୟକ କରେ ସେଥିରେ ପୂର୍ବରୁ ନିତୀ ଲିଖିତ ଥିବା ଉଚିତ। ଯଦି ଗୋଟିଏ ହାରମାନିଥିବା ପ୍ରୟୋଗ SELinux କୁ ବନ୍ଦ କରିବାକୁ ଚେଷ୍ଟାକରେ ତେବେ ଏହି AVC ସୃଷ୍ଟି ହେବ। ଏହା ଏକ ଗୁରୁତର ସମସ୍ୟା ଅଟେ। ଆପଣଙ୍କର ତନ୍ତ୍ର ହୁଏତଃ ହାରମାନିବ।
te: SELinux అనునది $SOURCEను /selinux క్రిందని దస్త్రముకు వ్రాయుట నుండి నిరోధిస్తుంది. /selinux క్రిందని దస్త్రము SELinux ఆకృతీకరించబడే మార్గాన్ని నియత్రిస్తుంది. /selinux క్రిందని దస్త్రములకు వ్రాయవలసిన అవసరమువున్న అన్ని ప్రోగ్రాములు వాటి కొరకు వ్రాయబడి వున్న పాలసీ కలిగివుండాలి. రాజీపడిన అనువర్తనము SELinuxను ఆఫ్‌చేయుటకు ప్రయత్నిస్తే ఈ AVC వుద్భవించబడుతుంది. ఇది వొక తీవ్రమైన సమస్య. మీ సిస్టమ్ చాలాబాగా రాజీ పడవచ్చు.
uk: SELinux забороняє $SOURCE записувати у файл, розташований у каталозі /selinux. Файли у /selinux керують параметрами правилами SELinux. Всі програми, яким потрібен такий доступ, повинні мати власні правила. якщо скомпрометована програма намагається вимкнути правила, буде згенеровано AVC. Це є суттєвою проблемою та може бути ознакою того, що система була скомпрометована.
zh_tw: SELinux 已防止 $SOURCE 寫入 /selinux 下的檔案。 /selinux 下的檔案可控制 SELinux 的組態設定。 所有需要寫入 /selinux 下的檔案的應用程式都應有個為它們而編寫 的方針。若有個遭到入侵的應用程式嘗試關閉 SELinux 的話，此 AVC 便會產生。這是一項嚴重的問題。您的系統可能 已遭到入侵。

source: you believe $SOURCE_PATH tried to disable SELinux.
as: আপুনি ভাৱে $SOURCE_PATH এ SELinux অসামৰ্থবান কৰাৰ চেষ্টা কৰিছিল।
es: cree que $SOURCE_PATH ha intentado deshabilitar SELinux.
gu: તમે માનો છો કે $SOURCE_PATH એ SELinux ને નિષ્ક્રિય કરવાનો પ્રયત્ન કર્યો છે.
ja: $SOURCE_PATH が SELinux を無効にしようとしました。
kn: SELinux ಅನ್ನು ಅಶಕ್ತಗೊಳಿಸಲು $SOURCE_PATH ಪ್ರಯತ್ನಿಸುತ್ತಿದೆ ಎಂದು ನೀವು ನಂಬುತ್ತೀರಿ.
or: ଆପଣ ବିଶ୍ୱାସ କରନ୍ତି ଯେ $SOURCE_PATH SELinux କୁ ନିଷ୍କ୍ରିୟ କରିବା ପାଇଁ ଚେଷ୍ଟାକରିଛି।
te: మీరు $SOURCE_PATH అనునది SELinuxను అచేతనపరచుటకు ప్రయత్నించినదని మీరు అనుకొనుచున్నారా.
uk: ви вважаєте, що $SOURCE_PATH намагалася вимкнути SELinux.
zh_tw: 您認為 $SOURCE_PATH 嘗試了停用 SELinux。

source: you may be under attack by a hacker, since confined applications should never need this access.
as: আপুনি এজন হেকাৰ দ্বাৰা আক্ৰমণৰ সন্মুখিন হব পাৰে, যিহেতু গোপণ অনুপ্ৰয়োগসমূহৰ এই অভিগমৰ কেতিয়াও প্ৰয়োজন নহয়।
es: podría estar siendo víctima de un ataque, ya que las aplicaciones confinadas nunca deberían necesitar este acceso.
gu: તમને હેકર દ્દારા હુમલો થઇ શકે છે, જ્યાં સુધી મર્યાદિત કાર્યક્રમોને આ પ્રવેશની કદી જરૂર પડવી ન જોઇએ.
ja: ハッカーから攻撃されている可能性があります。特定アプリケーションはこのアクセスをすべきではないからです
kn: ನೀವು ಒಬ್ಬ ಹ್ಯಾಕರಿನಿಂದ ದಾಳಿಗೆ ಒಳಗಾಗಿದ್ದೀರಿ ಏಕೆಂದರೆ ನಿರ್ಬಂಧಿತ ಅನ್ವಯಗಳಿಗೆ ಎಂದಿಗೂ ಈ ನಿಲುಕಣೆಯ ಅಗತ್ಯವಿರುವುದಿಲ್ಲ.
or: ଆପଣ ହୁଏତଃ କୌଣସି ଅନାଧିକୃତ ଆକ୍ରମଣକାରୀଙ୍କ ଶିକାର ହୋଇଛନ୍ତି, ଯେହେତୁ ପ୍ରୟୋଗଗୁଡ଼ିକ ଏହି ଅଭିଗମ୍ୟତା କଦାପି ଆଶାକରିବା ଉଚିତ ନୁହଁ।
te: మీరు హాకర్ చేత దాడికి గురై వుండవచ్చును, యెంచేతంటే లోబడిన అనువర్తనములకు యెప్పుడూ యీ యాక్సెస్ అవసరములేదు.
uk: ймовірно, вас атакують зловмисники, оскільки програми, доступ яких обмежено, такий доступ не потрібен.
zh_tw: 您可能遭受駭客攻擊，因為受限制的應用程式應該永遠不需要這種存取動作。

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be a mislabeled. sshd is allowed to read content in /root/.ssh directory if it is labeled correctly.
as: SELinux এ $SOURCE অনুৰোধ কৰা অভিগম নাকচ কৰিলে। $TARGET_PATH ভুল দৰে লেবেল কৰা থাকিব পাৰে। sshd ক /root/.ssh ডাইৰেকটৰিত সমল লিখাৰ অনুমতি আছে যদি ইয়াক সঠিকভাৱে লেবেল কৰা হয়।
es: SELinux ha negado el acceso solicitado por $SOURCE. $TARGET_PATH puede ser un error de etiqueta. sshd tiene permitido leer los contenidos del directorio /root/.ssh si es que está correctamente etiquetado.
gu: SELinux એ $SOURCE દ્વારા અરજી થયેલ વપરાશની નામંજૂરી આપી. $TARGET_PATH એ ખોટી રીતે લેબલ થયેલ હોઈ શકે. sshd ને /root/.ssh ડિરેક્ટરીમાં સમાવિષ્ટને વાંચવા માટે પરવાનગી આપેલ છે જો તે યાગ્ય રીતે લેબલ થયેલ છે.
ja: SELinux は $SOURCE から要求されたアクセスを拒否しました。$TARGET_PATH が 間違えたラベルを付けている可能性があります。正しいラベルがあれば sshd は /root/.ssh ディレクトリの コンテンツを読み込むことができます。
kn: $SOURCE ಇಂದ ಮನವಿ ಸಲ್ಲಿಸಲಾದ ನಿಲುಕಣಾ ಮನವಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. $TARGET_PATH ಅನ್ನು ತಪ್ಪಾಗಿ ಲೇಬಲ್ ಮಾಡಿರಬಹುದು. sshd ಅನ್ನು ಸರಿಯಾಗಿ ಲೇಬಲ್ ಮಾಡಲಾಗಿದ್ದಲ್ಲಿ, /root/.ssh ಕೋಶದಿಂದ ಓದಲು ಅನುಮತಿ ಇರುತ್ತದೆ.
or: SELinux $SOURCE ଦ୍ୱାରା ଅନୁରୋଧ କରାଯାଇଥିବା ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଅଛି। $TARGET_PATH ହୁଏତଃ ଭୁଲ ନାମକରଣ ହୋଇଥାଇପାରେ। sshd କୁ /root/.ssh ଡିରେକ୍ଟୋରୀରେ ଥିବା ବିଷୟବସ୍ତୁଗୁଡ଼ିକୁ ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦିଆଯାଇଥାଏ ଯଦି ଏହା ସଠିକ ଭାବରେ ନାମକରଣ ହୋଇଥାଏ।
te: SELinux అనునది $SOURCE ద్వారా అభ్యర్ధించిన యాక్సెస్‌ను తిరస్కరించెను. $TARGET_PATH బహుశా తప్పుదోవ పట్టించునది కావచ్చును. /root/.ssh డైరెక్టరీ సరిగా లేబుల్ చేసివుంటే sshd దాని లోని సారమును చదువుటకు అనుమతించబడును.
uk: SELinux запобігає доступу за запитом $SOURCE. Можливо, розмітка $TARGET_PATH некоректна. Якщо каталог /root/.ssh позначено правильно, SSHD дозволяється читати його вміст.
zh_tw: SELinux 拒絕來自於 $SOURCE 的存取請求。$TARGET_PATH 可能 標記錯誤。若是 sshd 有被正確標記的話，它便可 讀取 /root/.ssh 目錄中的內容。

source: Restore Context
as: পৰিপ্ৰেক্ষতিত পুনৰুদ্ধাৰ কৰক
es: Restaurar Contexto
gu: સંદર્ભને પુન:સંગ્રહો
ja: コンテキストの復元
kn: ಸನ್ನಿವೇಶವನ್ನು ಮರಳಿ ಸ್ಥಾಪಿಸು
or: ପ୍ରସଙ୍ଗକୁ ପୁନସ୍ଥାପନ କରନ୍ତୁ
te: సందర్భమును తిరిగివుంచుము
uk: Відновити контекст
zh_tw: 復原情境

source: SELinux is preventing $SOURCE_PATH "$ACCESS" to $TARGET_PATH.
as: SELinux এ $TARGET_PATH লে $SOURCE_PATH "$ACCESS" অভিগম প্ৰতিৰোধ কৰি আছে।
es: SELinux le está negando a $SOURCE_PATH el acceso "$ACCESS" a $TARGET_PATH.
gu: SELinux એ $SOURCE_PATH "$ACCESS" ને $TARGET_PATH થી અટકાવી રહ્યું છે.
ja: SELinux は $TARGET_PATH への $SOURCE_PATH による "$ACCESS" を阻止しています。
kn: $SOURCE_PATH "$ACCESS" ಅನ್ನು $TARGET_PATH ಗೆ SELinux ತಡೆದಿದೆ.
or: SELinux $SOURCE_PATH "$ACCESS" କୁ $TARGET_PATH କୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH "$ACCESS" ను $TARGET_PATH కు నిరోధిస్తోంది.
uk: SELinux забороняє $SOURCE_PATH доступ «$ACCESS» до $TARGET_PATH.
zh_tw: SELinux 防止 $SOURCE_PATH「$ACCESS」存取 $TARGET_PATH。

source: SELinux denied $SOURCE access to $TARGET_PATH. If this is a swapfile it has to have a file context label of swapfile_t. If you did not intend to use $TARGET_PATH as a swapfile it probably indicates a bug, however it could also signal a intrusion attempt.
as: SELinux এ $TARGET_PATH লে $SOURCE অভিগম নাকচ কৰিছে। যদি ই এটা স্বাপনথিপত্ৰ হয় ইয়াৰ এটা swapfile_t নথিপত্ৰ পৰিপ্ৰেক্ষতিত লেবেল থাকিব লাগিব। যদি আপুনি $TARGET_PATH ক এটা স্বাপনথিপত্ৰ হিচাপে ব্যৱহাৰ কৰিব নিবিচাৰে ই এটা বাগৰ ইংগিত দিয়ে, যি কি নহওক ই এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে।
es: SELinux negó a $SOURCE el acceso a $TARGET_PATH. Si este es un archivo swap, se debe cambiar a la etiqueta de contexto de archivo swapfile_t. Si no intenta usar $TARGET_PATH como un archivo swap, probablemente sea un error, sin embargo, también puede estar señalando un intento de ataque.
gu: SELinux એ $TARGET_PATH નો $SOURCE વપરાશ નામંજૂર કર્યો. જો આ સ્વેપફાઈલ હોય તો તેને swapfile_t નું ફાઈલ સંદર્ભ લેબલ હોવું જોઈએ. જો તમે $TARGET_PATH ને સ્વેપફાઈલ તરીકે વાપરવાનો હેતુ નહિં રાખ્યો હોય તો એ કદાચ ભૂલ સૂચવી શકે છે, છતાં તે ઘૂંસણખોરી પ્રવેશનો સંકેત પણ સૂચવી શક્યું હોત.
ja: SELinux は $TARGET_PATH への $SOURCE のアクセスを拒否しました。 これがスワップファイルならば、swapfile_t のファイルコンテキストラベルを 持っている必要があります。$TARGET_PATH をスワップファイルとして 使用する意図でなかった場合は、これは多分バグか、又は不正侵入の 試みの 形跡の可能性があります。
kn: $SOURCE ಗೆ $TARGET_PATH ಅನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ SELinux ನಿರಾಕರಿಸಿದೆ. ಎಲ್ಲಿಯಾದರೂ ಇದು ಒಂದು ಸ್ವಾಪ್ ಕಡತವಾಗಿದ್ದರೆ ಇದರ ಕಡತ ಸನ್ನಿವೇಶ ಲೇಬಲ್ swapfile_t ಆಗಿರಬೇಕು. ನೀವು $TARGET_PATH ಅನ್ನು ಒಂದು ಸ್ವಾಪ್‍ಕಡತವಾಗಿ ಬಳಸಲು ಇಚ್ಚಿಸದೆ ಹೋಗಿದ್ದಲ್ಲಿ ಇದು ಒಂದು ದೋಷವಾಗಿರಬಹುದು, ಅಥವ ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕೆಯ ಪ್ರಯತ್ನದ ಸೂಚನೆಯೂ ಆಗಿರಬಹುದು.
or: SELinux $SOURCE କୁ $TARGET_PATH ରେ ଅଭିଗମ୍ୟ କରିବାକୁ ବାରଣ କରିଥାଏ। ଯଦି ଏହା ଗୋଟିଏ swapfile ତେବେ ଏଥିରେ swapfile_t ର ଗୋଟିଏ ଫାଇଲ ପ୍ରସଙ୍ଗ ନାମପଟି ଥିବା ଉଚିତ। ଯଦି ଆପଣ $TARGET_PATH କୁ swapfile ଭାବରେ ବ୍ୟବହାର କରିବାକୁ ଚାହୁଁନାହାନ୍ତି, ତେବେ ଏହା ଏକ ତ୍ରୁଟି ଦର୍ଶାଇଥାଏ, ଏବଂ ଏହା ମଧ୍ଯ ଗୋଟିଏ ବିନାଅନୁମତିରେ ପ୍ରବେଶ ପାଇଁ ଚେଷ୍ଟାକରିପାରେ।
te: SELinux అనునది $SOURCE యాక్సెస్‌ను $TARGET_PATHకు తిరస్కరించింది. ఇది స్వాప్‌ఫైలు అయితే అది ఫైలు సందర్భలేబుల్ swapfile_t కలిగివుండాలి. మీరు $TARGET_PATHను స్వాప్‌ఫైలులా వుపయోగించాలి అనుకోకపోతే బహుశా అది బగ్‌ను సూచిస్తుంది, యేమైనప్పటికి ఇదికూడా అమర్యాద దాడిని సూచిస్తోంది.
uk: SELinux заборонила $SOURCE доступ до $TARGET_PATH. Якщо це файл підкачки, то він повинен мати метку swapfile_t. Якщо ви не збирались використовувати $TARGET_PATH як файл підкачки, можливо це помилка або спроба вторгнення.
zh_tw: SELinux 拒絕 $SOURCE 存取 $TARGET_PATH。 若這是個 swapfile 的話，它必須要含有一個標記為 swapfile_t 的 檔案情境。若您並未嘗試使用 $TARGET_PATH 來作為一個 swapfile，這可能顯示有臭蟲，不過這同時也可能 代表系統已遭到嘗試入侵的警訊。

source: You can alter the file context by executing chcon -t swapfile_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
as: আপুনি chcon -t swapfile_t '$TARGET_PATH' এক্সিকিউট কৰি নথিপত্ৰ পৰিপ্ৰেক্ষতিত সলনি কৰিব পাৰিব আপুনি লগতে চিস্টেমত অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহ সলনি কৰিব লাগিব যাতে সিহতক এটা সম্পূৰ্ণ পুনৰলেবেলত সংৰক্ষণ কৰিব পাৰি। "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
es: Puede cambiar el contexto de archivo ejecutando chcon -t swapfile_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
gu: તમે chcon -t swapfile_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઈલોને પણ સંપૂર્ણ પુન:લેબલ પર તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર બદલવી જ પડશે "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'" ATH'"
ja: chcon -t swapfile_t '$TARGET_PATH' を実行すると、ファイルコンテキストを 変更することができます。 また、完全な再ラベルの後でもそれらを保持するために、システム上でデフォルトの ファイルコンテキストファイルも変更しなければなりません。"semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
kn: chcon -t swapfile_t '$TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ ಕಡತದ ಸನ್ನಿವೇಶವನ್ನು ಬದಲಾಯಿಸಬಹುದು ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
or: ଆପଣ chcon -t swapfile_t '$TARGET_PATH' କୁ ନିଷ୍ପାଦନ କରି ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ବଦଳାଇପାରିବେ ସେମାନଙ୍କୁ ସମ୍ପୂର୍ଣ୍ଣ ପୁନଃ ନାମକରଣରେ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ଆପଣ ମଧ୍ଯ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ଫାଇଲକୁ ତନ୍ତ୍ରରେ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
te: మీరు ఫైలు సందర్భమును chcon -t swapfile_t '$TARGET_PATH' నిర్వర్తించుటద్వారా మార్చగలరు పూర్తి రిలేబుల్‌నందుకూడా మీరువాటిని నిల్వవుంచుటకు సిస్టమ్‌నందు ఫైళ్ళయొక్క అప్రమేయ ఫైలుసందర్భాలనుకూడా మీరు తప్పకమార్చాలి. "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
uk: Файловий контекст можна змінити, виконавши «сhcon -t swapfile_t '$TARGET_PATH'» Також треба змінити типові контексти файлів у системі, щоб вони зберігались навіть при повторній розмітці. «semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'»
zh_tw: 您可透過執行 chcon -t swapfile_t '$TARGET_PATH' 來修改檔案情境 您也必須更改系統上的預設檔案情境檔，才能在完整標記的情況下將它們保留住。「semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'」

source: you do not believe your $SOURCE_PATH should be modifying the kernel, by loading kernel modules
as: আপুনি নাভাৱে আপোনাৰ $SOURCE_PATH এ কাৰনেল সলনি কৰি আছে, কাৰনেল মডিউলসমূহ ল'ড কৰি
es: no cree que su $SOURCE_PATH deba ser modificado por el kernel, cargando los módulos del kernel.
gu: તમે માનતા નથી કે તમારુ $SOURCE_PATH એ કર્નલને બદલવુ જોઇએ, કર્નલ મોડ્યુલોને લોડ કરવા દ્દારા
ja: $SOURCE_PATH は kernel module をロードし、kernel を編集すべきではありません。
kn: ನಿಮ್ಮ $SOURCE_PATH ಎನ್ನುವುದು ಕರ್ನಲ್‌ ಘಟಕಗಳನ್ನು ಲೋಡ್ ಮಾಡುವ ಮೂಲಕ ಕರ್ನಲ್ ಅನ್ನು ಮಾರ್ಪಡಿಸುತ್ತಿದೆ ಎಂದು ನಿಮಗನ್ನಿಸುವುದಿಲ್ಲ
or: ଆପଣ ନିଜର $SOURCE_PATH କର୍ଣ୍ଣଲକୁ ପରିବର୍ତ୍ତନ କରୁଥିବ ବୋଲି ଆପଣ ବିଶ୍ୱାସ କରନ୍ତି ନାହିଁ, କର୍ଣ୍ଣଲ ଏକକାଂଶଗୁଡ଼ିକୁ ଧାରଣ କରିବା ଦ୍ୱାରା
te: మీ $SOURCE_PATH అనునది కెర్నల్‌ను సవరించాలి అనునది మీరు నమ్మరు, కెర్నల్ మాడ్యూళ్ళను లోడ్ చేయుట ద్వారా
uk: ви вважаєте, що ваш $SOURCE_PATH не має намагатися змінити ядро завантаженням модулів ядра
zh_tw: 您不認為您的 $SOURCE_PATH 應藉由載入 kernel 模組，修改 kernel

source: You might have been hacked.
as: আপোনাক হয়তো হেক কৰা হৈছে।
es: Podría haber sido atacado.
gu: તમે કદાચ હેક થઇ ગયા છો.
ja: あなたはハッキングされているかもしれません。
kn: ನಿಮ್ಮನ್ನು ಹ್ಯಾಕ್ ಮಾಡಲಾಗಿರಬಹುದು.
or: ଆପଣଙ୍କୁ ହୁଏତଃ ହ୍ୟାକ କରାଯାଇଛି।
te: మీరు హాక్ చేయబడివుండవచ్చును.
uk: Ймовірно, у вашу систему було здійснено несанкціоноване втручання.
zh_tw: 您可能已經被駭。
