Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: SELinux is preventing $SOURCE from creating a file with a context of $SOURCE_TYPE on a filesystem. Usually this happens when you ask the cp command to maintain the context of a file when copying between file systems, "cp -a" for example. Not all file contexts should be maintained between the file systems. For example, a read-only file type like iso9660_t should not be placed on a r/w system. "cp -p" might be a better solution, as this will adopt the default file context for the destination.
as: SELinux এ $SOURCE ক এটা নথিপত্ৰপ্ৰণালীত $SOURCE_TYPE ৰ পৰিপ্ৰেক্ষতিতৰ সৈতে এটা নথিপত্ৰ সৃষ্টি কৰাৰ পৰা প্ৰতিৰোধ কৰি আছে। সাধাৰণত এনেকুৱা হয় যেতিয়া আপুনি cp কমান্ডক এটা নথিপত্ৰৰ পৰিপ্ৰেক্ষতিত ব্যৱস্থাপনা কৰিবলে কয় নথিপত্ৰ প্ৰণালীসমূহৰ মাজত কপি কৰি থাকোতে, "cp -a" উদাহৰণস্বৰূপ। নথিপত্ৰ প্ৰণালীসমূহৰ মাজত সকলো নথিপত্ৰ পৰিপ্ৰেক্ষতিত ব্যৱস্থাপনা নকৰিলেও হব। উদাহৰণস্বৰূপ, এটা কেৱল পঢ়িব-পৰা নথিপত্ৰ ধৰণ যেনে iso9660_t ক এটা r/w চিস্টেমত স্থাপনা কৰিব নালাগিব। "cp -p" এটা ভাল সমাধান হব পাৰে, যিহেতু ই গন্তব্যৰ বাবে অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত ব্যৱহাৰ কৰিব।
es: SELinux está previniendo acerca de la intención de $SOURCE de crear un archivo con el contexto $SOURCE_TYPE en un sistema de archivo. Normalmente esto pasa cuando se le pide al comando cp que mantenga el contexto de un archivo cuando copia de un sistema de archivo a otro. Por ejemplo "cp -a". No todos los contextos de archivo se deben mantener entre sistemas de archivo. Por ejemplo, un tipo de archivo sólo lectura como el iso9660_t no debe ser puesto en un sistema de l/e. "cp -p" puede ser una mejor solución, dado que adoptará el contexto de archivo por defecto en el destino.
gu: SELinux એ $SOURCE ને ફાઈલસિસ્ટમ પર $SOURCE_TYPE ના સંદર્ભ સાથે ફાઈલ બનાવવાથી અટકાવી રહ્યું છે. સામાન્ય રીતે આ થાય છે જો તમે cp આદેશને ફાઈલનો સંદર્ભ જાળવવા માટે કહો જ્યારે ફાઈલ સિસ્ટમો વચ્ચે ફાઈલોની નકલ કરી રહ્યા હોય. ઉદાહરણ તરીકે "cp -a". ફાઈલ સિસ્ટમો વચ્ચે બધા ફાઈલ સંદર્ભ જળવાવા જોઈએ નહિં. ઉદાહરણ તરીકે iso9660_t જેવો માત્ર વાંચી શકાય તેવો ફાઈલ પ્રકાર r/w સિસ્ટમ પર મૂકવામાં આવવો જોઈએ. "cp -p" એ કદાચ વધુ સારો ઉકેલ હોઈ શકે, કારણ કે આ અંતિમ મુકામ માટે મૂળભૂત ફાઈલ સંદર્ભ સ્વીકારી લેશે.
ja: SELinux は $SOURCE がファイルシステム上で $SOURCE_TYPE のコンテキストを持つファイルを作成することを阻止しています。 通常、これは、例えば、"cp -a" のようにファイルシステム間でコピーしている時に、 cp コマンドにファイルのコンテキストを維持するように依頼する時に起こります。全てのファイルコンテキストがファイルシステム間で維持されるべきではありません。 例えば、iso9660_t のような読み込み専用のファイルタイプは r/w システム上に置くべきではありません。 cp -p はその目的地用にデフォルトのファイルコンテキストを採択するため、この方がより良いソリューションと 言えます
kn: $SOURCE ಒಂದು ಕಡತವ್ಯವಸ್ಥೆಯಲ್ಲಿ $SOURCE_TYPE ಯ ಒಂದು ಸನ್ನಿವೇಶದೊಂದಿಗೆ ಕಡತವನ್ನು ನಿರ್ಮಿಸುವುದನ್ನು SELinux ತಡೆದಿದೆ. ಸಾಮಾನ್ಯವಾಗಿ cp ಆಜ್ಞೆಯನ್ನು ನೀವು ಕಡತಗಳನ್ನು ಕಡತವ್ಯವಸ್ಥೆಗಳ ನಡುವೆ ನಕಲಿಸುವಂತೆ ಕೇಳಿದಾಗ ಕಡತದ ಸನ್ನಿವೇಶವು ಉಳಿಯುವಂತೆ ನೋಡಿಕೊಳ್ಳುತ್ತದೆ ಉದಾಹರಣೆಗೆ "cp -a". ಎಲ್ಲಾ ಕಡತ ಸನ್ನಿವೇಶಗಳು ಕಡತ ವ್ಯವಸ್ಥೆಗಳ ನಡುವೆ ನಕಲಿಸುವಾಗ ಉಳಿಯಬಾರದು ಉದಾಹರಣೆಗೆ, iso9660_t ನಂತಹ ಓದಲು ಮಾತ್ರ ಕಡತವು ಒಂದು r/w ವ್ಯವಸ್ಥೆಯಲ್ಲಿ ಇರಿಸಬೇಕು . "cp -p" ಯು ಒಂದು ಉತ್ತಮ ಪರಿಹಾರವಾಗಿರುತ್ತದೆ, ಏಕೆಂದರೆ ಇದು ಉದ್ದಿಷ್ಟ ಸ್ಥಳಕ್ಕೆ ಪೂರ್ವನಿಯೋಜಿತ ಕಡತ ಸನ್ನಿವೇಶವನ್ನು ಅನ್ವಯಿಸಿಕೊಳ್ಳುತ್ತದೆ.
or: SELinux $SOURCE କୁ ଫାଇଲତନ୍ତ୍ରରେ $SOURCE_TYPE ସହିତ ଫାଇଲ ନିର୍ମାଣ କରିବାରୁ ବାରଣ କରିଥାଏ। ସାଧାରଣତଃ ଏହା କାର୍ଯ୍ୟକାରୀ ହୋଇଥାଏ ଯେତେବେଳେ cp ନିର୍ଦ୍ଦେଶଟି ଗୋଟିଏ ଫାଇଲ ପରିଚାଳନା କରିବା ପାଇଁ ପଚାରିଥାଏ ଯେତେବେଳେ ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକ ମଧ୍ଯରେ ନକଲ କରିଥାଏ, ଉଦାହରଣ ସ୍ୱରୂପ "cp -a"। ସମସ୍ତ ଫାଇଲ ପ୍ରସଙ୍ଗଗୁଡ଼ିକୁ ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକ ମଧ୍ଯରେ ପରିଚାଳନା କରିବା ଉଚିତ ନୁହଁ। ଉଦାହରଣ ସ୍ୱରୂପ, ଗୋଟିଏ କେବଳ-ପଠନୀୟ ଫାଇଲ ପ୍ରକାର ଯେପରିକି iso9660_t କୁ r/w ତନ୍ତ୍ର ଉପରେ ରଖାଯିବା ଉଚିତ ନୁହଁ। "cp -p" ହୁଏତଃ ଗୋଟିଏ ଉତ୍ତମ ସମାଧାନ, ଯେହେତୁ ଏହା ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ଲକ୍ଷସ୍ଥଳ ପାଇଁ ଆପଣାଇଥାଏ।
te: ఫైలు వ్యవస్థనందు SELinux అనునది $SOURCEను $SOURCE_TYPE సందర్భంతో ఫైలును సృష్టించుటనుండి నిరోధిస్తుంది. సాదారణముగా యిది యెప్పుడు జరుగుతుందంటే మీరు ఫైలు వ్యవస్థనందు ఫైలును నకులు తీయుచున్నప్పుడు cp ఆదేశాన్ని ఫైలు సందర్భాన్ని నిర్వహించమన్నప్పుడు, "cp -a" ఉదాహరణకు. అన్ని ఫైలు సందర్భాలు ఫైలు సిస్టమ్స్‍ మధ్యన నిర్వహించబడవు. ఉదాహరణకు, చదువుటకు-మాత్రమే అనే ఫైలురకపు iso9660_tను r/w వ్యవస్ధనందు వుంచకూడదు. "cp -p" మంచి పరిష్కారం కాగలదు, అది అప్రమేయ ఫైలు సందర్భాన్ని గమ్యానికి యిస్తుంది.
uk: SELinux заборонила $SOURCE створювати файли з контекстом $SOURCE_TYPE у файловій системі. Звичайно це відбувається при використанні команди cp для збереження контексту файлу при копіюванні. Наприклад, «cp -a». Не всі файлові контексти повинні зберігатись між файловими системами. Наприклад, такий тип файлів лише для читання як iso9660_t не повинен використовуватись на системах, що допускають запис. Команда «cp -p» може бути більш добрим рішенням, оскільки вона адаптує файловий контекст у залежності від приймача.
zh_tw: SELinux 防止 $SOURCE 在檔案系上建立一個 context 為 $SOURCE_TYPE 的檔案。 通常當在檔案系統之間進行複製時 (比方說「cp -a」)，若您要求 cp 指令保留檔案的情境， 這便會發生。在檔案系統之間，並非所有檔案的情境 都必須被保留住。比方說，一個唯讀的檔案類型 (例如 iso9660_t) 不該被 設置在一個 r/w 的系統上。「cp -p」可能會是個較好的解決方案，因為這將會為目的地採用 預設的檔案情境。

source: Use a command like "cp -p" to preserve all permissions except SELinux context.
as: SELinux পৰিপ্ৰেক্ষতিতৰ বাহিৰে সকলো অনুমতি সংৰক্ষণ কৰিবলে "cp -p" ৰ নিচিনা এটা কমান্ড ব্যৱহাৰ কৰক।
es: Use un comando como "cp -p" para preservar todos los permisos excepto el contexto SELinux.
gu: SELinux સંદર્ભ સિવાયની બધી પરવાનગીઓ સાચવવા માટે "cp -p" જેવો આદેશ વાપરો.
ja: "cp -p" などのコマンドを使用して、SELinux コンテキスト以外の全ての権限を保存します。
kn: SELinux ಸನ್ನಿವೇಶವನ್ನು ಹೊರತುಪಡಿಸಿ ಎಲ್ಲಾ ಅನುಮತಿಗಳನ್ನು ಉಳಿಸಲು "cp -p" ಅನ್ನು ಬಳಸಿ.
or: SELinux ପ୍ରସଙ୍ଗ ପରିବର୍ତ୍ତେ ସମସ୍ତ ପ୍ରସଙ୍ଗକୁ ସଂରକ୍ଷଣ କରିବା ପାଇଁ "cp -p" ପରି ଏକ ନିର୍ଦ୍ଦେଶକୁ ବ୍ୟବହାର କରନ୍ତୁ।
te: SELinux సందర్బం మినహా అన్ని అనుమతులను నిల్వవుంచుటకు "cp -p" లాంటి ఆదేశం ఉపయోగించండి.
uk: Використовуйте команди, подібні до «cp -p», для збереження усіх прав доступу, окрім контексту SELinux.
zh_tw: 使用一項類似「cp -p」的指令來保留所有除 SELinux 情境以外的許可權設定。

source: you believe $SOURCE_BASE_PATH should be allowed to create $TARGET_BASE_PATH files
as: আপুনি ভাৱে $SOURCE_BASE_PATH ক $TARGET_BASE_PATH নথিপত্ৰসমূহ সৃষ্টি কৰাৰ অনুমতি থাকিব লাগে
es: cree que $SOURCE_BASE_PATH debería permitir crear archivos $TARGET_BASE_PATH
gu: તમે માનો છો કે $SOURCE_BASE_PATH એ $TARGET_BASE_PATH ને બનાવવા માટે પરવાનગી આપેલ હોવી જોઇએ
ja: $SOURCE_BASE_PATH は、 $TARGET_BASE_PATH ファイルを作成するために許可されているべきです。
kn: $TARGET_BASE_PATH ಕಡತಗಳನ್ನು ರಚಿಸಲು $SOURCE_BASE_PATH ಗೆ ಅನುಮತಿ ನೀಡಬೇಕು ಎಂದು ನೀವು ನಂಬುತ್ತೀರಿ
or: ଆପଣ ବିଶ୍ୱାସ କରୁଛନ୍ତି ଯେ $SOURCE_BASE_PATH $TARGET_BASE_PATH କୁ ନିର୍ମାଣ କରିବା ପାଇଁ ଅନୁମତି ଦେବା ଉଚିତ
te: మీరు $SOURCE_BASE_PATH అనునది $TARGET_BASE_PATH ఫైళ్ళను సృష్టించుటకు అనుమతించబడాలని నమ్ముతారా
uk: ви вважаєте, що $SOURCE_BASE_PATH має бути надано доступ до створення файлів $TARGET_BASE_PATH
zh_tw: 您認為 $SOURCE_BASE_PATH 應要能夠建立 $TARGET_BASE_PATH 檔案

source: you need to use a different command. You are not allowed to preserve the SELinux context on the target file system.
as: আপুনি এটা বেলেগ কমান্ড ব্যৱহাৰ কৰিব লাগিব। আপোনাক লক্ষ্য নথিপত্ৰপ্ৰণালীত SELinux পৰিপ্ৰেক্ষতিত সংৰক্ষণ কৰাৰ অনুমতি নাই।
es: necesita utilizar un comando diferente. No tiene permitido preservar el contexto SELinux en el sistema de archivos elegido.
gu: તમારે વિવિધ આદેશને વાપરવાની જરૂર છે. લક્ષ્ય ફાઇસ સિસ્ટમ પર SELinux સંદર્ભને સાચવવા માટે પરવાનગી આપેલ નથી.
ja: 別のコマンドを使用する必要があります。あなたはターゲットのファイルシステムで、SELinux コンテンツを保存することが許可されていません。
kn: ನೀವು ಬೇರೊಂದು ಆಜ್ಞೆಯನ್ನು ಬಳಸಬೇಕಾಗುತ್ತದೆ. ನಿರ್ದೇಶಿತ ವ್ಯವಸ್ಥೆಯಲ್ಲಿ SELinux ಸನ್ನಿವೇಶವನ್ನು ಕಾದಿರಿಸಲು ನಿಮಗೆ ಅನುಮತಿ ಇಲ್ಲ.
or: ଆପଣଙ୍କୁ ଭିନ୍ନ ଏକ ନିର୍ଦ୍ଦେଶ ବ୍ୟବହାର କରିବା ଆବଶ୍ୟକ। ଆପଣଙ୍କୁ SELinux ପ୍ରସଙ୍ଗକୁ ଲକ୍ଷ୍ଯସ୍ଥଳ ଫାଇଲ ତନ୍ତ୍ରରେ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ଅନୁମତି ନାହିଁ।
te: మీరు వేరే ఆదేశమును వుపయోగించాలి. లక్ష్యపు ఫైల్ సిస్టమ్ పైని SELinux సందర్భమును నిలిపివుంచుటకు మీరు అనుమతించబడరు.
uk: вам слід скористатися іншою командою. Ви не маєте прав доступу для збереження контексту SELinux у файловій системі призначення.
zh_tw: 您需要使用不同的指令。您不允許將 SELinux context 保留在目標檔案系統上。

source: use a command like "cp -p" to preserve all permissions except SELinux context.
as: SELinux পৰিপ্ৰেক্ষতিতৰ বাহিৰে সকলো অনুমতি সংৰক্ষণ কৰিবলে "cp -p" ৰ নিচিনা এটা কমান্ড ব্যৱহাৰ কৰক।
es: utilice un comando como "cp -p" para preservar todos los permisos excepto el contexto SELinux.
gu: SELinux સંદર્ભ સિવાયની બધી પરવાનગીઓ સાચવવા માટે "cp -p" જેવો આદેશ વાપરો.
ja: "cp -p" などのコマンドを使用して、SELinux コンテキスト以外の全ての権限を保存します。
kn: SELinux ಸನ್ನಿವೇಶವನ್ನು ಹೊರತುಪಡಿಸಿ ಎಲ್ಲಾ ಅನುಮತಿಗಳನ್ನು ಉಳಿಸಲು "cp -p" ಅನ್ನು ಬಳಸಿ.
or: SELinux ପ୍ରସଙ୍ଗ ପରିବର୍ତ୍ତେ ସମସ୍ତ ପ୍ରସଙ୍ଗକୁ ସଂରକ୍ଷଣ କରିବା ପାଇଁ "cp -p" ପରି ଏକ ନିର୍ଦ୍ଦେଶକୁ ବ୍ୟବହାର କରନ୍ତୁ।
uk: Використовуйте команди, подібні до «cp -p», для збереження усіх прав доступу, окрім контексту SELinux.
zh_tw: 使用像是「cp -p」的指令來保留完整許可權設定，但不包含 SELinux 情境。

source: SELinux is preventing the http daemon from sending mail.
as: SELinux এ http ডিমনক মেইল এক্সিকিউট কৰাৰ পৰা প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando al demonio http el envío de email.
gu: SELinux એ http ડિમનને મેઇલ મોકલવા અટકાવી રહ્યું છે
ja: SELinux は http デーモンによるメール送信を阻止しています。
kn: http ಡೆಮನ್ ಒಂದು ಮೈಲನ್ನು ಕಳುಹಿಸದಂತೆ SELinux ತಡೆದಿದೆ.
or: SELinux http ଡେମନକୁ ମେଲ ପଠାଇବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది http డెమోన్‌ను మెయిల్ పంపుట నుండి నిరోధిస్తుంది.
uk: SELinux запобігає надсиланню пошти службою http.
zh_tw: SELinux 防止 http 幕後程式傳送郵件。

source: SELinux has denied the http daemon from sending mail. An httpd script is trying to connect to a mail port or execute the sendmail command. If you did not setup httpd to sendmail, this could signal a intrusion attempt.
as: SELinux এ http ডিমনক মেইল পঠোৱাৰ পৰা নাকচ কৰিছে। এটা httpd লিপিয়ে এটা মেইল পোৰ্টলে সংযোগ কৰাৰ অথবা sendmail কমান্ড এক্সিকিউট কৰাৰ চেষ্টা কৰি আছে। যদি আপুনি httpd ক sendmail লে সংস্থাপন কৰা নাই, ই এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে।
es: SELinux ha negado al demonio http el envío de email. Un script de http está intentando conectar a un puerto de correo o ejecutar sendmail. Si no configuró al httpd para que use sendmail, esto puede ser señal de un intento de ataque.
gu: SELinux એ http ડિમનને મેઇલ મોકવાથી જોડાવાથી નામંજૂર કરેલ છે. httpd સ્ક્રિપ્ટ એ ડેટાબેઝ પોર્ટ સાથે જોડાવાનો પ્રયાસ કરી રહી છે. જો તમે સ્ક્રિપ્ટ મેઇલ પોર્ટ અથવા sendmail આદેશ નો ચલાવવવાની સાથે જોડાવા માટે પ્રયત્ન કરી રહ્યા છે. જો sendmail માં httpd ને સુયોજિત નહિં કરેલ હોય તો ય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.
ja: SELinux は http デーモンによるメール送信を拒否しました。 httpd スクリプトの１つがメールポートへの接続か、又は sendmail コマンドの実行を試行しています。 httpd に sendmail を設定していなかった場合、 不正侵入の試行を示している可能性があります。
kn: http ಡೆಮನ್ ಒಂದು ಮೈಲನ್ನು ಕಳುಹಿಸದಂತೆ SELinux ತಡೆದಿದೆ. ಒಂದು httpd ಸ್ಕ್ರಿಪ್ಟ್‍ ಒಂದು ಮೈಲ್ ಸಂಪರ್ಕಸ್ಥಾನಕ್ಕೆ ಸಂಪರ್ಕಹೊಂದದಂತೆ ಅಥವ sendmail ಆಜ್ಞೆಯನ್ನು ಚಲಾಯಿಸಲು ಪ್ರಯತ್ನಿಸುತ್ತಿದೆ. ನೀವು httpd ಯನ್ನು sendmail ಗಾಗಿ ಹೊಂದಿಸಿರದೆ ಹೋಗಿದ್ದಲ್ಲಿ, ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲ್ಪಡುತ್ತದೆ
or: SELinux ନିୟମ http ଡେମନକୁ ଗୋଟିଏ ସାର୍ବଜନୀନ ଡିରେକ୍ଟୋରିରେ ଲେଖିବାରୁ ଅଟକାଉଛି। ସାର୍ବଜନୀନ ଡିରେକ୍ଟୋରି ମାନଙ୍କରେ ଲେଖିବା ପାଇଁ http କୁ ବିନ୍ଯାସ କରାଯାଇ ନ ଥିଲେ, ଏହା ଅମାନ୍ଯ ପ୍ରଚେଷ୍ଟା କରିପାରେ।
te: SELinux అనునది http డెమోన్‌ను మెయిల్ పంపుట నుండి తిరస్కరిస్తుంది. ఒక httpd స్క్రిప్ట్‍ అనునది మెయిల్ పోర్టుకు అనుసంధానించుటకు లేదా sendmail ఆదేశమును నిర్వర్తించుటకు ప్రయత్నిస్తుంది. మీరు httpd sendmailకు అమర్చకపోతే, ఇది వొక అమర్యాద యత్నమును సూచిస్తుంది.
uk: SELinux заборонила надсилання пошти службою http. Сценарій http намагається приєднатися до поштового порту чи виконати команду sendmail. Якщо httpd не налаштовано на використання sendmail, це може слугувати ознакою спроби вторгнення.
zh_tw: SELinux 拒絕 http 幕後程式傳送郵件。某個 httpd 指令稿正嘗試連至一個郵件連接埠或執行 sendmail 指令。若您並未 將 httpd 設定來執行 sendmail 的話，這代表系統可能已遭到嘗試 入侵的警訊。

source: If you want httpd to send mail you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
as: যদি আপুনি httpd মেইল প্ৰেৰণ কৰাব বিচাৰে আপুনি $BOOLEAN boolean: "setsebool -P $BOOLEAN=1" অন কৰিব লাগিব
es: Si quiere que httpd pueda mandar correo, necesita poner en 1 el booleano $BOOLEAN: "setsebool -P $BOOLEAN=1"
gu: જો તમે મેઇલ મોકલવા માટે httpd ને ઇચ્છતા હોય તો તમારે $BOOLEAN boolean: "setsebool -P ની તરફ જવાની જરૂર છે $BOOLEAN=1"
ja: httpd にメール送信をさせる場合は、 $BOOLEAN ブーリアン をオンにする必要があります: "setsebool -P $BOOLEAN=1"
kn: httpd ಯು ಮೈಲ್ ಅನ್ನು ಕಳುಹಿಸುವುದನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಲು ನೀವು $BOOLEAN ಬೂಲಿಯನ್ ಅನ್ನು ಆನ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ: "setsebool -P $BOOLEAN=1"
or: ଯଦି ଆପଣ ଚାହୁଁଛନ୍ତି ଯେ httpd ତଥ୍ୟାଧାର ସହିତ ସଂଯୋଗ ପାଇଁ ଅନୁମତି ଦେଉ ତେବେ ଆପଣଙ୍କୁ $BOOLEAN ବୁଲିଆନକୁ ଅନ କରିବାକୁ ହେବ: "setsebool -P $BOOLEAN=1"
te: మీరు httpd అనునది మెయిల్ పంపాలని అనుకుంటే మీరు $BOOLEAN boolean: "setsebool -P $BOOLEAN=1" అన్ చేయవలసి వుంటుంది.
uk: Для дозволу надсилання пошти службою httpd встановіть значення $BOOLEAN: «setsebool -P $BOOLEAN=1»
zh_tw: 若您希望 httpd 傳送郵件，您需要開啟 $BOOLEAN 布林值：「setsebool -P $BOOLEAN=1」

source: you want to allow httpd to send mail
as: আপুনি httpd ক মেইল প্ৰেৰণৰ অনুমতি দিব বিচাৰে
es: quiere permitir que httpd envíe correos
gu: તમે મેઇલને મોકલવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: httpd が、メール送信することを、許可したい
kn: ಮೈಲ್ ಅನ್ನು ಕಳುಹಿಸಲು httpd ಗೆ ಅನುಮತಿಸಲು ನೀವು ಬಯಸುತ್ತೀರಿ
or: ଆପଣ ମେଲ ପଠାଇବା ପାଇଁ httpd କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି କି
te: మీరు httpd ను మెయిల్ పంపుటకు అనుమతించాలని అనుకొనుచున్నారా
uk: ви бажаєте дозволити httpd надсилати пошту
zh_tw: 您需要允許 httpd 以傳送郵件

source: you must setup SELinux to allow this
as: ইয়াৰ অনুমতি দিবলে আপুনি SELinux সংস্থাপন কৰিব লাগিব
es: debe configurar a SELinux para permitir esto.
gu: તમારે આને પરવાનગી આપવા માટે SELinux ને સુયોજિત કરવુ જ જોઇએ
ja: これを許可するには、SELinux を設定しなければいけません
kn: ಇದಕ್ಕೆ ಅನುಮತಿಸಲು ನೀವು SELinux ಅನ್ನು ಸಿದ್ಧಗೊಳಿಸಬೇಕು
or: ଆପଣ ଏହାକୁ ଅନୁମତି ଦେବା ପାଇଁ SELinux କୁ ସେଟ କରିବା ଉଚିତ
te: దీనిని అనుమతించుటకు మీరు SELinuxను అమర్చాలి
uk: вам слід налаштувати SELinux так, щоб було дозволено
zh_tw: 您必須設定 SELinux 以允許 httpd

source: SELinux prevented httpd $ACCESS access to http files.
as: SELinux http নথিপত্ৰসমূহলে httpd $ACCESS অভিগম প্ৰতিৰোধ কৰিলে।
es: SELinux le negó acceso httpd $ACCESS a archivos http.
gu: SELinux એ httpd $ACCESS વપરાશને http ફાઇલોથી અટકાવી રહ્યું છે.
ja: httpdの、 http ファイルへの $ACCESS アクセスを、SELinux は阻止しました。
kn: httpd ಯು $ACCESS ಅನ್ನು http ಕಡತಗಳನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ SELinux ನಿರ್ಬಂಧಿಸಿದೆ.
or: SELinux httpd କୁ http ଫାଇଲଗୁଡ଼ିକ ମଧ୍ଯକୁ $ACCESS ଅଭିଗମ୍ୟତା ପାଇଁ ବାରଣ କରିଥାଏ।
uk: SELinux забороняє httpd доступ $ACCESS до файлів httpd.
zh_tw: SELinux 防止 httpd $ACCESS 存取 http 檔案。

source: SELinux prevented httpd $ACCESS access to http files. Ordinarily httpd is allowed full access to all files labeled with http file context. This machine has a tightened security policy with the $BOOLEAN turned off, This requires explicit labeling of all files. If a file is a cgi script it needs to be labeled with httpd_TYPE_script_exec_t in order to be executed. If it is read only content, it needs to be labeled httpd_TYPE_content_t, it is writable content. it needs to be labeled httpd_TYPE_script_rw_t or httpd_TYPE_script_ra_t. You can use the chcon command to change these context. Please refer to the man page "man httpd_selinux" or <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" refers to one of "sys", "user" or "staff" or potentially other script types.
as: SELinux এ http নথিপত্ৰসমূহলে httpd $ACCESS অভিগম প্ৰতিৰোধ কৰিছে। সাধাৰণত httpd ক http নথিপত্ৰ পৰিপ্ৰেক্ষতিত লেবেল কৰা সকলে নথিপত্ৰলে সম্পূৰ্ণ অভিগমৰ অনুমতি দিয়া হয়। এই মেচিনৰ $BOOLEAN বন্ধ থকাকৈ এটা কঠিন সুৰক্ষা নীতি আছে, ইয়াৰ বাবে সকলো নথিপত্ৰৰ এক্সপ্লিচিট লেবেলিংৰ প্ৰয়োজন। যদি এটা নথিপত্ৰ এটা cgi লিপি ইয়াক httpd_TYPE_script_exec_t ৰ সৈতে লেবেল কৰিব লাগিব ইয়াক এক্সিকিউট কৰিবলে। যদি ই কেৱল পঢ়িব পৰা বিষয়বস্তু হয়, ইয়াক httpd_TYPE_content_t লেবেল কৰিব লাগিব, ই লিখিব পৰা বিষয়বস্তু। ইয়াক httpd_TYPE_script_rw_t or httpd_TYPE_script_ra_t লেবেল কৰিব লাগিব। আপুনি এই পৰিপ্ৰেক্ষতিত সলনি কৰিবলে chcon কমান্ড ব্যৱহাৰ কৰিব পাৰিব। অনুগ্ৰহ কৰি man পৃষ্ঠা "man httpd_selinux" অথবা <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> চাওক "TYPE" এ "sys" ৰ এটা বুজায়, "user" অথবা "staff" অথবা বিভৱীয় অন্য লিপি ধৰণসমূহ।
es: SELinux evitó que $ACCESS de httpd acceda a archivos http. Lo común es que a httpd se le garantice acceso completo a todos los archivos etiquetados con contexto de archivo http. Esta máquina tiene una política de seguridad muy estricta con $BOOLEAN deshabilitado. Esto necesita un etiquetado explícito de todos los archivos. Si un archivo es un script cgi necesita ser etiquetado con httpd_TYPE_script_exec_t para poder ser ejecutado. Si su contenido es de solo lectura, necesita ser reetiquetado como httpd_TYPE_content_t, si su contenido es de escritura, necesita ser reetiquetado como httpd_TYPE_script_rw_t o httpd_TYPE_script_ra_t. Puede utilizar el comando chcon para modificar este conexto. Por favor consulte la página man "man httpd_selinux" or <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" se o bien a "sys", "user" o "staff" o potencialmente otro tipo de script.
gu: SELinux એ http ફાઇલો માટે httpd $ACCESS પ્રવેશ અટકાવેલ છે. સામાન્ય રીતે httpd એ http ફાઇલ સંદર્ભ સાથે લેબલ થયેલ બધી ફાઇલોને સંપૂર્ણ પ્રવેશ માટે પરવાનગી આપેલ છે. આ મશીન પાસે બંધ થયેલ $BOOLEAN સાથે સજ્જડ સુરક્ષા પોલિસી છે સુરક્ષા પોલિસી છે, આને બધી ફાઇલોને ચોક્કસ લેબલ કરવાની જરૂર છે. જો ફાઇલ એ cgi સ્ક્રિપ્ટ છે ચલાવવા માટે ક્રમમાં httpd_TYPE_script_exec_t સાથે તેને લેબલ કરવાની જરૂર છે. જો તમે ફક્ત વાંચી શકાય તેવુ સમાવિષ્ટ હોય તો, તેને લેબલ httpd_TYPE_content_t કરવાની જરૂર છે, તે લખી શકાય તેવો સમાવિષ્ટ હોય તો. તેને લેબલ httpd_TYPE_script_rw_t અથવા httpd_TYPE_script_ra_t કરવાની જરૂર છે. તમે આ સંદર્ભને બદલવા માટે chcon આદેશને વાપરી શકો છો. મહેરબાની કરીને મુખ્ય પાનું "man httpd_selinux" અથવા <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> નો સંદર્ભ લો "TYPE" refers toi one of "sys", "user" અથવા "staff" નાં એક toi નો સંદર્ભ લે છે અથવા બીજા સ્ક્રિપ્ટ પ્રકારો.
ja: SELinux は httpd $ACCESS が http ファイルにアクセスすることを許可していません。 昔ながらの httpd は http ファイルコンテンツのラベルが付けられているファイルに フルアクセスが許可されています。このマシンはこの $BOOLEAN を無効にすることで、 セキュリティポリシーを制限しています。これより、全てのファイルのラベルを明確にする 必要があります。もしあるファイルがcgiスクリプトである場合、実行するにはそれに httpd_TYPE_script_exec_t とラベルする必要があります。もし読み取り専用コンテンツ の場合、それには httpd_TYPE_content_t を、書込み可能なコンテンツの場合、 それには httpd_TYPE_script_rw_t もしくは httpd_TYPE_script_ra_t とラベルします。 chcon コマンドを使って、これらのコンテキストを変更できます。 man page の "man httpd_selinux" または <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" で "sys" 、 "user" 、 "staff" または他のスクリプトタイプを 参照してください。
kn: httpd ಯು $ACCESS ಅನ್ನು http ಕಡತಗಳನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ SELinux ನಿರ್ಬಂಧಿಸಿದೆ. ಸಾಮಾನ್ಯವಾಗಿ httpd ಯು http ಕಡತ ಸನ್ನಿವೇಶ ಎಂದು ಗುರುತು ಹಾಕಲಾದ ಎಲ್ಲಾ ಕಡತಗಳಿಗೆ ಸಂಪೂರ್ಣ ಅನುಮತಿಯನ್ನು ಹೊಂದಿರುತ್ತದೆ. ಈ ಗಣಕವು $BOOLEAN ಅನ್ನು ಆಫ್ ಮಾಡುವುದರೊಂದಿಗೆ ಸುರಕ್ಷತಾ ನಿಯಮಗಳನ್ನು ಬಿಗಿಗೊಳಿಸಿದ್ದರಿಂದ, ಇದಕ್ಕೆ ಎಲ್ಲಾ ಕಡತಗಳನ್ನು ವಿಶಿಷ್ಟವಾಗಿ ಲೇಬಲ್‌ ಮಾಡುವುದು ಅಗತ್ಯವಾಗುತ್ತದೆ. ಎಲ್ಲಿಯಾದರೂ ಒಂದು ಕಡತವು cgi ಸ್ಕ್ರಿಪ್ಟ್‍ ಆಗಿದ್ದರೆ ಅದು ಕಾರ್ಯಗತಗೊಳ್ಳಬೇಕಿದ್ದರೆ ಅದನ್ನು httpd_TYPE_script_rw_t ನಿಂದ ಲೇಬಲ್ ಮಾಡುವ ಅಗತ್ಯವಿರುತ್ತದೆ ಅದು ಓದಲು-ಮಾತ್ರವಾದ ವಿಷಯವನ್ನು ಹೊಂದಿದ್ದರೆ, httpd_TYPE_content_t ಇಂದ ಲೇಬಲ್ ಮಾಡಲ್ಪಡಬೇಕು. ಅದು ಬರೆಯಬಲ್ಲ ವಿಷಯಗಳನ್ನು ಹೊಂದಿದ್ದಲ್ಲಿ, httpd_TYPE_script_rw_t ಅಥವ httpd_TYPE_script_ra_t ನಿಂದ ಲೇಬಲ್ ಮಾಡ ಬೇಕಾಗುತ್ತದೆ. ಈ ಸನ್ನಿವೇಶಗಳನ್ನು ಬದಲಾಯಿಸಲು chcon ಆಜ್ಞೆಯನ್ನು ಬಳಸಬಹುದು. ದಯವಿಟ್ಟು ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗಾಗಿ ಮ್ಯಾನ್‌ ಪೇಜ್‌ "man httpd_selinux" ಅನ್ನು ಅಥವ <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> ಅನ್ನು ನೋಡಿ "TYPE" ಎಂದರೆ "sys", "user" ಅಥವ "staff" ಅಥವ ಸಮರ್ಥವಾದ ಇತರೆ ಸ್ಕ್ರಿಪ್ಟ್‍ ಬಗೆಗಳನ್ನು ಸೂಚಿಸುತ್ತದೆ.
uk: SELinux запобігла спробі отримання доступу $ACCESS httpd до файлів http. За звичайних умов httpd має повний доступ до всіх файлів позначених міткою контексту http. У цій системі правила захисту розширено вимиканням параметра $BOOLEAN. Всі доступні файли має бути позначено явним чином. Якщо файл є скриптом cgi, його слід позначити міткою httpd_TYPE_script_exec_t, щоб його можна було виконувати. Якщо дані файла призначено лише для читання, файл слід позначити міткою httpd_TYPE_content_t. Якщо дані призначено для читання, слід встановити мітку httpd_TYPE_script_rw_t або httpd_TYPE_script_ra_t. Для зміни контекстів ви можете скористатися командою chcon. Будь ласка, зверніться до сторінки довідника (man) "man httpd_selinux" або <a href="http://docs.fedoraproject.org/uk-UA/Fedora/13/html/SELinux_FAQ/index.html">ЧаП</a> «TYPE» може мати значення «sys», «user» або «staff», а також типи скриптів.
zh_tw: SELinux 防止 httpd $ACCESS 存取 http 檔案。 原本來說 httpd 允許完全存取所有標有 http 檔案情境標籤 的檔案。這部機器已把 $BOOLEAN 關閉而有高度緊繃的安 全方針。這需要每個檔案都有明確標籤。如果有個檔案是 cgi 指令稿，則需要有 httpd_TYPE_script_exec_t 標籤才能被 執行。如果它是唯讀的內容，則需要有 httpd_TYPE_script_rw_t 或 httpd_TYPE_script_ra_t 標籤。您 可以使用 chcon 指令來更動這些情境。請參閱 man 頁面 「man httpd_selinux」或 <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> 「TYPE」指的是 "sys", "user" 或 "staff" 之一，或者可能是其他 指令稿類型。

source: Changing the "$BOOLEAN" boolean to true will allow this access: "setsebool -P $BOOLEAN=1"
as: "$BOOLEAN" বুলিয়ানক true লে সলনি কৰিলে এই অভিগমৰ অনুমতি পোৱা যাব: "setsebool -P $BOOLEAN=1"
es: Cambiando el valor "$BOOLEAN" a verdadero permitirá este acceso: "setsebool -P $BOOLEAN=1"
gu: "$BOOLEAN" બુલિયનને ખરુમાં બદલવાનું આ વપરાશની પરવાનગી આપશે: "setsebool -P $BOOLEAN=1"
ja: "$BOOLEAN"ブーリアン値を「true」に変更すると、このアクセスを許可します： "setsebool -P $BOOLEAN=1"
kn: "$BOOLEAN"ಬೂಲಿಯನ್ ಅನ್ನುನಿಜಕ್ಕೆ ಬದಲಾಯಿಸುವುದರಿಂದ ಈ ಅನುಮತಿ ನೀಡಲ್ಪಡುತ್ತದೆ: "setsebool -P $ಬೂಲಿಯನ್=1"
or: "$BOOLEAN" ବୁଲିଆନ ମୂଲ୍ଯକୁ true କରିଲେ, ଏହା ଏହି ଅଭିଗମକୁ ସ୍ବୀକାର କରିବ: "setsebool -P $BOOLEAN=1"
te: "$BOOLEAN" ను బూలియన్ నుండి నిజంకు మార్చుట ఈ వాడుకఅనుమతిని ఇస్తుంది: "setsebool -P $BOOLEAN=1"
uk: Встановлення логічного значення "$BOOLEAN" у TRUE дозволить доступ: "setsebool -P $BOOLEAN=1"
zh_tw: 將「$BOOLEAN」布林值更改為 true 將會允許此存取： 「setsebool -P $BOOLEAN=1」

source: you want to allow httpd to execute cgi scripts and to unify HTTPD handling of all content files.
as: আপুনি httpd ক cgi লিপিসমূহ এক্সিকিউট কৰাৰ অনুমতি দিব আৰু সকলো বিষয়বস্তু নথিপত্ৰৰ HTTPD নিয়ন্ত্ৰণ সংযুক্ত কৰিব বিচাৰে।
es: quiere permitir que httpd ejecute scripts cgi y que unifique manipulaciones HTTPD de todos los archivos de contenido.
gu: તમે બધી સમાવિષ્ટ ફાઇલોને HTTPD સંભાળવાનું એકરૂપ કરવા અને cgi સ્ક્રિપ્ટોને ચલાવવા માટે httpd ને પરવાનગી આપવા માંગો છો.
ja: httpdが、cgiスクリプトを実行し、全てのコンテンツファイルのHTTPDを管理することを、許可したい。
kn: httpd ಯು cgi ಸ್ಕ್ರಿಪ್ಟುಗಳನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವಂತೆ ಅನುಮತಿಸಲು ಹಾಗು ಎಲ್ಲಾ ವಿಷಯ ಕಡತಗಳ HTTPD ಅನ್ನು ನಿಭಾಯಿಸುವಿಕೆಯನ್ನು ಒಗ್ಗೂಡಿಸಲು ನೀವು ಬಯಸುತ್ತೀರಿ.
or: cgi ସ୍କ୍ରିପ୍ଟଗୁଡ଼ିକୁ ନିଷ୍ପାଦନ କରିବା ପାଇଁ ଆପଣ httpd କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି ଏବଂ ସମସ୍ତ ବିଷୟବସ୍ତୁ ଫାଇଲଗୁଡ଼ିକର HTTPD ନିୟନ୍ତ୍ରଣକୁ ଏକତ୍ର କରିଥାଏ।
te: మీరు httpd ను cgi స్క్రిప్టులను నిర్వర్తించుటకు మరియు అన్ని సారపు ఫైళ్ళ యొక్క HTTPD సంభాలనను సమీకృతం చేయుటకు అనుమతించాలని అనుకొనుచున్నారా.
uk: ви бажаєте дозволити httpd виконувати скрипти cgi і уніфікувати обробку HTTPD всіх файлів даних.
zh_tw: 您希望允許 httpd 以執行 cgi script，並統一所有內容檔案的 HTTPD 處理

source: you must tell SELinux about this by enabling the 'httpd_unified' and 'http_enable_cgi' booleans
as: আপুনি SELinux -ৰ ইয়াৰ বিষয়ে 'httpd_unified' আৰু 'http_enable_cgi' বুলিয়ানসমূহ সামৰ্থবান কৰি কব লাগিব
es: debe informarle esto a SELinux habilitando los booleanos 'httpd_unified' y 'http_enable_cgi'
gu: 'httpd_unified' અને 'http_enable_cgi' booleans બુલિયનને સક્રિય કરીને આના વિશે તમારે SELinux ને કહેવુ જ જોઇએ
ja: これについては、SELinux で 'httpd_unified' と 'http_enable_cgi' booleans を有効にしなければいけません
kn: 'httpd_unified' ಹಾಗು 'http_enable_cgi' ಬೂಲಿಯನ್‌ಗಳನ್ನು ಶಕ್ತಗೊಳಿಸುವ ಮೂಲಕ ನೀವು SELinux ಗೆ ಇದರ ಬಗ್ಗೆ ಹೇಳಬೇಕು
or: 'httpd_unified' ଏବଂ 'http_enable_cgi' ବୁଲିଆନଗୁଡ଼ିକୁ ସକ୍ରିୟ କରି ଆପଣଙ୍କୁ ନିଶ୍ଚିତ ଭାବରେ SELinux କୁ ଏହା ବିଷୟରେ କହିବା ଉଚିତ
te: 'httpd_unified' మరియు 'http_enable_cgi' బూలియన్సును చేతనపరచుట ద్వారా దీని గురించి మీరు SELinuxకు తెలుపవలెను
uk: вам слід повідомити про це SELinux встановленням значень true для параметрів «httpd_unified» і «http_enable_cgi»
zh_tw: 您必須啟用 'httpd_unified' 和 'http_enable_cgi' 布林值，以告知 SELinux 有關於此動作
