Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: SELinux policy is preventing an httpd script from writing to a public directory.
as: SELinux নীতিয়ে এটা httpd লিপিক এটা ৰাজহুৱা ডাইৰেকটৰিলে লিখাৰ পৰা প্ৰতিৰোধ কৰি আছে।
es: La política de SELinux está impidiendo a un script de http escribir a un directorio público.
gu: SELinux પોલિસી એ httpd સ્ક્રિપ્ટને જાહેર ડિરેક્ટરીમાં લખવાથી અટકાવી રહી છે.
ja: SELinux ポリシーは httpd スクリプトが公共ディレクトリーに書き込むのを阻止 しています。
kn: SELinux ಪಾಲಿಸಿಯು ಒಂದು http ಸ್ಕ್ರಿಪ್ಟ್‍ ಒಂದು ಸಾರ್ವಜನಿಕ ಕಡತಕೋಶಕ್ಕೆ ಬರೆಯದಂತೆ ತಡೆಯುತ್ತಿದೆ.
or: SELinux ନିୟମ ଗୋଟିଏ httpd ସ୍କ୍ରିପ୍ଟକୁ ଗୋଟିଏ ସାର୍ବଜନୀନ ଡିରେକ୍ଟୋରିରେ ଲେଖିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది httpd స్క్రిప్ట్‍‌ను పబ్లిక్ సంచయంకు వ్రాయుటనుండి నిరోధిస్తుంది విధానం.
uk: Правила SELinux запобігають спробам запису даних сценарієм httpd у спільну теку.
zh_tw: SELinux 方針防止 httpd 指令稿寫入公用的 目錄。

source: SELinux policy is preventing an httpd script from writing to a public directory. If httpd is not setup to write to public directories, this could signal an intrusion attempt.
as: SELinux নীতিয়ে এটা httpd লিপিক এটা ৰাজহুৱা ডাইৰেকটৰিলে লিখাৰ পৰা প্ৰতিৰোধ কৰি আছে। যদি httpd ক ৰাজহুৱা ডাইৰেকটৰিলে লিখাৰ বাবে সংহত কৰা হোৱা নাই, ই এটা অনাধিকাৰ প্ৰৱেশৰ চেষ্টা ইংগিত কৰিব পাৰে।
es: La política de SELinux está impidiendo a un script de http la escritura a un directorio público. Si no se configuró a http para que escriba a directorios públicos, esto puede indicar un posible ataque.
gu: SELinux પોલિસી એ httpd સ્ક્રિપ્ટને જાહેર ડિરેક્ટરીમાં લખવાથી અટકાવી રહી છે. જો httpd એ જાહેર ડિરેક્ટરીઓ લખવા માટે સુયોજિત થયેલ નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.
ja: SELinux ポリシーは httpd スクリプトが公共ディレクトリーに書き込むのを 阻止しています。httpd が公共ディレクトリーに書き込むように設定されていない場合は、 これは侵入の試みを示す可能性があります。
kn: SELinux ಪಾಲಿಸಿಯು ಒಂದು http ಸ್ಕ್ರಿಪ್ಟ್‍ ಒಂದು ಸಾರ್ವಜನಿಕ ಕಡತಕೋಶಕ್ಕೆ ಬರೆಯದಂತೆ ತಡೆಯುತ್ತಿದೆ. ಸಾರ್ವಜನಿಕ ಕಡತಕೋಶಗಳಿಗೆ ಬರೆಯಲು httpd ಯನ್ನು ಹೊಂದಿಸದೆ ಹೋದಲ್ಲಿ, ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲ್ಪಡುತ್ತದೆ.
or: SELinux ନିୟମ ଗୋଟିଏ httpd ସ୍କ୍ରିପ୍ଟକୁ ଏକ ସାର୍ବଜନୀନ ଡିରେକ୍ଟୋରିରେ ଲେଖିବାରୁ ଅଟକାଉଛି। ସାର୍ବଜନୀନ ଡିରେକ୍ଟୋରି ମାନଙ୍କରେ ଲେଖିବା ପାଇଁ httpd କୁ ବିନ୍ଯାସ କରାଯାଇ ନ ଥିଲେ,ଏହା ଅମାନ୍ଯ ପ୍ରଚେଷ୍ଟା କରିପାରେ।
te: SELinux విధానం అనునది httpd స్క్రిప్ట్‍‌ను పబ్లిక్ సంచయంకు వ్రాయుటనుండి నిరోధిస్తుంది. ఒకవేళ httpd అనునది పబ్లిక్ సంచయాలను వ్రాయుటకు అమర్చక పోతే, ఇది అమర్యాద యత్నమును సూచిస్తుంది.
uk: Правила SELinux запобігають спробам запису даних у спільну теку сценарієм httpd. Якщо httpd не налаштовано на запис у спільні теки, подібні спроби можуть бути ознакою спроби вторгнення.
zh_tw: SELinux 方針防止 httpd 指令稿寫入公用的 目錄中。若 httpd 並未被設置可寫入公用目錄的話，這 代表系統可能已遭到嘗試入侵的警訊。

source: If httpd scripts should be allowed to write to public directories you need to turn on the $BOOLEAN boolean and change the file context of the public directory to public_content_rw_t. Read the httpd_selinux man page for further information: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" You must also change the default file context labeling files on the system in order to preserve public directory labeling even on a full relabel. "semanage fcontext -a -t public_content_rw_t <path>"
as: যদি httpd স্ক্ৰিপ্টসমূহক ৰাজহুৱা ডাইৰেকটৰিসমূহলে লিখাৰ অনুমতি দিব লাগে আপুনি $BOOLEAN বুলিয়ান অন কৰিব লাগিব আৰু ৰাজহুৱা ডাইৰেকটৰিৰ নথিপত্ৰ পৰিপ্ৰেক্ষতিতক public_content_rw_t লে সলনি কৰিব লাগিব। অধিক তথ্যৰ বাবে httpd_selinux man পৃষ্ঠা পঢ়ক: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" এটা সম্পূৰ্ণ পুনৰলেবেলত ৰাজহুৱা ডাইৰেকটৰি সংৰক্ষণ কৰিবলে আপুনি চিস্টেমত অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত লেবেল থকা নথিপত্ৰসমূহ সলনি কৰিব লাগিব। "semanage fcontext -a -t public_content_rw_t <path>"
zh_tw: 如果該允許 httpd 指令稿寫入公用目錄，您需要開啟 $BOOLEAN 布林值，並將公共目錄的檔案情境變更為 public_content_rw_t。請閱讀 httpd_selinux man 頁面以瞭解更多資訊： 「setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>」 您必須也變更系統上的預設檔案情境標籤檔，這樣才能連完整重新標記的情況下也能留住公共目錄標籤。「semanage fcontext -a -t public_content_rw_t <path>」

source: you want to allow $SOURCE_PATH to be able to write to shared public content
as: আপুনি $SOURCE_PATH ক অংশীদাৰী ৰাজহুৱা বিষয়বস্তুলে লিখাৰ অনুমতি দিব বিচাৰে
es: desea permitir que $SOURCE_PATH pueda escribir sobre contenidos públicos compartidos
gu: તમે વહેંચાયેલ સાર્વજનિક સમાવિષ્ટને લખવા $SOURCE_PATH ને પરવાનગી આપવા માંગો છો
ja: $SOURCE_PATH が、共有パブリックコンテンツに書込み可能になることを、許可したい
kn: ಹಂಚಲಾದ ಸಾರ್ವಜನಿಕ ವಿಷಯಕ್ಕೆ $SOURCE_PATH ಬರೆಯಲು ಅನುಮತಿಸಬೇಕೆಂದರೆ
or: ଆପଣ $SOURCE_PATH କୁ ସହଭାଗୀ ସର୍ବସାଧାରଣ ବିଷୟବସ୍ତୁକୁ ଲେଖିବା ପାଇଁ ସକ୍ଷମ କରିବାକୁ ଅନୁମତି ଦିଅନ୍ତୁ
te: భాగస్వామ్య పబ్లిక్ సారములోనికి వ్రాయబడుటకు మీరు $SOURCE_PATH ను అనుమతించాలని కోరుకొనుచున్నారా
uk: ви бажаєте дозволити $SOURCE_PATH запис до теки спільних відкритих даних
zh_tw: 您需要允許 $SOURCE_PATH 寫入共享的公用內容。

source: you need to change the label on $TARGET_PATH to public_content_rw_t, and potentially turn on the allow_httpd_sys_script_anon_write boolean.
as: আপুনি $TARGET_PATH ত লেবেলক public_content_rw_t লে সলনি কৰিব, আৰু বিভৱীয়ভাৱে allow_httpd_sys_script_anon_write বুলিয়ান অন কৰিব লাগিব।
es: necesita modificar la etiqueta de $TARGET_PATH a public_content_rw_t, y tal vez necesite encender el booleano allow_httpd_sys_script_anon_write.
gu: તમારે public_content_rw_t માટે $TARGET_PATH પર લેબલને બદલવાની જરૂર પડશે, અને allow_httpd_sys_script_anon_write બુલિયનને ચાલુ કરો.
ja: $TARGET_PATH のラベルを public_content_rw_t に変更する必要があります。また、 allow_httpd_sys_script_anon_write boolean を同時に有効にする必要があります。
kn: $TARGET_PATH ನಲ್ಲಿನ ಲೇಬಲ್ ಅನ್ನು public_content_rw_t ಗೆ ಬದಲಾಯಿಸಬೇಕು, ಹಾಗು allow_httpd_sys_script_anon_write ಬೂಲಿಯನ್ ಅನ್ನು ಆನ್ ಮಾಡಬೇಕು.
or: ଏକା ପ୍ରକାର ଉପକରଣ ପାଇଁ ଆପଣଙ୍କୁ $TARGET_PATH ଉପରେ ନାମପଟିକୁ public_content_rw_t ନାମରେ ପରିବର୍ତ୍ତନ କରିବାକୁ ହେବ, ଏବଂ allow_httpd_sys_script_anon_write ବୁଲିଆନକୁ ଅନ କରିବାକୁ ହେବ।
te: మీరు $TARGET_PATH పైని లేబుల్‌ను public_content_rw_t కు మార్చవలసి వుంటుంది, మరియు selinux allow_httpd_sys_script_anon_write బూలియన్‌ను ఆన్ చేయవలసి వుంటుంది.
uk: вам слід змінити мітку $TARGET_PATH на public_content_rw_t і потенційно надати значення true allow_httpd_sys_script_anon_write boolean.
zh_tw: 您需要將 $TARGET_PATH 上的標籤更改為 public_content_rw_t，並開啟 allow_httpd_sys_script_anon_write 布林值。

source: SELinux is preventing $SOURCE_PATH from changing the access protection of memory on the heap.
as: SELinux এ $SOURCE_PATH ক হিপত মেমৰিৰ অভিগম সুৰক্ষা সলনি কৰাৰ পৰা প্ৰতিৰোধ কৰি আছে।
es: SELinux está impidiendo a $SOURCE_PATH cambiar la protección de acceso de la memoria dinámica.
gu: SELinux એ $SOURCE_PATH ને હીપ પરથી મેમરીના વપરાશની સુરક્ષામાંથી અટકાવી રહ્યું છે.
ja: SELinux は $SOURCE_PATH が ヒープ上のメモリーへのアクセス保護を 変更することを阻止しています。
kn: $SOURCE_PATH ಅನ್ನು ಒಟ್ಟಿಗೆ ಮೆಮೊರಿಯ ನಿಲುಕಣಾ ಸಂರಕ್ಷಣೆಯನ್ನು ಬದಲಾಯಿಸದಂತೆ SELinux ತಡೆಯುತ್ತಿದೆ.
or: SELinux $SOURCE_PATH କୁ ବହୁତ ସଂଖ୍ଯକ ସ୍ମୃତି ଅଭିଗମ ଅନୁମତିକୁ ବଦଳାଇବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH ను వాడుకఅనుమతి మార్చుటనుండి నిరోధిస్తుంది హీప్‌ పైన మెమొరీ యొక్క రక్షణ.
uk: SELinux запобігає зміні $SOURCE_PATH захисту доступу до пулу пам'яті.
zh_tw: SELinux 防止 $SOURCE_PATH 更改堆疊上的 記憶體存取保護。

source: The $SOURCE application attempted to change the access protection of memory on the heap (e.g., allocated using malloc). This is a potential security problem. Applications should not be doing this. Applications are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. If $SOURCE does not work and you need it to work, you can configure SELinux temporarily to allow this access until the application is fixed. Please file a bug report against this package.
as: $SOURCE অনুপ্ৰয়োগে হিপত মেমৰিৰ অভিগম সুৰক্ষা পৰিৱৰ্তন কৰাৰ চেষ্টা কৰিছে (উদাহৰণস্বৰূপ, malloc ব্যৱহাৰ কৰি আবন্টিত)। ই এটা বিভৱীয় সুৰক্ষা সমস্যা। অনুপ্ৰয়োগসমূহে এনে কৰিব নালাগে। অনুপ্ৰয়োগসমূহ কেতিয়াবা ভূলভাৱে ক'ড কৰা থাকে আৰু এই অনুমতি অনুৰোধ কৰে। <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux মেমৰি সুৰক্ষা পৰিক্ষাসমূহ</a> ৱেব পৃষ্ঠায় কেনেদৰে এই প্ৰয়োজনীয়তা আতৰোৱা হব তাৰ বিৱৰণ দিয়ে। যদি $SOURCE কাৰ্য্য নকৰে আৰু আপুনি ইয়াক কাৰ্য্যত কৰিব বিচাৰে, আপুনি SELinux ক অস্থায়ীভাৱে এই অভিগমৰ অনুমতি দিবলে সংৰূপণ কৰিব পাৰে যেতিয়ালৈকে অনুপ্ৰয়োগ ঠিক হৈ নাযায়। অনুগ্ৰহ কৰি এই পেকেইজৰ বিপৰিতে এটা বাগ সংবাদ জমা দিয়ক।
es: La aplicación $SOURCE intentó cambiar la protección de acceso de memoria en la memoria dinámica (por ejemplo, la asignada usando malloc). Este es un problema potencial de seguridad. Las aplicaciones nunca deberían hacer esto. A veces, se codifican de manera incorrecta y requieren este permiso. La página web <a href="http://people.redhat.com/drepper/selinux-mem.html">Pruebas de Protección de Memoria en SELinux</a> explica cómo eliminar este requerimiento. Si $SOURCE no funciona y Ud. necesita que funcione, puede configurar SELinux para que permita temporalmente este acceso hasta que la aplicación sea corregida. Por favor, haga un informe del error a nombre de este paquete.
gu: $SOURCE કાર્યક્રમ એ હીપ (દા.ત. malloc દ્વારા ફાળવવામાં આવેલ) પર મેમરીની વપરાશ સુરક્ષા બદલવા માટે ચાલુ કરાયેલ છે. આ સંભવિત સુરક્ષા સમસ્યા છે. કાર્યક્રમોએ આ કરવું જોઈએ નહિં. કાર્યક્રમો અમુક સમયે અયોગ્ય રીતે કોડ કરાયેલ હોય છે અને આ પરવાનગીની અરજી કરે છે. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> વેબ પાનું સમજાવે છે કે કેવી રીતે આ જરૂરીયાત દૂર કરવી. જો $SOURCE કામ નહિં કરે અને તમારે તેને કામ કરવાની જરૂર હોય, તો તમે SELinux ને કામચલાઉ રીતે આ વપરાશની પરવાનગી આપી શકો છો જ્યાં સુધી કાર્યક્રમ સુધારાઈ નહિં જાય. મહેરબાની કરીને આ આ પેકેજ વિરુદ્ધ ભૂલનો અહેવાલ જમા કરો.
ja: $SOURCE アプリケーションがヒープメモリー (例えば malloc を使った割当て) のアクセス保護の変更を試行しました。セキュリティー上の問題となる可能性が あります。アプリケーションはこのような動作を行うべきではありません。 アプリケーションは誤って記述されることがあり、 このパーミッションを要求 することがあります。 <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> のウェブページにはこの要求の削除方法が記載されています。 $SOURCE が動作しなくて 動作させる必要がある場合、 アプリケーションが修正されるまでの間、 SELinux を設定して一時的にこのアクセスを許可することができます。 このパッケージ に関するバグレポートを提出してください。
kn: $SOURCE ಅನ್ವಯವು ಒಟ್ಟಿಗೆ ಮೆಮೊರಿಯ ನಿಲುಕಣಾ ರಕ್ಷಣೆಯನ್ನು ಬದಲಾಯಿಸಲು ಪ್ರಯತ್ನಿಸಿದೆ (ಉದಾ., malloc ಬಳಸಿಕೊಂಡಿ ನಿಯೋಜಿಸಲಾಗಿದ್ದು). ಇದೊಂದು ದೊಡ್ಡದಾದ ಸುರಕ್ಷತಾ ಲೋಪ. ಅನ್ವಯಗಳು ಹೀಗೆ ಮಾಡಬಾರದು. ಅನ್ವಯಗಳು ಕೆಲವು ಬಾರಿ ತಪ್ಪಾಗಿ ಕೋಡ್ ಮಾಡಲ್ಪಡುವದರಿಂದ ಈ ಬಗೆಯ ಅನುಮತಿಗಾಗಿ ಮನವಿ ಮಾಡುತ್ತವೆ. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> ಜಾಲ ಪುಟವು ಈ ಅಗತ್ಯವನ್ನು ಹೇಗೆ ತೆಗೆದು ಹಾಕುವುದೆಂದು ವಿವರಿಸುತ್ತದೆ. ಎಲ್ಲಿಯಾದರೂ $SOURCE ಕೆಲಸ ಮಾಡದೆ ಇದ್ದು ಹಾಗು ನಿಮಗೆ ಅದು ಕೆಲಸ ಮಾಡುವುದುಬೇಕಿದ್ದಲ್ಲಿ, ಅನ್ವಯದ ತೊಂದರೆಯು ನಿವಾರಣೆಯಾಗುವವರೆಗೆ SELinux ಅನ್ನು ತಾತ್ಕಾಲಿಕವಾಗಿ ನೀವು ಈ ಅನುಮತಿಯನ್ನು ಒದಗಿಸುವಂತೆ ಸಂರಚಿಸಬಹುದು. ದಯವಿಟ್ಟು ಈ ಪ್ಯಾಕೇಜಿನ ವಿರುದ್ದ ಒಂದು ದೋಷ ವರದಿಯನ್ನು ಸಲ್ಲಿಸಿ.
or: ଏହି $SOURCE ପ୍ରୟୋଗ ସ୍ମୃତି ସ୍ଥାନର ଅଭିଗମ୍ୟତା ସୁରକ୍ଷାକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ସଂଗ୍ରହାଳୟ ଉପରେ ପ୍ରଚେଷ୍ଟା କରିଥାଏ (ଯେପରିକି, malloc ବ୍ୟବହାର କରି ବଣ୍ଟନ କରିବା)। ଏହା ଗୋଟିଏ ସମ୍ଭାବ୍ୟ ସୁରକ୍ଷା ସମସ୍ୟା। ପ୍ରୟୋଗଗୁଡ଼ିକ ଏହା କରିବା ଉଚିତ ନୁହଁ। ପ୍ରୟୋଗଗୁଡ଼ିକ କିଛି ସମୟରେ ଭୁଲ ଭାବରେ ସାଙ୍କେତିକରଣ ହୋଇଥାଏ ଏବଂ ଏହି ଅନୁମତି ପାଇଁ ଅନୁରୋଧ କରିଥାଏ। ଏହି <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux ସ୍ମୃତି ସ୍ଥାନ ସୁରକ୍ଷା ପରୀକ୍ଷଣ</a> ଏହି ଆବଶ୍ୟକତାକୁ କିପରି କଢ଼ାଯିବ ତାହା ଏହି ୱେବ ପୃଷ୍ଠା ବିଶ୍ଳେଷଣ କରିଥାଏ। ଯଦି $SOURCE କାର୍ଯ୍ୟ କରିନଥାଏ ଏବଂ ଏହା କାର୍ଯ୍ୟକରୁ ବୋଲି ଆପଣ ଚାହୁଁଛନ୍ତି, ତେବେ ଆପଣ SELinux କୁ ଅସ୍ଥାୟୀ ଭାବରେ ବିନ୍ୟାସ କରିପାରିବେ ପ୍ରୟୋଗଟି ସ୍ଥିର ହେବା ପର୍ଯ୍ୟନ୍ତ ଏହି ଅଭିଗମ୍ୟ ହୋଇଥାଏ। ଦୟାକରି ଏହି ପ୍ୟାକେଜ ବିପରିତରେ ଗୋଟିଏ ତ୍ରୁଟି ବିବରଣୀ ଦାଖଲ କରନ୍ତୁ।
te: హీప్‌పైని మెమొరీ యొక్క వాడుకఅనుమతి రక్షణను మార్చుటకు ప్రయత్నిస్తున్న $SOURCE అనువర్తనం (ఉ.దా., సమకూర్చుతుంది malloc ఉపయోగించి). ఇది గట్టి రక్షణ సమస్య. అనువర్తనములు ఇది చేయకూడదు. అనువర్తనములు అనునవి కొన్ని సమయములందు తప్పుగా కోడ్‌చేయబడతాయి మరియు ఈ అనుమతిని అభ్యర్దిస్తాయి. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> ఈ అవసరాన్ని ఎలా తీసివేయాలో వెబ్ పేజి వివరిస్తుంది. $SOURCE పనిచేయక పోతే మరియు దానిని మీరు పనిచేయల్సివస్తే, మీరు SELinux ను తాత్కాలికంగా ఈ వాడుకను అనువర్తనం సరిదిద్ద బడునంత వరకు అనుమతించవచ్చు. దయచేసి ఈ సంకలనంకు వ్యతిరేకంగా బగ్ నివేదికను నమోదుచేయుము.
uk: Програма $SOURCE спробувала змінити захист пулу пам'яті (наприклад, виділеної за допомогою malloc). Це потенційна проблема з точки зору безпеки. Програми не мають цього робити. Але іноді, через некоректність коду, програмам потрібна така можливість. Документ <a href="http://people.redhat.com/drepper/selinux-mem.html">Тести захисту пам'яті SELinux</a> пояснює як відмовитись від використання такої можливості. Якщо $SOURCE не працює, а вам необхідна ця програма, можна налаштувати SELinux тимчасово дозволити зміну захисту пам'яті, доки програму не буде виправлено. Надішліть звіт</a> про помилку щодо цього пакета.
zh_tw: $SOURCE 應用程式嘗試更改堆疊上的記憶體 (利用 malloc 來分配的) 存取 保護。這是個潛在的安全性 問題。應用程式不該這麼作。應用程式有時 會被錯誤編寫，並要求此許可。 <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux 記憶體保護測試</a> 網頁解釋如何移除這項需求。若 $SOURCE 無法運作而 您需要它運作的話，您可透過暫時性地設定 SELinux 以允許 這項存取，直到應用程式被修復。請針對於此套件提交一份 錯誤報告。

source: If you want $SOURCE to continue, you must turn on the $BOOLEAN boolean. Note: This boolean will affect all applications on the system.
as: যদি আপুনি $SOURCE ক চলাব বিচাৰে, আপুনি $BOOLEAN বুলিয়ান অন কৰিব লাগিব। মন কৰিব: এই বুলিয়ানে চিস্টেমৰ সকলো অনুপ্ৰয়োগৰ উপৰত প্ৰভাৱ পেলাব।
es: Si desea que $SOURCE continúe, debe cambiar el valor de $BOOLEAN. Nota: este booleano afectará a todas las aplicaciones en el sistema.
gu: જો તમે $SOURCE ને ચાલુ રાખવા માંગો, તો તમારે $BOOLEAN બુલિયન ચાલુ કરવું જ જોઈએ. નોંધ: આ બુલિયન સિસ્ટમ પરના બધા કાર્યક્રમોને અસર કરશે.
ja: $SOURCE を継続したい場合は、$BOOLEAN ブーリアンをオンにする必要があり ます。 注記: このブーリアンはシステム上の全てのアプリケーションに影響 します。
kn: $SOURCE ಮುಂದುವರೆಯ ಬೇಕಿದ್ದರೆ, ನೀವು $BOOLEAN ಬೂಲಿಯನ್ ಅನ್ನು ಆನ್ ಮಾಡಬೇಕಾಗುತ್ತ್ದೆ. ಸೂಚನೆ: ಈ ಬೂಲಿಯನ್ ಗಣಕದಲ್ಲಿನ ಎಲ್ಲಾ ಅನ್ವಯಗಳ ಮೇಲೂ ಪರಿಣಾಮ ಬೀರುತ್ತದೆ.
or: ଆପଣ $SOURCE କୁ ଜାରି ରଖିବା ପାଇଁ ଚାହୁଁଥିଲେ, ଆପଣ $BOOLEAN ବୁଲିଆନ ମୂଲ୍ଯକୁ ଅନ କରିବା ଉଚିତ। ଟିପ୍ପଣୀ: ଏହି ବୁଲିଆନଟି ତନ୍ତ୍ରରେ ଥିବା ସମସ୍ତ ପ୍ରୟୋଗ ମାନଙ୍କୁ ପ୍ରଭାବିତ କରିବ।
te: మీరు $SOURCE కొనసాగాలని అనుకుంటే, మీరు తప్పక $BOOLEAN ను బూలియన్‌కు ఆన్ చేయాలి. గమనిక: ఈ బూలియన్ సిస్టమ్ నందలి అన్ని అనువర్తనంలను ప్రభావితం చేస్తుంది.
uk: Для продовження $SOURCE необхідно активувати логічну змінну $BOOLEAN. Зауваження: її значення впливає на всі програми системи.
zh_tw: 若您希望 $SOURCE 繼續的話，您必須將 $BOOLEAN 布林值 開啟。請注意：此布林值將會影響系統上 所有的應用程式。

source: you do not think $SOURCE_PATH should need to map heap memory that is both writable and executable.
as: আপুনি নাভাৱে $SOURCE_PATH এ হিপ মেমৰি মেপ কৰিব লাগিব যি দুয়ো লিখিব আৰু প্ৰেৰণ কৰিব পৰা।
es: no cree que $SOURCE_PATH necesite mapear una cantidad de memoria que es a la vez ejecutable modificable.
gu: તમારે એવુ વિચારવુ જોઇએ નહિં કે $SOURCE_PATH ને મૅપ હીપ મેમરીની જરૂર હોવી જોઇએ કે જે બંને લખી શકાય અને ચલાવી શકાય છે.
ja: $SOURCE_PATH が、 heap メモリを map する必要はありません。 heap メモリは書込み可能且つ実行可能です。
kn: ಬರೆಯಬಹುದಾದ ಹಾಗು ಕಾರ್ಯಗತಗೊಳಿಸಬಹುದಾದಂತಹ ಮೆಮೊರಿ ರಾಶಿಗೆ $SOURCE_PATH ಮ್ಯಾಪ್ ಮಾಡುವ ಅಗತ್ಯವಿದೆಯೆಂದು ನಿಮಗೆ ಅನ್ನಿಸುವುದಿಲ್ಲ.
or: ଆପଣ ଭାବୁନାହାନ୍ତି କି $SOURCE_PATH ହିପ ସ୍ମୃତିସ୍ଥାନକୁ ଆବଶ୍ୟକ କରିବା ଉଚିତ ଯାହାକି ଉଭୟ ଲେଖାଯୋଗ୍ୟ ଏବଂ ନିଷ୍ପାଦନଯୋଗ୍ୟ।
te: వ్రాయదగిన మరియు నిర్వర్తించదగిన హీప్ మెమొరీకు $SOURCE_PATH మాప్ చేయవలెనని మీరు అనుకోవడంలా.
uk: вам здається, що $SOURCE_PATH не повинна відображати резервну область пам’яті для запису і виконання коду.
zh_tw: 您不認為 $SOURCE_PATH 需要映射可寫入和可執行的堆積記憶體（heap memory）。

source: you need to report a bug. This is a potentially dangerous access.
as: আপুনি এটা বাগ জমা দিব লাগিব। ই বিভৱীয়ভাৱে বিপদজনক অভিগম।
es: necesita reportar un error. Este es un acceso potencialmente peligroso.
gu: તમારે ભૂલનો અહેવાલ કરવો જોઇએ. આ ખતરનાક પ્રવેશ છે.
ja: バグをレポートする必要があります。これは危険なアクセスです。
kn: ನೀವು ಒಂದು ದೋಷವನ್ನು ವರದಿ ಮಾಡಬೇಕಾಗುತ್ತದೆ. ಇದು ಒಂದು ಅಪಾಯಕಾರಿಯಾದ ನಿಲುಕಣೆ.
or: ଆପଣଙ୍କୁ ଗୋଟିଏ ତ୍ରୁଟି ଖବର କରିବା ଆବଶ୍ୟକ। ଏହା ଗୋଟିଏ ବିପଦଜନକ ଅଭିଗମ୍ୟତା।
te: మీరు బగ్‌ను నివేదించాలి. ఇది హానికారణ యాక్సెస్.
uk: вам слід повідомити про ваду. Такий доступ є потенційно небезпечним.
zh_tw: 您需要回報臭蟲。這個存取潛藏危險。

source: Contact your security administrator and report this issue.
as: আপোনাৰ সুৰক্ষা প্ৰশাসকৰ সৈতে যোগাযোগ কৰক আৰু এই বিষয়ে সূচীত কৰক।
es: Póngase en contacto con su administrador de seguridad y reporte este problema.
gu: તમારા સુરક્ષા સંચાલકનો સંપર્ક કરો અને આ સમસ્યાનો અહેવાલ કરો.
ja: セキュリティ管理者にコンタクトし、この問題を報告してください。
kn: ನಿಮ್ಮ ಸುರಕ್ಷತಾ ವ್ಯವಸ್ಥಾಪಕರನ್ನು ಸಂಪರ್ಕಿಸಿ ಹಾಗು ಈ ವಿಷಯವನ್ನು ವರದಿ ಮಾಡಿ.
or: ଆପଣଙ୍କର ସୁରକ୍ଷା ପ୍ରଶାସକଙ୍କ ସହିତ ଯୋଗାଯୋଗ କରନ୍ତୁ ଏବଂ ଏହି ସମସ୍ୟାକୁ ଖବର କରନ୍ତୁ।
te: మీరు భద్రతా నిర్వాహకుని సంప్రదించి యీ సమస్యగురించి ఫిర్యాదుచేయండి.
uk: Зв’яжіться з адміністратором, що відповідає за безпеку, і повідомте про цю ваду.
zh_tw: 請聯絡您的安全管理員，並回報此議題。

source: SELinux is preventing $SOURCE_PATH from loading $TARGET_PATH which requires text relocation.
as: SELinux এ $SOURCE_PATH ক $TARGET_PATH ল'ড কৰাৰ পৰা প্ৰতিৰোধ কৰি আছে যাৰ পাঠ আবন্টনৰ প্ৰয়োজন।
es: SELinux está impidiendo a $SOURCE_PATH cargar $TARGET_PATH, lo cual requiere reubicación de texto.
gu: SELinux એ $SOURCE_PATH ને $TARGET_PATH લાવવાથી બચાવી રહ્યું છે કે જેને લખાણ પુનઃસ્થાનીકરણ જરૂરી છે.
ja: SELinux はテキスト再配置を要求する $TARGET_PATH を $SOURCE_PATH がロードすることを阻止しています。
kn: ಪಠ್ಯ ಸ್ಥಳಾಂತರದ ಅಗತ್ಯವಿರುವ $TARGET_PATH ಅನ್ನು ಲೋಡ್‍ ಆಗದಂತೆ $SOURCE_PATH ಅನ್ನು SELinux ತಡೆದಿದೆ.
or: SELinux $SOURCE_PATH କୁ ପାଠ୍ଯ ପୁନଃବଣ୍ଟନ ଆବଶ୍ଯକ କରୁଥିବା $TARGET_PATH ଧାରଣ କରିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH ను $TARGET_PATH నుండి లోడవుటనుండి నిరోదిస్తుంది దేనికైతే పాఠ్యము పునఃస్థాపనను అవసరమౌతుందో.
uk: SELinux запобігає завантаженню $TARGET_PATH з $SOURCE_PATH з переміщенням тексту.
zh_tw: SELinux 防止 $SOURCE_PATH 載入需要文字重定位的 $TARGET_PATH。

source: The $SOURCE application attempted to load $TARGET_PATH which requires text relocation. This is a potential security problem. Most libraries do not need this permission. Libraries are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. You can configure SELinux temporarily to allow $TARGET_PATH to use relocation as a workaround, until the library is fixed. Please file a bug report.
as: $SOURCE অনুপ্ৰয়োগে $TARGET_PATH ল'ড কৰাৰ চেষ্টা কৰিছিল যাৰ পাঠ আবন্টনৰ প্ৰয়োজন। ই এটা বিভৱীয় সুৰক্ষা সমস্যা। বেছিৰভাগ লাইব্ৰেৰীৰ এই অনুমতিৰ প্ৰয়োজন হয়। লাইব্ৰেৰীসমূহক কেতিয়াবা ভূলভাৱে ক'ড কৰা হয় আৰু এই অনুমতিৰ অনুৰোধ কৰে। <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux মেমৰি সুৰক্ষা পৰিক্ষাসমূহ</a> ৱেব পৃষ্ঠায় এই প্ৰয়োজনীয়তা কেনেদৰে আতৰাব তাৰ বিৱৰণ দিয়ে। আপুনি SELinux ক $TARGET_PATH ক পুনৰঅৱস্থান এটা সমাধান হিচাপে ব্যৱহাৰ কৰিবলে সংৰূপণ কৰিব পাৰে, যেতিয়ালৈকে লাইব্ৰেৰী ঠিক নহয়। অনুগ্ৰহ কৰি এটা বাগ সংবাদ জমা দিয়ক।
es: La aplicación $SOURCE intentó cargar $TARGET_PATH que requiere reasignación de texto. Esto es un problema de seguridad potencial. La mayoría de las bibliotecas no necesitan este permiso. Las bibliotecas son a veces codificadas incorrectamente y requieren este permiso. La página web de <a href="http://people.redhat.com/drepper/selinux-mem.html">Pruebas de Protección de Memoria en SELinux</a> explica cómo eliminar este requerimiento. Puede configurar SELinux para que temporalmente permita a $TARGET_PATH usar la reubicación mientras se corrige la biblioteca. Por favor, ingrese un <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">informe de error</a> contra este paquete.
gu: $SOURCE કાર્યક્રમ એ $TARGET_PATH લોડ કરવા જઈ રહ્યું છે કે જેને લખાણ પુનઃસ્થાનિકરણ જરૂરી છે. આ સંભવિત સુરક્ષા સમસ્યા છે. મોટા ભાગની લાઈબ્રેરીઓને આ પરવાનગીની જરૂર નથી. લાઈબ્રેરીઓ અમુકવાર અયોગ્ય રીતે કોડ થયેલ હોય છે અને આ પરવાનગી માટે અરજી કરે છે. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> વેબ પાનું કેવી રીતે આ જરૂરીયાત દૂર કરવી તે સમજાવે છે. તમે $TARGET_PATH ને કામ કરવા માટે પુનઃસ્થાનિકરણ વાપરવા માટે પરવાનગી આપવા માટે SELinux ને કામચલાઉ રીતે રૂપરેખાંકિત કરી શકો છો, જ્યાં સુધી લાઈબ્રેરી ચોક્કસ નહિં થાય. મહેરબાની કરીને આ પેકેજ વિરુદ્ધ ભૂલનો અહેવાલ જમા કરો.
ja: $SOURCE アプリケーションは、テキスト移動を要求する $TARGET_PATH のロードを試行しました。 セキュリティー上の問題となる可能性があります。 ほとんどのライブラリーはこの許可を必要としません。 ライブラリーは 誤って記述されることがあり、 この許可を要求することがあります。 <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> のウェブページにはこの要求の削除方法が記載されています。 ライブラリーが 修正されるまでの間の回避策として SELinux を設定し一時的に $TARGET_PATH が 移動を使用できるようにすることができます。 このパッケージに関するバグレポート を提出してください。
kn: ಪಠ್ಯ ಸ್ಥಳಾಂತರದ ಅಗತ್ಯವಿರುವ $TARGET_PATH ಅನ್ನು ಲೋಡ್ ‍ಮಾಡಲು $SOURCE ಅನ್ವಯವು ಪ್ರಯತ್ನಿಸಿದೆ. ಇದೊಂದು ದೊಡ್ಡದಾದ ಸುರಕ್ಷತಾ ಲೋಪ. ಹೆಚ್ಚಿನ ಲೈಬ್ರರಿಗಳಿಗೆ ಈ ಅನುಮತಿಯ ಅಗತ್ಯವಿರುವುದಿಲ್ಲ. ಲೈಬ್ರರಿಗಳು ಕೆಲವು ಬಾರಿ ತಪ್ಪಾಗಿ ಕೋಡ್ ಮಾಡಲ್ಪಟ್ಟು ಈ ಅನುಮತಿಗೆ ಮನವಿ ಸಲ್ಲಿಸುತ್ತವೆ. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> ಜಾಲ ಪುಟವು ಈ ಅಗತ್ಯವನ್ನು ಹೇಗೆ ತೆಗೆದು ಹಾಕುವುದೆಂದು ವಿವರಿಸುತ್ತದೆ. ಲೈಬ್ರರಿಯನ್ನು ಸರಿಪಡಿಸುವಲ್ಲಿಯವರೆಗೆ, $TARGET_PATH ಸ್ಥಳಾಂತರವನ್ನು ಒಂದು ಪರಿಹಾರವಾಗಿ ಬಳಸುವಂತೆ ನೀವು ತಾತ್ಕಾಲಿಕವಾಗಿ SELinux ಅನ್ನು ಸಂರಚಿಸಬಹುದಾಗಿದೆ. ಈ ಪ್ಯಾಕೇಜಿನ ವಿರುದ್ದ ಒಂದು ದೋಷ ವರದಿಯನ್ನು ಸಲ್ಲಿಸಿ.
or: $SOURCE ପ୍ରୟୋଗ $TARGET_PATH କୁ ଧାରଣ କରିବା ପାଇଁ ଚେଷ୍ଟା କରିଛି ଯାହାକି ପାଠ୍ୟ ପୁନଃସ୍ଥାପନ ଆବଶ୍ୟକ କରିଥାଏ। ଏହା ଗୋଟିଏ ଶକ୍ତି ସାମର୍ଥ୍ୟ ସୁରକ୍ଷା ସମସ୍ୟା। ଅଧିକାଂଶ ଲାଇବ୍ରେରୀ ଏହି ଅନୁମତିକୁ ଆବଶ୍ୟକ କରନ୍ତି ନାହିଁ। ଲାଇବ୍ରେରୀଗୁଡ଼ିକ ବେଳେବେଳେ ଭୁଲ ଭାବରେ ସାଙ୍କେତିକରଣ ହୋଇଥାଏ ଏବଂ ଅହି ଅନୁମତି ପାଇଁ ଅନୁରୋଧ କରିଥାଏ। ଏହି <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> ୱେବ ପୃଷ୍ଠା ଆବଶ୍ୟକତାକୁ କିପରି ପୁରଣ କରାଯିବ ତାହା ବର୍ଣ୍ଣନା କରିଥାଏ। ଆପଣ SELinux କୁ ଅସ୍ଥାୟୀ ଭାବରେ $TARGET_PATH ସ୍ଥାନାନ୍ତରିତ କରିବା ପାଇଁ ଅନୁମତି ଦେଇଥାନ୍ତି। ଦୟାକରି ଏହି ପ୍ୟାକେଜ ବିରୁଦ୍ଧରେ ଗୋଟିଏ ତ୍ରୁଟି ବିବରଣୀ ଦାଖଲ କରନ୍ତୁ।
te: $SOURCE అనువర్తనం అనునది $TARGET_PATH ను నింపుటకు ఏదైతే పాఠ్యము పునఃస్థానీకరిణ అవసరమౌతుందో యత్నిస్తుంది. ఇది ఖచ్చితంగా రక్షణ సమస్య. చాలా లైబ్రరీస్ కు ఈ అనుమతి అవసరం లేదు. లైబ్రరీలు కొన్ని సార్లు తప్పుగా కోడ్ చేయబడివుంటాయి మరియు ఈ అనుమతిని అభ్యర్దిస్తాయి. ఆ వెబ్‌పుట <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> ఈ అవసరాన్ని ఎలా తొలగించాలో వివరిస్తుంది. మీరు SELinux ను తాత్కాలికంగా ఆకృతీకరించవచ్చు $TARGET_PATH ను పునఃస్థానీకరణను పనిచేయించుటలాగా అనుమతించుటకు, లైబ్రరీ సిద్దము అగు నంతవరకు. దయచేసి ఒక బగ్ నివేదికను నమోదుచేయండి.
uk: Програма $SOURCE спробувала завантажити $TARGET_PATH, яка вимагає переміщення. Це потенційна проблема з точки зору безпеки. Більшість бібліотек цього не вимагають. Іноді бібліотеки написані некоректно та вимагають таку можливість. У документі <a href="http://people.redhat.com/drepper/selinux-mem.html">Тести захисту пам'яті SELinux</a> пояснюється як відмовитись від використання цієї можливості. Налаштуйте SELinux для тимчасового дозволу $TARGET_PATH робити переміщення, поки бібліотеку не буде виправлено. Будь ласка, надішліть звіт про помилку щодо цього пакета.
zh_tw: $SOURCE 應用程式嘗試載入需要文字重定位的 $TARGET_PATH。這是個潛在的安全性問題。 大部分的函式庫都不需要此許可。函式庫 有時會被錯誤編寫以至於請求此許可。 <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux 記憶體保護測試</a> 網頁解釋如何移除這項需求。您可透過暫時性地 設定 SELinux，以允許 $TARGET_PATH 使用重定位來 代替，直到函式庫被修復。請提交一份 錯誤報告。
