Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: SELinux has denied $SOURCE "$ACCESS" access to device $TARGET_PATH. $TARGET_PATH is mislabeled, this device has the default label of the /dev directory, which should not happen. All Character and/or Block Devices should have a label. You can attempt to change the label of the file using restorecon -v '$TARGET_PATH'. If this device remains labeled device_t, then this is a bug in SELinux policy. Please file a bg report. If you look at the other similar devices labels, ls -lZ /dev/SIMILAR, and find a type that would work for $TARGET_PATH, you can use chcon -t SIMILAR_TYPE '$TARGET_PATH', If this fixes the problem, you can make this permanent by executing semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' If the restorecon changes the context, this indicates that the application that created the device, created it without using SELinux APIs. If you can figure out which application created the device, please file a bug report against this application.
as: SELinux এ যন্ত্ৰ $TARGET_PATH লে $SOURCE "$ACCESS" অভিগম নাকচ কৰিছে। $TARGET_PATH ভুলভাৱে লেবেল কৰা হৈছে, এই ডিভাইচৰ /dev ডাইৰেকটৰিৰ অবিকল্পিত লেবেল আছে, যি সংঘটিত হব নালাগিব। সকলো বৰ্ণ আৰু/অথবা খণ্ড যন্ত্ৰসমূহৰ এটা লেবেল থাকিব লাগিব। আপুনি নথিপত্ৰৰ লেবেল সলনি কৰাৰ চেষ্টা কৰিব পাৰিব restorecon -v '$TARGET_PATH' ব্যৱহাৰ কৰি। যদি এই যন্ত্ৰ device_t লেবেল কৰা থাকে, তেন্তে ই SELinux নীতিত এটা বাগ। অনুগ্ৰহ কৰি এটা বাগ সংবাদ জমা দিয়ক। যদি আপুনি অন্য সদৃশ যন্ত্ৰ লেবেলসমূহ চায়, ls -lZ /dev/SIMILAR, আৰু এটা ধৰণ পায় যি $TARGET_PATH ৰ বাবে কাৰ্য্য কৰিব লাগে, আপুনি chcon -t SIMILAR_TYPE '$TARGET_PATH' ব্যৱহাৰ কৰিব পাৰিব, যদি ই সমস্যাৰ সমাধান কৰে, আপুনি ইয়াক স্থায়ী কৰিব পাৰিব semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' এক্সিকিউট কৰি যদি restorecon এ পৰিপ্ৰেক্ষতিত সলনি কৰে, ই ইংগিত দিয়ে যে অনুপ্ৰয়োগ যি যন্ত্ৰটো সৃষ্টি কৰিলে, ইয়াক SELinux APIসমূহ ব্যৱহাৰ নকৰাকৈ ইয়াক সৃষ্টি কৰিলে। যদি আপুনি বিচাৰি উলিয়াব পাৰে কোনটো অনুপ্ৰয়োগে যন্ত্ৰটো সৃষ্টি কৰিলে, অনুগ্ৰহ কৰি এই অনুপ্ৰয়োগৰ বাবে এটা বাগ সংবাদ জমা দিয়ক।
es: SELinux le ha negado a $SOURCE el acceso "$ACCESS" a $TARGET_PATH. $TARGET_PATH está mal etiquetada: este dispositivo posee la etiqueta predeterminada del directorio /dev, y esto no debería ocurrir. Todos los dispositivos de caracteres y/o de bloques deben tener una etiqueta. Puede intentar cambiar la etiqueta del archivo usando restorecon -v '$TARGET_PATH'. Si este dispositivo continúa etiquetado como device_t, entonces es un error en la política de SELinux. Por favor, informe este error. Si observa otras etiquetas de dispositivos similares, ls -lZ /dev/SIMILAR, y encuentra un tipo que pueda funcionar para $TARGET_PATH, puede utilizar chcon -t TIPO_SIMILAR '$TARGET_PATH'. Si esto corrige el problema, puede hacer que esta modificación sea permanente ejecutando semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' Si restorecon modifica el contexto, indica que la aplicación que ha creado al dispositivo, lo ha hecho sin utilizar los API de SELinux. Si puede descubrir qué aplicación creó el dispostivo, por favor informe este error contra esa aplicación.
gu: SELinux એ $SOURCE "$ACCESS" વપરાશ ઉપકરણ $TARGET_PATH માટે નામંજૂર કર્યો છે. $TARGET_PATH ને ખોટું લેબલ અપાયેલ છે, આ ઉપકરણને /dev ડિરેક્ટરીનું મૂળભૂત લેબલ છે, કે જે થવું જોઈએ નહિં. બધા અક્ષર અને/અથવા બ્લોક ઉપકરણોને લેબલ હોવું જોઈએ. તમે ફાઈલનું લેબલ restorecon -v '$TARGET_PATH' મદદથી બદલી શકો છો. જો આ ઉપકરણ device_t લેબલવાળું રહે, તો પછી આ SELinux પોલિસીમાં ભૂલ છે. મહેરબાની કરીને ભૂલનો અહેવાલ જમા કરો જો તમે અન્ય સરખા ઉપકરણોના લેબલો માટે જુઓ, ls -lZ /dev/SIMILAR, અને પ્રકાર મેળવો કે જે $TARGET_PATH માટે કામ કરે, તો તમે chcon -t SIMILAR_TYPE '$TARGET_PATH' વાપરી શકો, જો આ સમસ્યાને સુધારે, તમે આને નીચેનો આદેશ ચલાવીને કાયમી બનાવી શકો છો semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' જો restorecon સંદર્ભ બદલે, તો આ સૂચવે છે કે કાર્યક્રમ કે જેણે ઉપકરણ બનાવ્યું, તેણે તેને SELinux APIs વિના બનાવ્યું. જો તમે શોધી શકો કે કયા કાર્યક્રમોએ ઉપકરણ બનાવ્યું, તો મહેરબાની કરીને આ કાર્યક્રમ વિરુદ્ધ ભૂલનો અહેવાલ જમા કરો.
ja: SELinux はデバイス $TARGET_PATH への $SOURCE による "$ACCESS" アクセスを拒否しています。 $TARGET_PATH は誤ったラベルが付けられており、このデバイスは /dev ディレクトリーのデフォルトラベルを持っています。 これは起こるべきではありません。すべてのキャラクタデバイス またはブロックデバイスはラベルを有しているべきです。 次を使用してファイルのラベル変更を試行することができます。 restorecon -v $TARGET_PATH このデバイスのラベルが変らず device_t のままなら、 SELinux ポリシーのバグということになります。 バグレポートを提出してください。 他の同様のデバイスラベルを見るのに、 ls -lZ /dev/SIMILAR を実行して $TARGET_PATH に対して動作するであろうタイプを見つけたら chcon -t SIMILAR_TYPE $TARGET_PATH を使用します。これで問題が解決するようなら次を実行して永続的に変更します。 semanage fcontext -a -t SIMILAR_TYPE $FIX_TARGET_PATH restorecon がコンテキストを変更する場合、 デバイスを作成したアプリケーションが SELinux API を使用せずに作成したということを示しています。 デバイスを作成したアプリケーションを判別できる場合は、そのアプリケーションに関してバグレポートを提出してください。
kn: ಸಾಧನ $TARGET_PATH ಅನ್ನು $SOURCE ($SOURCE_TYPE) "$ACCESS" ನಿಲುಕಿಸಿಕೊಳ್ಳುವುದನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. $TARGET_PATH ಯು ತಪ್ಪಾಗಿ ಲೇಬಲ್ ಮಾಡಲ್ಪಟ್ಟಿದೆ, ಈ ಸಾಧನವು ಪೂರ್ವನಿಯೋಜಿತವಾಗಿ /dev ಕಡತಕೋಶದ ಲೇಬಲ್ ಅನ್ನು ಹೊಂದಿದೆ, ಆದರೆ ಹೀಗಾಗಬಾರದು. ಎಲ್ಲಾ ಅಕ್ಷರ ಹಾಗು/ಅಥವ ಬ್ಲಾಕ್ ಸಾಧನಗಳು ಒಂದು ಲೇಬಲ್ ಅನ್ನು ಹೊಂದಿರಬೇಕು. ನೀವು ಕಡತದ ಲೇಬಲ್ ಅನ್ನು restorecon -v '$TARGET_PATH'ಬಳಸಿಕೊಂಡು ಬದಲಾಯಿಸಬಹುದಾಗಿದೆ. ಎಲ್ಲಿಯಾದರೂ ಈ ಸಾಧನವು device_t ಎಂದು ಲೇಬಲ್ ಆಗಿಯೆ ಉಳಿದರೆ, SELinux ನೀತಿಯಲ್ಲಿ ಒಂದು ದೋಷವಿದೆ ಎಂದರ್ಥ. ದಯವಿಟ್ಟು selinux-policy ಪ್ಯಾಕೇಜ್ ವಿರುದ್ದ ಒಂದು ದೋಷ ವರದಿಯನ್ನು ಸಲ್ಲಿಸಿ. ನೀವು ಇದೇ ರೀತಿಯ ಬೇರೆ ಸಾಧನಗಳ ಲೇಬಲ್‍ಗಳನ್ನು ಗಮನಿಸಿದರೆ, ls -lZ /dev/SIMILAR, ಅಲ್ಲಿ $TARGET_PATH ಗೆ ಕೆಲಸ ಮಾಡುವ ಒಂದು ಬಗೆಯನ್ನು ಕಾಣಬಹುದು, ಇದಕ್ಕೆ ನೀವು chcon -t SIMILAR_TYPE '$TARGET_PATH'ಅನ್ನು ಬಳಸಬಹುದು. ಇದು ತೊಂದರೆಗೆ ಪರಿಹಾರ ಒದಗಿಸಿದರೆ, semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ ನೀವಿದನ್ನು ಒಂದು ಶಾಶ್ವತಗೊಳಿಸಬಹುದು ಎಲ್ಲಿಯಾದರೂ restorecon ವು ಸನ್ನಿವೇಶವನ್ನು ಬದಲಿಸಿದರೆ, ಸಾಧನವನ್ನು ನಿರ್ಮಿಸಿದ ಅನ್ವಯವು SELinux APIಗಳನ್ನು ಬಳಸದೆ ನಿರ್ಮಿಸಿವೆ ಎಂದರ್ಥ ಯಾವ ಅನ್ವಯವು ಈ ಸಾಧನವನ್ನು ನಿರ್ಮಿಸಿತು ಎಂದು ನೀವು ಪತ್ತೆಹಚ್ಚಿದರೆ ದಯವಿಟ್ಟು ಈ ಅನ್ವಯದ ವಿರುದ್ದ ಒಂದು <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ದೋಷ ವರದಿಯನ್ನು ಸಲ್ಲಿಸಿ</a>
or: SELinux ଉପକରଣ $TARGET_PATH ମଧ୍ୟକୁ $SOURCE "$ACCESS" ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଛି। $TARGET_PATH ଟି ଭୁଲ ଭାବରେ ନାମକରଣ କରାଯାଇଛି, ଏହି ଉପକରଣରେ dev ଡିରେକ୍ଟୋରୀ ନାମରେ /ପୂର୍ବନିର୍ଦ୍ଧାରିତ ନାମପଟି ଅଛି, ଯାହାକି ହେବା ଉଚିତ ନୁହଁ। ସମସ୍ତ ସଦସ୍ୟ ଏବଂ/ଅଥବା ବ୍ଲକ ଉପକରଣଗୁଡ଼ିକରେ ନାମପଟି ରହିବା ଉଚିତ। ଆପଣ ସେହି ଫାଇଲର ନାମପଟିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ restorecon -v '$TARGET_PATH' କୁ ବ୍ୟବହାର କରି ଚେଷ୍ଟା କରିପାରିବେ। ଯଦି ଏହି ଉପକରଣ device_t ନାମରେ ନାମକରଣ ହୋଇ ରହେ, ତେବେ ଏହା SELinux ନିତୀରେ ଥିବା ଏକ ତ୍ରୁଟି। ଦୟାକରି ଗୋଟିଏ bg ବିବରଣୀ ଦାଖଲ କରନ୍ତୁ। ଯଦି ଆପଣ ଅନ୍ୟାନ୍ୟ ସାଦୃଶ୍ୟ ଉପକରଣଗୁଡ଼ିକୁ ଦେଖନ୍ତି, ତେବେ ls -lZ /dev/SIMILAR, ଏବଂ $TARGET_PATH ସହିତ କାମ କରିବା ପାଇଁ ଗୋଟିଏ ପ୍ରକାରକୁ ଖୋଜନ୍ତୁ, ଆପଣ chcon -t SIMILAR_TYPE '$TARGET_PATH' କୁ ବ୍ୟବହାର କରନ୍ତୁ, ଯଦି ଏହା ସମସ୍ୟାର ସମାଧାନ କରିଥାଏ, ତେବେ ଆପଣ ଏହାକୁ ନିଷ୍ପାଦନ କରି ଏହାକୁ ସ୍ଥାୟୀ କରନ୍ତୁ semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' ଯଦି restorecon ପ୍ରସଙ୍ଗକୁ ପରିବର୍ତ୍ତନ କରିଥାଏ, ତେବେ ଏହା ସୂଚାଇଥାଏ ଯେ ଏହି ଉପକରଣକୁ ନିର୍ମାଣ କରିଥିବା ପ୍ରୟୋଗଟି, SELinux APIs ବ୍ୟବାହର ନକରି ଏହାକୁ ନିର୍ମାଣ କରିଥାଏ। ଯଦି ଆପଣ ସିଦ୍ଧାନ୍ତ କରିପାରିବେ ଯେ କେଉଁ ପ୍ରୟୋଗଟି ଏହି ଉପକରଣକୁ ନିର୍ମାଣ କରିଛି, ତେବେ ଦୟାକରି ସେହି ପ୍ରୟୋଗ ନାମରେ ତ୍ରୁଟି ବିବରଣୀ ଦାଖଲ କରନ୍ତୁ।
te: SELinux అనునది $SOURCE_PATH "$ACCESS" యాక్సెస్‌ను $TARGET_PATH పరికరముకు తిరస్కరిస్తోంది. $TARGET_PATH అనునది మిస్‌లేబుల్ అయివుంది, ఈ పరికరము /dev డైరెక్టరీయొక్క అప్రమేయ లేబుల్‌ను కలిగివుంది, యేదైతే జరగకూడదో. అన్ని కారక్టర్ మరియు/లేదా బ్లాక్ పరికరాలు లేబుల్ కలిగివుండాలి. మీరు restorecon -v '$TARGET_PATH' వుపయోగించే ఫైలుయొక్క లేబుల్‌ను మార్చుటకు మీరు ప్రయత్నించవచ్చు. ఈ పరికరము device_t లేబుల్‌తో మిగిలివుంటే, ఈ బగ్ SELinux విధానం నందలిది. దయచేసి వొక బగ్ నివేదికను నమోదు చేయండి. మీరు యిలాంటివే యితర పరికరాల లేబుల్సును చూచినట్లైతే, ls-lZ /dev/SIMILAR, మరియు $TARGET_PATHకు పనిచేసే రకమును కనుగొనుము, మీరు chcon -t SIMILAR_TYPE '$TARGET_PATH' వుపయోగించవచ్చు, వొకవేళ యిది సమస్యను పరిష్కరించితే, మీరు దీనిని semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' నిర్వర్తించుటద్వారా శాశ్వతంచేయవచ్చు. ఒకవేళ restorecon సందర్బంను మార్చితే, పరికరమును సృష్టించిన అనువర్తనం, SELinux APIsను వుపయోగించకుండా సృష్టించినదని సూచిస్తుంది. పరికరమును ఏ అనువర్తనము సృష్టించినదో మీరు తెలుసుకోగలిగితే, దయచేసి నువర్తనంపైన బగ్ నివేదికను నమోదుచేయండి.
uk: SELinux закрила $SOURCE_PATH доступ "$ACCESS" до пристрою $TARGET_PATH. $TARGET_PATH відмічено неправильно та має стандартну позначку каталогу /dev. Всі символьні та блочні пристрої повинні мати свою позначку. Можна спробувати змінити мітку командою restorecon -v $TARGET_PATH. Якщо пристрій досі має мітку device_t, це помилка у правилах SELinux. Будь ласка, надішліть звіт про помилку у пакеті selinux-policy. Якщо ви переглянете мітки схожих пристроїв, ls -lZ /dev/SIMILAR, та знайдете тип, який підтримує $TARGET_PATH, можна виконати chcon -t SIMILAR_TYPE $TARGET_PATH. Якщо це допоможе, можете внести постійні зміни за допомогою команди semanage fcontext -a -t SIMILAR_TYPE $TARGET_PATH Якщо restorecon може змінити контекст, це означає, що програма, яка створила пристрій, не використовувала SELinux API. Якщо ви можете визначити, яка програма створила цей пристрій, надішліть звіт про помилку щодо цієї програмі.
zh_tw: SELinux 拒絕 $SOURCE「$ACCESS」存取裝置 $TARGET_PATH。 $TARGET_PATH 被錯誤標記，此裝置含有 /dev 目錄的預設標籤，然而這卻不應該 發生。所有的字元與/或區塊裝置皆應該有標籤。 您可嘗試透過使用 restorecon -v '$TARGET_PATH' 來更改檔案的標籤。 若此裝置保持被標記為 device_t 的話，那麼這便是一項 SELinux 方針中的錯誤。 請提交一份錯誤報告。 若您查看其它相似的裝置標籤 ls -lZ /dev/SIMILAR，並且發現一個適用於 $TARGET_PATH 的類型的話， 您可使用 chcon -t SIMILAR_TYPE '$TARGET_PATH'，若這麼作可修復問題的話，您即可透過執行 semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' 來確保其持續性。 若 restorecon 更改情境，這代表建立裝置的應用程式在未使用 SELinux API 的情況下 建立該裝置。若您可找出建立裝置的應用程式為何，請針對於此應用程式提交一份報告錯誤。

source: Attempt restorecon -v '$TARGET_PATH' or chcon -t SIMILAR_TYPE '$TARGET_PATH'
as: restorecon -v '$TARGET_PATH' অথবা chcon -t SIMILAR_TYPE '$TARGET_PATH' চেষ্টা কৰক
es: Intente restorecon -v '$TARGET_PATH' o chcon -t TIPO_SIMILAR '$TARGET_PATH'
gu: restorecon -v '$TARGET_PATH' અથવા chcon -t SIMILAR_TYPE '$TARGET_PATH' ચલાવો
ja: restorecon -v $TARGET_PATH または chcon -t SIMILAR_TYPE $TARGET_PATH を試してください。
kn: restorecon -v '$TARGET_PATH' ಅಥವ chcon -t SIMILAR_TYPE '$TARGET_PATH' ಗೆ ಪ್ರಯತ್ನಿಸಿ
or: restorecon -v '$TARGET_PATH' କିମ୍ବା chcon -t SIMILAR_TYPE '$TARGET_PATH'ନିର୍ଦ୍ଦେଶ ମାନଙ୍କ ସହିତ ପ୍ରଚେଷ୍ଟା କରନ୍ତୁ
uk: Спробуйте виконати «restorecon -v $TARGET_PATH» чи «chcon -t SIMILAR_TYPE '$TARGET_PATH'»
zh_tw: 嘗試 restorecon -v '$TARGET_PATH' 或 chcon -t SIMILAR_TYPE '$TARGET_PATH'

source: You need to change the label on $TARGET_PATH to a type of a similar device.
as: আপুনি $TARGET_PATH ৰ লেবেলক এটা সদৃশ যন্ত্ৰৰ ধৰণলে সলনি কৰিব লাগিব।
es: Necesita modificar la etiqueta en $TARGET_PATH con el tipo de un dispositivo similar.
gu: તમારે સરખા ઉપકરણનાં પ્રકાર માટે $TARGET_PATH પર લેબલને બદલવુ જોઇએ.
ja: $TARGET_PATH のラベルを同種のデバイスのタイプに変更する必要があります。
kn: $TARGET_PATH ನಲ್ಲಿ ಇದೇ ಬಗೆಯ ಒಂದು ಸಾಧನಕ್ಕಾಗಿ ಲೇಬಲ್ ಅನ್ನು ಬದಲಾಯಿಸುವ ಅಗತ್ಯವಿರುತ್ತದೆ.
or: ଏକା ପ୍ରକାର ଉପକରଣ ପାଇଁ ଆପଣଙ୍କୁ $TARGET_PATH ଉପରେ ନାମପଟିକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ହେବ।
te: $TARGET_PATH పైని లేబుల్‌ను అదేరకమైన పరికర రకమునకు మార్చాలి.
uk: Вам слід змінити мітку на $TARGET_PATH на мітку типу подібного пристрою.
zh_tw: 您需要將 $TARGET_PATH 上的標籤更改為相似裝置的類型。

source: Disable IPV6 properly.
as: IPV6 সঠিকভাৱে অসামৰ্থবান কৰক।
zh_tw: 適當停用 IPV6。

source: you want to disable IPV6 on this machine
as: আপুনি এই মেচিনত IPV6 অসামৰ্থবান কৰিব বিচাৰে
zh_tw: 您想要在此機器上停用 IPV6

source: you need to set /proc/sys/net/ipv6/conf/all/disable_ipv6 to 1 and do not blacklist the module'
as: আপুনি /proc/sys/net/ipv6/conf/all/disable_ipv6 to ক 1 লে সংহতি কৰিব লাগিব আৰু মডিউলক ব্লেকলিস্ট কৰিব লাগিব
zh_tw: 您需要將 /proc/sys/net/ipv6/conf/all/disable_ipv6 設為 1，並請勿將 module' 列入黑名單中

source: Add net.ipv6.conf.all.disable_ipv6 = 1 to /etc/sysctl.conf
as: net.ipv6.conf.all.disable_ipv6 = 1 ক /etc/sysctl.conf লে যোগ কৰক
zh_tw: 將 net.ipv6.conf.all.disable_ipv6 = 1 加入至 /etc/sysctl.conf

source: SELinux is preventing access to files with the label, file_t.
as: SELinux এ লেবেল, file_t থকা নথিপত্ৰসমূহলে অভিগম প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando el acceso a archivos con etiqueta file_t.
gu: SELinux એ file_t લેબલ સાથેની ફાઈલોના વપરાશથી બચાવી રહ્યું છે.
ja: SELinux は file_t ラベルが付いたファイルへのアクセスを阻止しています。
kn: file_t ಲೇಬಲ್ ಅನ್ನು ಹೊಂದಿರುವ ಕಡತಗಳನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳುವುದನ್ನು SELinux ತಡೆಯುತ್ತಿದೆ.
or: file_t.ସୂଚକ ଥିବା ଫାଇଲ ମାନଙ୍କୁ ଅଭିଗମ କରିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది, file_t లేబుల్‌తోవున్న ఫైళ్ళను యాక్సిస్ చేయుటనుండి నిరోదిస్తోంది.
uk: SELinux запобігає доступу до файлів з міткою file_t.
zh_tw: SELinux 防止存取含有 file_t 為標籤的檔案。

source: SELinux permission checks on files labeled file_t are being denied. file_t is the context the SELinux kernel gives to files that do not have a label. This indicates a serious labeling problem. No files on an SELinux box should ever be labeled file_t. If you have just added a disk drive to the system you can relabel it using the restorecon command. For example if you saved the home directory from a previous installation that did not use SELinux, 'restorecon -R -v /home' will fix the labels. Otherwise you should relabel the entire file system.
as: file_t লেবেল থকা নথিপত্ৰসমূহত SELinux অনুমতি নীৰিক্ষণসমূহ নাকচ কৰা হৈছে। file_t হল সেই পৰিপ্ৰেক্ষতিত যি SELinux কাৰ্নেলে লেবেল নথকা নথিপত্ৰসমূহলে দিয়ে। ই এটা গুৰুত্বপূৰ্ণ লেবেলিং সমস্যাৰ ইংগিত দিয়ে। SELinux বাকচত কোনো নথিপত্ৰক file_t লেবেল কৰিব নালাগিব। যদি আপুনি চিস্টেমত এটা ডিস্ক ড্ৰাইভ এইমাত্ৰ যোগ কৰিছে আপুনি ইয়াক restorecon কমান্ড ব্যৱহাৰ কৰি পুনৰলেবেল কৰিব পাৰিব। উদাহৰণস্বৰূপ যদি আপুনি ঘৰ ডাইৰেকটৰিক এটা পূৰ্ব ইনস্টল যি SELinux ব্যৱহাৰ কৰা নাই তাৰ পৰা সঞ্চয় কৰিছে, 'restorecon -R -v /home' এ সকলো লেবেল ঠিক কৰিব। আৰু নহলে আপুনি সম্পূৰ্ণ নথিপত্ৰ প্ৰণালী পুনৰলেবেল কৰিব লাগিব।
es: Están siendo negados los chequeos de permiso en archivos con etiqueta file_t a SELinux. file_t es el contexto que le da el kernel de SELinux a archivos que no tienen una etiqueta. Esto indica un problema serio de etiquetado. Ningún archivo debe poseer una etiqueta file_t. Si recientemente ha agregado un nuevo disco al sistema, puede reetiquetarlo usando el comando restorecon. Por ejemplo, si ha guardado el directorio /home de una instalación previa que no utilizaba SELinux, el comando 'restorecon -R -v /home' arreglará las etiquetas. En caso contrario, deberá reetiquetar a todo el sistema de archivos.
gu: SELinux પરવાનગી file_t લેબલવાળી ફાઈલો પર ચકાસણી કરે છે કે જે નામંજૂર થઈ ગયેલ છે. file_t એ સંદર્ભ છે કે જે SELinux કર્નલ ફાઈલોને આપે છે કે જેની પાસે લેબલ નથી. આ ગંભીર લેબલીંગ સમસ્યાને સૂચવે છે. SELinux બોક્સ પરની કોઈપણ ફાઈલો ક્યારેય file_t લેબલ થયેલ હોવી જોઈએ નહિં. જો તમે સિસ્ટમમાં ડિસ્ક ડ્રાઇવને ઉમેરેલ હોય તો તમે restorecon આદેશની મદદથી તેનું પુન:લેબલ કરી શકો છો. ઉદાહરણ માટે જો તમે પહેલાંના સ્થાપનમાંથી ઘર ડિરેક્ટરીને સંગ્રહેલ હોય કે જેને SELinux ને વાપર્યુ ન હતુ, 'restorecon -R -v /home' એ લેબલોને સુધારશે. નહિં તો તમે આખી ફાઇલ સિસ્ટમને પુન:લેબલ કરવુ જોઇએ.
ja: SELinux パーミッションは file_t のラベルが付いたファイルが拒否 されているかチェックします。file_t は、ラベルを持たいないファイルに 対して SELinux カーネルが与えるコンテキストです。これは深刻なラベル機能の 問題を示しています。SELinux ボックス上のファイルには file_t のラベル は絶対に付けられるべきではありません。システムに新しいディスクドライブ を追加したばかりの場合なら、 restorecon コマンドを使って再ラベルを行う ことができます。例えば、SELinux を使用していなかった以前のインストールから ホームディレクトリを保存した場合には、'restorecon -R -v /home' がラベルを 修正します。それ以外の場合は、ファイルシステム全体のラベル付け替えを行う必要が あります。
kn: file_t ಎಂದು ಲೇಬಲ್ ಮಾಡಲಾದ ಕಡತಗಳಿಗೆ SELinux ಅನುಮತಿ ಪರಿಶೀಲನೆಯು ನಿರಾಕರಿಸಲ್ಪಟ್ಟಿದೆ file_t ಎನ್ನುವುದು ಒಂದು ಲೇಬಲ್ ಇಲ್ಲದ ಕಡತಗಳಿಗೆ SELinux ಕರ್ನಲ್ ಒದಗಿಸಲ್ಪಡುವುದಾಗಿದೆ ಇದು ಒಂದು ದೊಡ್ಡದಾದ ಲೇಬಲಿಂಗ್ ತೊಂದರೆಯಾಗಿದೆ ಒಂದು SELinux ಬಾಕ್ಸ್‍ನಲ್ಲಿನ ಯಾವುದೆ ಕಡತವು file_t ನಿಂದ ಲೇಬಲ್ ಆಗಬಾರದು. ನೀವು ಈಗತಾನೆ ನಿಮ್ಮ ಗಣಕಕ್ಕೆ ಒಂದು ಹೊಸ ಡಿಸ್ಕ್‍ ಅನ್ನು ಸೇರಿಸಿದ್ದಲ್ಲಿ, ನೀವದನ್ನು restorecon ಆಜ್ಞೆಯನ್ನು ಉಪಯೋಗಿಸಿ ಮರು ಲೇಬಲ್ ಮಾಡಬಹುದಾಗಿದೆ. ಉದಾಹರಣೆಗೆ ನೀವು ನೆಲೆ ಕೋಶವನ್ನು SELinux ಬಳಸದೆ ಇರುವ ಹಿಂದಿನ ಅನುಸ್ಥಾಪನೆಯಿಂದ ಉಳಿಸಿಕೊಂಡಿದ್ದಲ್ಲಿ, 'restorecon -R -v /home' ಎನ್ನುವುದು ಲೇಬಲ್‌ಗಳನ್ನು ಸರಿಪಡಿಸುತ್ತದೆ. ಇಲ್ಲದೆ ಹೋದಲ್ಲಿ ನೀವು ಸಂಪೂರ್ಣ ಕಡತವ್ಯವಸ್ಥೆಯನ್ನು ಮರು ಲೇಬಲ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ.
or: SELinux ଅନୁମତି file_t ନାମରେ ନାମିତ ଫାଇଲଗୁଡ଼ିକର ଯାଞ୍ଚକୁ ବାରଣ କରିଥାଏ। file_t ଟି SELinux କର୍ଣ୍ଣଲକୁ ବିନା ନାମକରଣ ବିଶିଷ୍ଟ ଫାଇଲଗୁଡ଼ିକୁ ଦେଉଥିବା ପ୍ରସଙ୍ଗ। ଏହା ଏକ ବୃହତ ନାମକରଣ ସମସ୍ୟାକୁ ସୂଚାଇଥାଏ। SELinux ବାକ୍ସଟି file_t ନାମରେ ନାମିତ ହେବା ଉଚିତ। ଯଦି ଆପଣ ତନ୍ତ୍ରରେ ଏକ ଡିସ୍କ ଡ୍ରାଇଭ ଯୋଗ କରନ୍ତି ତେବେ ଆପଣ ଏହାକୁ restorecon ନିର୍ଦ୍ଦେଶ ବ୍ୟବହାର କରି ନାମକରଣ କରିପାରିବେ। ଉଦାହରଣ ସ୍ୱରୂପ ଯଦି ଆପଣ ହୋମ ଡିରେକ୍ଟୋରୀକୁ ପୂର୍ବ ସ୍ଥାପନାରୁ ସଂରକ୍ଷଣ କରନ୍ତି ଯାହାକି SELinux ବ୍ୟବହାର କରୁନଥିଲା, ତେବେ 'restorecon -R -v /home' ନାମପଟିକୁ ସମାଧାନ କରିବ। ଅନ୍ୟଥା ଆପଣ ସମଗ୍ର ଫାଇଲତନ୍ତ୍ରକୁ ନାମକରଣ କରନ୍ତୁ।
te: SELinux అనుమతి file_t లేబుల్‌తోవున్న ఫైళ్ళు తిరస్కరించ బడునట్లు చెక్‌చేస్తుంది. లేబుల్ లేని ఫైళ్ళకు SELinux కెర్నల్ యిచ్చే సంధర్బమే file_t. ఇది తీవ్రమైన లేబిలింగు సమస్యను సూచిస్తుంది. SELinux పెట్టెనందలి యేఫైళ్ళు యెప్పుడూ file_tతో లేబుల్ చేయకూడదు. మీరు సిస్టమ్‌కు డిస్కు డ్రైవ్‌ను జతపరిచివుంటే మీరు దానిని restorecon ఆదేశమును వుపయోగించి రీలేబుల్ చేయవచ్చు. ఉదాహరణకు మీరు SELinux వుపయోగించని గత సంస్థాపనననుండి హోమ్ డైరెక్టరీను దాచివుంటే, 'restorecon -R -v /home' అనునది లేబుల్సును పరిష్కరిస్తుంది. లేకపోతే మీరు మొత్తము ఫైలు వ్యవస్థను రీలేబుల్ చేయాలి.
uk: Спроби SELinux перевірити файли з позначками file_t не дозволяється. Контекст file_t призначається файлам ядром SELinux, якщо вони не мають позначок. Це серйозна проблема маркування. Файли не повинні бути позначені як file_t. Якщо ви додали новий диск, можна маркувати його командою restorecon. Наприклад, якщо ви зберегли домашній каталог з попереднього встановлення, яка не використовувало SELinux, для виправлення позначок виконайте «restorecon -R -v /home». У іншому випадку доведеться повторно розмітити всю файлову систему.
zh_tw: SELinux 許可設定會檢查被標記為 file_t 的檔案是否 有被拒絕。file_t 為 SELinux 內核給予沒有標籤的 檔案的情境。這顯示一項嚴重的標記 問題。SELinux box 上不該有任何檔案應被標記為 file_t。 若您剛在系統上新增新的磁碟，您可 透過使用 restorecon 指令來將它重新標記。比方說，若是您儲存一個 來自於先前未使用 SELinux 的版本的家目錄，'restorecon -R -v /home' 將可修正標籤。否則您應 將整個檔案系統重新標記。

source: You can execute the following command as root to relabel your computer system: "touch /.autorelabel; reboot"
as: আপুনি আপোনাৰ কমপিউটাৰ চিস্টেম পুনৰ লেবেল কৰিবলে নিম্নলিখিত কমান্ডক ৰুট হিচাপে প্ৰেৰণ কৰিব পাৰে: "touch /.autorelabel; reboot"
es: Puede ejecutar el siguiente comando como root para reetiquetar su sistema: "touch /.autorelabel; reboot"
gu: તમે તમારી કમ્પ્યૂટર સિસ્ટમનું પુનઃલેબલીકરણ કરવા માટે નીચેનો આદેશ રુટ તરીકે ચલાવી શકો છો: "touch /.autorelabel; reboot"
ja: root として次のコマンドを実行するとご使用のコンピュータを再ラベルする ことができます: "touch /.autorelabel; reboot"
kn: ನಿಮ್ಮ ಗಣಕ ವ್ಯವಸ್ಥೆಯನ್ನು ಮರುಲೇಬಲ್ ಮಾಡಲು ನೀವು ಈ ಕೆಳಗಿನ ಆಜ್ಞೆಯನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಬಹುದು: "touch /.autorelabel; reboot"
or: ଆପଣଙ୍କର କମ୍ପୁଟର ତନ୍ତ୍ରକୁ ପୁନଃ ନାମପଟିକରଣ କରିବା ପାଇଁ ମୂଖ୍ୟ ଚାଳକ ଭବାରେ ଆପଣ ନିମ୍ନଲିଖିତ ନିର୍ଦ୍ଦେଶକୁ ନିଷ୍ପାଦନ କରିପାରିବେ: "touch /.autorelabel; reboot"
te: మీరు ఈ క్రింది ఆదేశాన్ని రూట్‌గా మీ కంప్యూటర్ వ్యవస్థను చేరికకు నిర్వర్తించవచ్చు: "touch /.autorelabel; reboot"
uk: Виконайте наступну команду від імені користувача root для зміни маркування системи: «touch /.autorelabel; reboot»
zh_tw: 您可以 root 身份執行下列指令來重新標記您 的電腦系統：「touch /.autorelabel; reboot」

source: this is caused by a newly created file system.
as: এনে অৱস্থা এটা নতুনকে সৃষ্টি কৰা নথিপত্ৰ প্ৰণালীৰ বাবে হয়।
es: esto es causado por la creación de un nuevo sistema de archivos.
gu: આ નવી બનાવેલી ફાઇલ સિસ્ટમને કારણે છે.
ja: これは新規作成されたファイルシステムによって引き起こされたものです。
kn: ಇದಕ್ಕೆ ಕಾರಣ ಹೊಸತಾಗಿ ನಿರ್ಮಿಸಲಾದ ಕಡತ ವ್ಯವಸ್ಥೆ ಆಗಿರುತ್ತದೆ.
or: ଏହା ନୂତନ ଭାବରେ ନିର୍ମିତ ଫାଇଲତନ୍ତ୍ର ଦ୍ୱାରା ଘଟିଥାଏ।
te: ఇది కొత్తగా సృష్టించబడిన ఫైల్ సిస్టమ్ కారణంగా.
uk: це спричинено раніше створеною файловою системою.
zh_tw: 這是由新建的檔案系統造成。

source: you think this is caused by a badly mislabeled machine.
as: আপুনি ভাৱে ই এটা বেয়াকৈ ভুললেবেল কৰা মেচিনৰ বাবে হয়।
es: cree que esto es causado por una maquina muy mal etiquetada.
gu: તમે વિચારો આ ખરાબ રીતે મશીનને ખોટી રીતે લેબલ આપવાને કારણે થયેલ છે.
ja: これは間違ったラベルを付けられたマシンによって起こされました
kn: ಇದಕ್ಕೆ ಕಾರಣ ಹೊಸತಾಗಿ ನಿರ್ಮಿಸಲಾದ ಕಡತ ವ್ಯವಸ್ಥೆ ಆಗಿದೆ ಎಂದು ನೀವು ನಂಬುತ್ತೀರಿ.
or: ଆପଣ ଭାବୁଛନ୍ତିକି ଏହା ଭୁଲ ଭାବରେ ନାମକରଣ ହୋଇଥିବା ତନ୍ତ୍ର ଦ୍ୱାରା ଘଟିଛି।
te: ఇది చెడ్డగా లేబుల్ చేయబడిన మిషన్ కారణంగానని మీరు అనుకొనుచున్నారా.
uk: ви вважаєте, що причиною є помилкова мітка системи.
zh_tw: 您認為這是錯誤標記的機器所造成的。

source: you need to add labels to it.
as: আপুনি ইয়াত লেবেলসমূহ যোগ কৰিব লাগিব।
es: necesita agregarle etiquetas.
gu: તમારે તેમાં લેબલોને ઉમેરવાની જરૂર છે.
ja: これにラベルを追加する必要があります。
kn: ನೀವು ಅದಕ್ಕೆ ಲೇಬಲ್‌ಗಳನ್ನು ಸೇರಿಸುವ ಅಗತ್ಯವಿರುತ್ತದೆ.
or: ଆପଣଙ୍କୁ ଏଥିରେ ନାମପଟି ଲଗାଇବାକୁ ହେବ।
te: మీరు లేబుల్సును దీనికి జతచేయాలి.
uk: вам слід додати мітки до каталогу.
zh_tw: 您需要增加標籤。

source: you need to fully relabel.
as: আপুনি সম্পূৰ্ণভাৱে পুনৰ লেবেল কৰিব লাগিব।
es: necesita reetiquetar completamente.
gu: તમારે સંપૂર્ણ રીતે પુન:લેબલ કરવાની જરૂર છે.
ja: すべてにラベルを付け直す必要があります。
kn: ನೀವು ಸಂಪೂರ್ಣವಾಗಿ ಲೇಬಲ್ ಅನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ.
or: ଆପଣଙ୍କୁ ପୁଣିଥରେ ନାମପଟି ଲଗାଇବାକୁ ହେବ।
te: మీరు పూర్తి నమ్మకంగా వుండాలి.
uk: вам слід виконати повне перепризначення міток.
zh_tw: 您需要完整重新標記。

source: SELinux is preventing $SOURCE_PATH from creating a file with a context of $SOURCE_TYPE on a filesystem.
as: SELinux এ $SOURCE_PATH ক এটা নথিপত্ৰপ্ৰণালীত $SOURCE_TYPE ৰ এটা পৰিপ্ৰেক্ষতিতৰ সৈতে এটা নথিপত্ৰ সৃষ্টি কৰাৰ পৰা প্ৰতিৰোধ কৰি আছে।
es: SELinux está previniendo acerca de la intención de $SOURCE_PATH de crear un archivo con el contexto $SOURCE_TYPE en un sistema de archivo.
gu: SELinux એ $SOURCE_PATH ને ફાઈલસિસ્ટમ પર $SOURCE_TYPE ના સંદર્ભ સાથે ફાઈલ બનાવવાથી અટકાવી રહ્યું છે.
ja: SELinux は $SOURCE_PATH がファイルシステム上で $SOURCE_TYPE のコンテキストでファイルを作成することを阻止しています。
kn: ಒಂದು ಕಡತವ್ಯವಸ್ಥೆಯಲ್ಲಿ $SOURCE_TYPE ನ ಕಡತ ಸನ್ನಿವೇಶದೊಂದಿಗೆ $SOURCE_PATH ಒಂದು ಕಡತವನ್ನು ನಿರ್ಮಿಸುವುದನ್ನು SELinux ತಡೆಯುತ್ತಿದೆ.
or: SELinux $SOURCE_PATH କୁ ଗୋଟିଏ ଫାଇଲତନ୍ତ୍ରରେ $SOURCE_TYPE ପ୍ରସଙ୍ଗ ସହିତ ଗୋଟିଏ ଫାଇଲ ସୃଷ୍ଟି କରିବାରୁ ଅଟକାଉଛି।
te: ఫైలు వ్యవస్థనందు SELinux అనునది $SOURCE_PATHను $SOURCE_TYPE సందర్భంతో ఫైలును సృష్టించుటనుండి నిరోధిస్తుంది.
uk: SELinux забороняє $SOURCE_PATH створювати у файловій системі файл з контекстом $SOURCE_TYPE.
zh_tw: SELinux 防止 $SOURCE_PATH 在檔案系上建立一個情境為 $SOURCE_TYPE 的檔案。
