Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: you do not think $SOURCE_PATH should need to map stack memory that is both writable and executable.
as: আপুনি নাভাৱে $SOURCE_PATH এ স্টেক মেমৰি মেপ কৰিব লাগিব যি দুয়ো লিখিব আৰু প্ৰেৰণ কৰিব পৰা।
es: no cree que $SOURCE_PATH necesite mapear memoria acumulada que es tanto ejecutable como modificable.
gu: તમે એવુ ન વિચારો કે $SOURCE_PATH મૅપ સ્ટેક મેમરીની જરૂર હોવી જોઇએ કે જે બંને લખી શકાય અને ચલાવી શકાય તેવી છે.
ja: $SOURCE_PATH が stack メモリを map する必要はありません。 stack メモリは書込み可能で、実行可能です
kn: ಬರೆಯಬಹುದಾದ ಹಾಗು ಕಾರ್ಯಗತಗೊಳಿಸಬಹುದಾದಂತಹ ಮೆಮೊರಿ ಸ್ಟ್ಯಾಕ್‌ಗೆ $SOURCE_PATH ಮ್ಯಾಪ್ ಮಾಡುವ ಅಗತ್ಯವಿದೆಯೆಂದು ನಿಮಗೆ ಅನ್ನಿಸುವುದಿಲ್ಲ.
or: ଆପଣ ଭାବୁନାହାନ୍ତି କି $SOURCE_PATH ଷ୍ଟାକ ସ୍ମୃତିସ୍ଥାନକୁ ଆବଶ୍ୟକ କରିବା ଉଚିତ ଯାହାକି ଉଭୟ ଲେଖାଯୋଗ୍ୟ ଏବଂ ନିଷ୍ପାଦନଯୋଗ୍ୟ।
te: వ్రాయదగిన మరియు నిర్వర్తించదగిన స్టాక్ మెమొరీకు $SOURCE_PATH ను మాప్ చేయాలని మీరు అనుకోవడంలా.
uk: вам здається, що $SOURCE_PATH не повинна відображати пам’ять стека для запису і виконання коду.
zh_tw: 您不認為 $SOURCE_PATH 需要映射可寫入和可執行的堆疊記憶體（stack memory）。

source: you need to report a bug. This is a potentially dangerous access.
as: আপুনি এটা বাগ জমা দিব লাগিব। ই বিভৱীয়ভাৱে বিপদজনক অভিগম।
es: necesita reportar un error. Este es un acceso potencialmente peligroso.
gu: તમારે ભૂલનો અહેવાલ કરવાની જરૂર છે. આ ખતરનાક પ્રવેશ છે.
ja: バグをレポートする必要があります。 これは危険なアクセスです。
kn: ನೀವು ಒಂದು ದೋಷವನ್ನು ವರದಿ ಮಾಡಬೇಕಾಗುತ್ತದೆ. ಇದು ಒಂದು ಅಪಾಯಕಾರಿಯಾದ ನಿಲುಕಣೆ.
uk: вам слід повідомити про ваду. Такий доступ є потенційно небезпечним.
zh_tw: 您需要提交錯誤報告。 這是一項高風險的存取。

source: you believe that %s should not require execstack
as: আপুনি ভাৱে যে %s ৰ execstack ৰ প্ৰয়োজন হব নালাগে
es: cree que no debería %s necesitar execstack
gu: તમે મોનો છો %s ને execstack ની જરૂર હોવી જોઇએ નહિં
ja: %s は execstack を必要としないと信じています
kn: %s ಕ್ಕಾಗಿ execstack ನ ಅಗತ್ಯವಿದೆ ಎಂದು ನೀವು ನಂಬುವುದಿಲ್ಲ
uk: вам здається, що для %s не потрібен стек виконання
zh_tw: 您認為 %s 不需要 execstack

source: you should clear the execstack flag and see if $SOURCE_PATH works correctly. Report this as a bug on %s. You can clear the exestack flag by executing:
as: আপুনি execstack ফ্লেগ পৰিষ্কাৰ কৰি চাব লাগে যদি $SOURCE_PATH সঠিকভাৱে কাৰ্য্য কৰে। ইয়াক %s ত এটা বাগ হিচাপে সংবাদ কৰক। আপুনি exestack ফ্লেগক পৰিষ্কাৰ কৰিব পাৰিব প্ৰেৰণ কৰি:
es: debería despejar la marca execstack y verificar que $SOURCE_PATH esté funcionando correctamente. Reporte esto como un error en %s. Puede despejar la marca execstack ejecutando:
gu: તમારે execstack ફ્લેગ ને સાફ કરવુ જોઇએ અને જુઓ જો $SOURCE_PATH યોગ્ય રીતે કામ કરે છે. %s પર ભૂલ તરીકે આનો અહેવાલ કરો. તમારે ચલાવીને exestack ફ્લેગને સાફ કરી શકો છો:
ja: execstack フラグをクリアして $SOURCE_PATH が正常に機能していることを確認する必要があります。 これは %s のバグとして報告します。 あなたは以下の実行による execstack フラグをクリアすることができます。
kn: execstack ಫ್ಲ್ಯಾಗ್ ಅನ್ನು ತೆರವುಗೊಳಿಸಬೇಕು ಹಾಗು $SOURCE_PATH ಸರಿಯಾಗಿ ಕೆಲಸ ಮಾಡುತ್ತದೆಯೆ ಎಂದು ನೋಡಬೇಕು. %s ಅನ್ನು ಇದನ್ನು ಒಂದು ದೋಷ ವರದಿಯಾಗಿ ಸಲ್ಲಿಸಿ. ಇದನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ exestack ಫ್ಲ್ಯಾಗ್ ಅನ್ನು ತೆರವುಗೊಳಿಸಿ:
uk: вам слід зробити нульовим значення параметра execstack і переконатися, що $SOURCE_PATH працює належним чином. Повідомте про цю ваду за адресою %s. Спорожнити прапорець стека виконання можна командою:
zh_tw: 您應清除 execstack 旗標，並查看 $SOURCE_PATH 是否能正常運作。 請將此作為錯誤提交至 %s。 您可藉由執行以下指令清除 exestack 旗標：

source: SELinux prevented the ftp daemon from $ACCESS files stored on a CIFS filesystem.
as: SELinux এ ftp ডিমনক এটা CIFS নথিপত্ৰপ্ৰণালীত সংৰক্ষিত নথিপত্ৰসমূহ $ACCESS ৰ পৰা প্ৰতিৰোধ কৰিলে।
es: SELinux evitó que el demonio ftp $ACCESS archivos almacenados en un sistema de archivo CIFS.
gu: SELinux એ ftp ડિમનને $ACCESS ફાઈલો કે જે CIFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ છે તેનાથી અટકાવેલ છે.
ja: SELinux は ftp デーモンが $ACCESS から CIFS ファイルシステム上に保存されているファイルへのアクセスを阻止しました。
kn: ftp ಡೆಮನ್ ಅನ್ನು CIFS ಕಡತವ್ಯವಸ್ಥೆಯಲ್ಲಿ ಶೇಖರಿಸಲ್ಪಟ್ಟ $ACCESS ಕಡತಗಳನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ SELinux ತಡೆದಿದೆ.
uk: SELinux блокує службу ftp від $ACCESS файлів файлової системі CIFS.
zh_tw: SELinux 防止 ftp 幕後程式 $ACCESS 檔案儲存於 CIFS 檔案系統。

source: SELinux prevented the ftp daemon from $ACCESS files stored on a CIFS filesystem. CIFS (Comment Internet File System) is a network filesystem similar to SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) The ftp daemon attempted to read one or more files or directories from a mounted filesystem of this type. As CIFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the ftp daemon to read files from a CIFS filesystem this access attempt could signal an intrusion attempt.
as: SELinux এ ftp ডিমনক এটা CIFS নথিপত্ৰপ্ৰণালীত সংৰক্ষিত নথিপত্ৰসমূহ $ACCESS কৰাৰ পৰা প্ৰতিৰোধ কৰে। CIFS (মন্তব্য ইন্টাৰনেট নথিপত্ৰ প্ৰণালী) SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) ৰ সৈতে সদৃশ এটা নথিপত্ৰপ্ৰণালী। ftp ডিমনে এই ধৰণৰ এটা মাউন্ট কৰা নথিপত্ৰপ্ৰণালীৰ পৰা এটা বা অধিক নথিপত্ৰ অথবা ডাইৰেকটৰি পৰাৰ চেষ্টা কৰিছিল। যিহেতু CIFS নথিপত্ৰপ্ৰণালীসমূহে একদম সঠিক SELinux লেবেলিং সমৰ্থন নকৰে, নথিপত্ৰপ্ৰণালীৰ সকলো নথিপত্ৰ আৰু ডাইৰেকটৰিৰ একেটা সুৰক্ষা পৰিপ্ৰেক্ষতিত থাকিব। যদি আপুনি ftp ডিমনক এটা CIFS নথিপত্ৰপ্ৰণালীৰ পৰা নথিপত্ৰসমূহ পঢ়িবলে সংৰূপণ কৰা নাই এই অভিগমৰ চেষ্টায় এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে।
es: SELinux previno acerca de la intención del demonio ftp de $ACCESS archivos almacenados en un sistema de archivos CIFS. CIFS (Sistema de Archivos de Comentarios de Internet) es un sistema de archivo de red similar a SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) El demonio ftp intentó leer uno o más archivos o directorios de un sistema de archivos montando de ese tipo. Como los sistemas de archivos CIFS no dan soporte adecuado al etiquetado SELinux, todos los archivos y directorios en el sistema de archivo tendrán el mismo contexto de seguridad. Si no configuró al demonio ftp para leer archivos de un sistema de archivos CIFS, este intento de acceso puede ser señal de un ataque.
gu: SELinux એ ftp ડિમનને CIFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોથી બચાવેલ છે. CIFS (Comment Internet File System) એ SMB જેવી જ નેટવર્ક ફાઈલસિસ્ટમ છે (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) ftp ડિમને આ પ્રકારની માઉન્ટ થયેલ ફાઈલસિસ્ટમની એક અથવા વધુ ફાઈલો અથવા ડિરેક્ટરીઓમાંથી વાંચવાનું પસંદ કરેલ છે. CIFS ફાઈલસિસ્ટમો fine-grained SELinux લેબલીંગને આધાર આપતું નહિં હોવાથી, ફાઈલસિસ્ટમમાંની બધી ફાઈલો અને ડિરેક્ટરીઓને એવો જ સુરક્ષા સંદર્ભ હોવો જોઈએ. CIFS ફાઈલસિસ્ટમમાંથી ફાઈલો વાંચવા માટે જો તમે ftp ડિમનને રૂપરેખાંકિત કરેલ નહિં હોય તો આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હશે.
ja: SELinux は CIFS ファイルシステムに格納されているファイルが ftp デーモンによって $ACCESS されるのを阻止しました。 CIFS (Comment Internet File System) は SMB と同様のネットワークファイルシステムです、 (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>)。 ftp デーモンはマウントされているこのタイプのファイルシステムから 1 つまたは複数の ファイルかディレクトリーを読み込もうとしました。 CIFS ファイルシステムは SELinux の 詳細なラベル機能はサポートしていません。ファイルシステム内のファイル及びディレクトリーはすべて 同じセキュリティーコンテキストを有することになります。 ftp デーモンが CIFS ファイルシステムからファイルを読み込むよう設定してない場合、 このアクセス試行は不正侵入の試行を示している可能性があります。
kn: ftp ಡೆಮನ್ ಅನ್ನು CIFS ಕಡತವ್ಯವಸ್ಥೆಯಲ್ಲಿ ಶೇಖರಿಸಲ್ಪಟ್ಟ $ACCESS ಕಡತಗಳನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ SELinux ತಡೆದಿದೆ. CIFS (Comment Internet File System) ಯು SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) ನಂತಹ ಒಂದು ಜಾಲಬಂಧ ಕಡತ ವ್ಯವಸ್ಥೆಯಾಗಿದೆ. ftp ಡೆಮನ್ ಆರೋಹಿಸಲಾದ ಈ ಬಗೆಯ ಒಂದು ಕಡತ ವ್ಯವಸ್ಥೆಯಿಂದ ಒಂದು ಅಥವ ಹೆಚ್ಚಿನ ಕಡತಗಳನ್ನು ಅಥವ ಕಡತಕೋಶಗಳನ್ನು ಓದಲು ಪ್ರಯತ್ನಿಸಿದೆ. ಆದರೆ CIFS ಕಡತ ವ್ಯವಸ್ಥೆಗಳು ಸೂಕ್ಷ್ಮ-ಗ್ರೈನ್ ಮಾಡಲಾದ SELinux ಲೇಬಲ್ ಮಾಡುವಿಕೆಯನ್ನು ಬೆಂಬಲಿಸುವುದಿಲ್ಲವಾದ್ದರಿಂದ, ಕಡತವ್ಯವಸ್ಥೆಯಲ್ಲಿನ ಎಲ್ಲಾ ಕಡತ ಹಾಗು ಕಡತಕೋಶಗಳು ಒಂದೇ ರೀತಿಯ ಸುರಕ್ಷತಾ ಸನ್ನಿವೇಶಗಳನ್ನು ಹೊಂದಿರುತ್ತದೆ ನೀವು ftp ಡೆಮನ್ ಅನ್ನು CIFS ಕಡತ ವ್ಯವಸ್ಥೆಯಿಂದ ಕಡತಗಳನ್ನು ಓದುವಂತೆ ಸಂರಚಿಸದೆ ಹೋಗಿದ್ದರೆ, ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲ್ಪಡುತ್ತದೆ.
or: SELinux ftp ଡେମନକୁ CIFS ରେ ରଖାଯାଇଥିବା $ACCESS ଫାଇଲତନ୍ତ୍ର ପାଖରୁ ସୁରକ୍ଷା ପ୍ରଦାନ କରିଥାଏ। CIFS (Comment Internet File System) ଟି ଗୋଟିଏ ନେଟୱର୍କ ଫାଇଲ ତନ୍ତ୍ର SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) ftp ଡେମନ ସ୍ଥାପିତ ଫାଇଲତନ୍ତ୍ରରୁ ଗୋଟିଏ କିମ୍ବା ଅଧିକ ଫାଇଲ କିମ୍ବା ଡିରେକ୍ଟୋରୀ ପଢ଼ିବା ପାଇଁ ଚେଷ୍ଟାକରିଥାଏ। CIFS ଫାଇଲ ତନ୍ତ୍ର SELinux ନାମପଟିକରଣକୁ ସମର୍ଥନ କରେନାହିଁ, ଫାଇଲତନ୍ତ୍ରରେ ଥିବା ସମସ୍ତ ଫାଇଲ ଏବଂ ଡିରେକ୍ଟୋରୀ ପାଖରେ ସମାନ ସୁରକ୍ଷା ପ୍ରସଙ୍ଗ ଥିବା ଉଚିତ। ଯଦି ଆପଣ ସେହି ftp ଡେମନକୁ ବିନ୍ୟାସ ନକରନ୍ତି ତେବେ ତାହା CIFS ଫାଇଲତନ୍ତ୍ରରେ ଏହାକୁ ଅଭିଗମ୍ୟ କରିବା ପାଇଁ ଚେଷ୍ଟା କରିଥାଏ।
te: SELinux అనునది ftp డెమోన్‌ను CIFS దస్త్రవ్యవస్థ నందలినిల్వవున్న $ACCESS దస్త్రములనుండి నిరోదిస్తుంది. CIFS (Comment Internet File System) అనునది నెట్వర్క్‍ దస్త్రవ్యవస్థ ఏదైతే దీనికి సమానమో SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) ftp డెమోన్ అనునది ఈ రకము యొక్క మౌంటెడ్ దస్త్రవ్యవస్థ నుండి ఒకటి లేదా ఎక్కువ దస్త్రములు లేదా సంచయాలను చదువుటకు ప్రయత్నిస్తోంది. CIFS దస్త్రవ్యవస్థలాగా fine-grained SELinux లేబులింగ్‌ను మద్దతునీయదు, అన్ని దస్త్రములు మరియు సంచయాలు ఈ దస్త్రవ్యవస్థలోనివి ఒకే రక్షణ సందర్భంను కలిగివుంటాయి. మీరు ftp డెమోన్‌ను CIFS దస్త్రవ్యవస్థ నుండి దస్త్రములను చదువుటకు ఆకృతీకరించకపోతే వాడుక యత్నము అమర్యాద యత్నమును సూచిస్తుంది.
uk: SELinux заборонила службі ftp $ACCESS для файлам на CIFS розділі. CIFS (Comment Internet File System) - мережна файлова система, аналогічна SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) Служба ftp намагається прочитати вміст підключеної системи цього типу. Оскільки система CIFS не підтримує низькорівневе встановлення позначок SELinux, усі файли та каталоги мають однаковий контекст безпеки. Якщо ви не налаштовували службу ftp на читання файлів з CIFS, ця спроба отримати доступ можливо є вторгненням.
zh_tw: SELinux 防止 ftp 幕後程式 $ACCESS 儲存於 CIFS 檔案系統上的檔案。 CIFS（Comment Internet File System）是個和 SMB 相似的網路檔案系統 （<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>） ftp 幕後程式嘗試由一個此類型的已掛載檔案系統 讀取一個或更多個檔案或目錄。因為 CIFS 檔案系統不支援 fine-grained 的 SELinux 標記，因此所有檔案系統中的 檔案和目錄都會擁有相同的安全情境。 若您並未設定 ftp 幕後程式來讀取 CIFS 檔案系統中的檔案的話， 此存取代表系統可能已遭到嘗試入侵的警訊。

source: Changing the "$BOOLEAN" boolean to true will allow this access: "setsebool -P $BOOLEAN=1."
as: "$BOOLEAN" বুলিয়ানক true লে সলনি কৰিলে এই অভিগমৰ অনুমতি পোৱা যাব: "setsebool -P $BOOLEAN=1।"
es: Cambiando el valor booleano "$BOOLEAN" a verdadero permitirá este acceso: "setsebool -P $BOOLEAN=1."
gu: "$BOOLEAN" બુલિયન કિંમતને ખરામાં બદલવાનું આ વપરાશને માન્ય કરશે: "setsebool -P $BOOLEAN=1."
ja: "$BOOLEAN" ブーリアンを 「true」に変更するとこのアクセスを許可します: "setsebool -P $BOOLEAN=1."
kn: "$BOOLEAN"ಬೂಲಿಯನ್ ಅನ್ನುನಿಜಕ್ಕೆ ಬದಲಾಯಿಸುವುದರಿಂದ ಈ ಅನುಮತಿ ನೀಡಲ್ಪಡುತ್ತದೆ: "setsebool -P $BOOLEAN=1."
or: "$BOOLEAN" ବୁଲିଆନ ମୂଲ୍ଯକୁ true କରିଲେ, ଏହା ଏହି ଅଭିଗମକୁ ସ୍ବୀକାର କରିବ: "setsebool -P $BOOLEAN=1."
te: "$BOOLEAN" ను బూలియన్‌ నుండి సత్యంకు మార్చుట ఈ వాడుకనుఅనుమతిస్తుంది: "setsebool -P $BOOLEAN=1."
uk: Встановлення логічного значення "$BOOLEAN" у TRUE дозволить доступ: «setsebool -P $BOOLEAN=1»
zh_tw: 將「$BOOLEAN」布林值更改為 true 將會允許此存取： 「setsebool -P $BOOLEAN=1。」

source: Changing the "$BOOLEAN" and "$WRITE_BOOLEAN" booleans to true will allow this access: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". warning: setting the "$WRITE_BOOLEAN" boolean to true will allow the ftp daemon to write to all public content (files and directories with type public_content_t) in addition to writing to files and directories on CIFS filesystems.
as: "$BOOLEAN" আৰু "$WRITE_BOOLEAN" বুলিয়ানসমূহক true লে সলনি কৰিলে অভিগম পোৱা যাব: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". সতৰ্কবাৰ্তা: "$WRITE_BOOLEAN" বুলিয়ানক true লে সংহতি কৰিলে ftp ডিমনক সকলো ৰাজহুৱা বিষয়বস্তুলে (ধৰণ public_content_t ৰ সৈতে নথিপত্ৰসমূহ আৰু ডাইৰেকটৰিসমূহ ) লিখাৰ অনুমতি দিয়া হব CIFS নথিপত্ৰপ্ৰণালীসমূহত নথিপত্ৰসমূহ আৰু ডাইৰেকটৰিসমূহলে লিখাৰ অতিৰিক্তে।
es: Cambiando los booleanos "$BOOLEAN" and "$WRITE_BOOLEAN" a 1 permitirá este acceso: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". Advertencia: poner el valor de "$WRITE_BOOLEAN" a 1 permitirá al demonio ftp escribir a todo el contenido público (archivos y directorios con el tipo public_content_t) además de escribir a archivos y directorios en sistemas de archivos CIFS.
gu: "$BOOLEAN" અને "$WRITE_BOOLEAN" બુલિયનોને ખરામાં બદલવાનું આ વપરાશની પરવાનગી આપશે: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". ચેતવણી: "$WRITE_BOOLEAN" બુલિયનને ખરામાં સુયોજિત કરવાનું ftp ડિમનને બધા જાહેર સમાવિષ્ટો (public_content_t પ્રકાર સાથેની ફાઈલો અને ડિરેક્ટરીઓ) માં લખવાની પરવાનગી આપશે CIFS ફાઈલસિસ્ટમો પર ફાઈલો અને ડિરેક્ટરીઓ પર લખવા સાથે વધુમાં.
ja: "$BOOLEAN" 及び "$WRITE_BOOLEAN" のブーリアンを true に変更するとこのアクセスが許可されます: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1" 警告: "$WRITE_BOOLEAN" ブーリアンを true に設定すると、 CIFS ファイルシステム上のファイルやディレクトリーへの書き込みに加えてすべて のパブリックコンテント(タイプ public_content_t のファイル及びディレクトリー) への書き込みを ftp デーモンに許可することになります。
kn: "$BOOLEAN" ಹಾಗು "$WRITE_BOOLEAN" ಬೂಲಿಯನ್‍ಗಳನ್ನು ನಿಜಕ್ಕೆ ಬದಲಾಯಿಸುವುದರಿಂದ ಅದು ಈ ನಿಲುಕನ್ನು ಅನುಮತಿಸುತ್ತದೆ: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". ಎಚ್ಚರಿಕೆ: "$WRITE_BOOLEAN" ಬೂಲಿಯನ್‍ಗಳನ್ನು ನಿಜಕ್ಕೆ ಹೊಂದಿಸುವುದರಿಂದ ftp ಡೆಮನ್‍ಗೆ CIFS ಕಡತ ವ್ಯವಸ್ಥೆಗಳಲ್ಲಿನ ಕಡತಗಳು ಹಾಗು ಕಡತಕೋಶಗಳ ಜೊತೆಗೆ ಎಲ್ಲಾ ಸಾರ್ವಜನಿಕ ವಿಷಯಗಳನ್ನು (public_content_t ಬಗೆಯ ಕಡತಗಳು ಹಾಗು ಕಡತಕೋಶಗಳು) ಬರೆಯಲು ಅನುಮತಿಯನ್ನು ಒದಗಿಸುತ್ತದೆ.
or: "$BOOLEAN" କୁ ପରିବର୍ତ୍ତନ କରି ଏବଂ "$WRITE_BOOLEAN" ବୁଲିଆନକୁ true ଭାବରେ ମୂଲ୍ୟାଙ୍କନ କରି ଏହି ଅଭିଗମ୍ୟତାକୁ ଅନୁମତି ଦେଇଥାଏ: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". ଚେତାବନୀ: "$WRITE_BOOLEAN" କୁ ବୁଲିଆନ ଭାବରେ ବିନ୍ୟାସ କରି ftp ଡେମନକୁ ଅନୁମତି ଦେଇଥାଏ (public_content_t ପରି ଫାଇଲ ଏବଂ ଡିରେକ୍ଟୋରୀ) ଏହା ସହିତ CIFS ଫାଇଲତନ୍ତ୍ରରେ ଫାଇଲ ଏବଂ ଡ଼ିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ଲେଖିଥାଏ।
te: "$BOOLEAN" మరియు "$WRITE_BOOLEAN" బూలియన్స్‍‌ను సత్యంకు మార్చుట ఈ అనుమతిని అనుమతిస్తుంది: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". హెచ్చరిక: "$WRITE_BOOLEAN" బూలియన్‌ను సత్యంకు అమర్చుట ftp డెమోన్‌ను అన్ని పబ్లిక్ సారాలను (దస్త్రములు మరియు సంచయాలు public_content_t రకంతో వున్నవి) వ్రాయుటకు అనుమతిస్తుంది CIFS దస్త్రవ్యవస్థ పైని దస్త్రాలను మరియు సంచయాలకు వ్రాయుటకు బదులుగా.
uk: Зміна ознак "$BOOLEAN" та "$WRITE_BOOLEAN" у TRUE відкриє доступ: «setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1». Увага: встановлення ознаки "$WRITE_BOOLEAN" у TRUE дозволить службі ftp записувати в усі спільні ресурси (файли, каталоги типу public_content_t) окрім запису у файли та каталоги файлових систем CIFS.
zh_tw: 若將「$BOOLEAN」和 「$WRITE_BOOLEAN」布林值更改為 true 的話將可允許此存取： 「setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1」。 警告：若將「$WRITE_BOOLEAN」布林值設為 true 的話將會 允許 ftp 幕後程式除寫入 CIFS 檔案系統上的檔案與目錄之外，還可對所有的公用內容進行寫入 (類型為 public_content_t 的檔案 和目錄)。

source: you want to allow ftpd to write to cifs file systems
as: আপুনি ftpd ক cifs নথিপত্ৰপ্ৰণালীসমূহলে লিখাৰ অনুমতি দিব বিচাৰে
es: desea permitir que ftpd escriba sobre sistemas de archivos cifs
gu: તમે cifs ફાઇલ સિસ્ટમોને લખવા માટે ftpd ને પરવાનગી આપવા માંગો છો
ja: ftpdが、cifs ファイルシステムに書込むことを、許可したい
kn: cifs ಕಡತ ವ್ಯವಸ್ಥೆಗಳಿಗೆ ಬರೆಯುವಂತೆ ನೀವು ftpd ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಿ
or: ଆପଣ ftpd କୁ cifs ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు ftpd ను cifs ఫైల్ సిస్టమ్సుకు వ్రాయుటకు అనుమతించాలని అనుకొనుచున్నారా
uk: ви маєте намір дозволити ftpd виконувати запис до файлових систем cifs
zh_tw: 您需要允許 ftpd 以寫入 cifs 檔案系統

source: you must tell SELinux about this
as: আপুনি SELinux ক ইয়াৰ বিষয়ে সূচীত কৰিব লাগে
es: debe informar de esto a SELinux
gu: તમારે આના વિશે SELinux ને કહેવુ જ જોઇએ
ja: これについては、SELinux に設定をしなければいけません
kn: ನೀವು SELinux ಗೆ ಇದರ ಬಗ್ಗೆ ಹೇಳಬೇಕು
or: ଆପଣ SELinux କୁ ଏହା ବିଷୟରେ କହିବା ଉଚିତ
te: మీరు SELinuxకు దీని గురించి తప్పక తెలుపవలెను
uk: вам слід повідомити про це SELinux
zh_tw: 您必須告知 SELinux

source: SELinux prevented the ftp daemon from $ACCESS files stored on a NFS filesystem.
as: SELinux এ ftp ডিমনক এটা NFS নথিপত্ৰপ্ৰণালীত সংৰক্ষিত নথিপত্ৰসমূহ $ACCESS ৰ পৰা প্ৰতিৰোধ কৰিলে।
es: SELinux negó al demonio ftp $ACCESS a archivos almacenados en un sistema de archivos NFS.
gu: SELinux એ ftp ડિમનને NFS ફાઇલસિસ્ટમ પર સંગ્રહ થયેલ $ACCESS ફાઈલોમાંથી ftp ડિમનને અટકાવેલ છે.
ja: SELinux は ftp デーモンが $ACCESS から NFS ファイルシステム上に保存されているファイルへのアクセスを阻止しました。
kn: ftp ಡೆಮನ್ ಅನ್ನು ಒಂದು NFS ಕಡತವ್ಯವಸ್ಥೆಯಲ್ಲಿ ಶೇಖರಿಸಲ್ಪಟ್ಟ $ACCESS ಕಡತಗಳನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ SELinux ತಡೆದಿದೆ.
uk: SELinux заборонила доступ $ACCESS службі ftp до файлів системи NFS.
zh_tw: SELinux 防止 ftp 幕後程式 $ACCESS 檔案儲存於 NFS 檔案系統。

source: SELinux prevented the ftp daemon from $ACCESS files stored on a NFS filesystem. NFS (Network Filesystem) is a network filesystem commonly used on Unix / Linux systems. The ftp daemon attempted to read one or more files or directories from a mounted filesystem of this type. As NFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the ftp daemon to read files from a NFS filesystem this access attempt could signal an intrusion attempt.
as: SELinux এ ftp ডিমনক এটা NFS নথিপত্ৰপ্ৰণালীত সংৰক্ষিত নথিপত্ৰসমূহলে $ACCESS প্ৰতিৰোধ কৰিলে। NFS (নেটৱাৰ্ক নথিপত্ৰপ্ৰণালী) এটা নেটৱাৰ্ক নথিপত্ৰপ্ৰণালী যাক সাধাৰণত Unix / Linux চিস্টেমসমূহত ব্যৱহাৰ কৰা হয়। ftp ডিমনে এই ধৰণৰ এটা মাউন্ট কৰা নথিপত্ৰপ্ৰণালীৰ পৰা এটা বা অধিক নথিপত্ৰসমূহ অথবা ডাইৰেকটৰিসমূহ পঢ়াৰ চেষ্টা কৰিলে। যিহেতু NFS নথিপত্ৰপ্ৰণালীসমূহে একদম-সঠিক SELinux লেবেলিং সমৰ্থন নকৰে, নথিপত্ৰপ্ৰণালীৰ সকলো নথিপত্ৰ আৰু ডাইৰেকটৰিৰ একেটা সুৰক্ষা পৰিপ্ৰেক্ষতিত থাকিব। যদি আপুনি ftp ডিমনক এটা NFS নথিপত্ৰপ্ৰণালীৰ পৰা নথিপত্ৰসমূহ পঢ়াৰ বাবে সংৰূপণ কৰা নাই এই অভিগমৰ চেষ্টায় এটা অনাধিকাৰ প্ৰৱোশৰ ইংগিত দিব পাৰে।
es: SELinux previno acerca de la intención del demonio ftp de $ACCESS archivos almacenados en un sistema de archivos NFS. NFS (Sistema de Archivo de Red) es un sistema de archivo de red comúnmente usado en sistemas Unix/Linux El demonio ftp intentó leer uno o mas archivos o directorios desde un sistema de archivo de este tipo montando. Como los sistemas de archivos NFS no dan soporte a un etiquetado de archivo más fino, todos los archivos y directorios en el sistema de archivo tendrán el mismo contexto de seguridad. Si no ha configurado al demonio ftp para leer archivos en un sistema de archivo NFS, este acceso puede estar indicando un intento de ataque.
gu: SELinux એ ftp ડિમનને NFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોમાંથી લખવાથી બચાવેલ છે. NFS (Network Filesystem) એ Unix / Linux સિસ્ટમો પર સામાન્ય રીતે વાપરવામાં આવતી નેટવર્ક ફાઈલસિસ્ટમ છે. ftp ડિમને આ પ્રકારની માઉન્ટ થયેલ ફાઈલસિસ્ટમમાંથી એક અથવા વધુ ફાઈલો અથવા ડિરેક્ટરીઓ વાંચવાનું પસંદ કરેલ છે. NFS ફાઈલસિસ્ટમો fine-grained SELinux લેબલીંગને આધાર આપતું નહિં હોવાથી, ફાઈલસિસ્ટમમાંની બધી ફાઈલો અને ડિરેક્ટરીઓને સરખો સુરક્ષા સંદર્ભ હશે. જો તમે ftp ડિમનને NFS ફાઈલસિસ્ટમમાંથી ફાઈલો વાંચવા માટે રૂપરેખાંકિત નહિં કરેલ હોય તો આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.
ja: SELinux は NFS ファイルシステムに格納されているファイルに ftp が $ACCESS するのを阻止しました。 NFS (Network Filesystem) は Unix システム/ Linux システムで一般的に使用されるネットワーク ファイルシステムです。 ftp デーモンはマウントされているこのタイプのファイルシステムから 1 つまたは複数の ファイルかディレクトリーを読み込もうとしました。 NFS ファイルシステムは SELinux の詳細な ラベル機能はサポートしていないため、 ファイルシステム内のファイル及びディレクトリーはすべて 同じセキュリティーコンテキストを有することになります。 ftp デーモンが NFS ファイルシステムからファイルを読み込むよう設定してない場合、 このアクセス試行は不正侵入の試行を示している可能性があります。
kn: ftp ಡೆಮನ್ ಅನ್ನು ಒಂದು NFS ಕಡತವ್ಯವಸ್ಥೆಯಲ್ಲಿ ಶೇಖರಿಸಲ್ಪಟ್ಟ $ACCESS ಕಡತಗಳನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ SELinux ತಡೆದಿದೆ. NFS (Network Filesystem) Unix / Linux ನಲ್ಲಿ ಸಾಮಾನ್ಯವಾಗಿ ಬಳಸಲ್ಪಡುವ ಒಂದು ಜಾಲಬಂಧ ಕಡತ ವ್ಯವಸ್ಥೆ ftp ಡೆಮನ್ ಆರೋಹಿಸಲಾದ ಈ ಬಗೆಯ ಒಂದು ಕಡತ ವ್ಯವಸ್ಥೆಯಿಂದ ಒಂದು ಅಥವ ಹೆಚ್ಚಿನ ಕಡತಗಳನ್ನು ಅಥವ ಕಡತಕೋಶಗಳನ್ನು ಓದಲು ಪ್ರಯತ್ನಿಸಿದೆ. ಆದರೆ NFS ಕಡತ ವ್ಯವಸ್ಥೆಗಳು ಸೂಕ್ಷ್ಮ-ಗ್ರೈನ್ ಮಾಡಲಾದ SELinux ಲೇಬಲ್ ಮಾಡುವಿಕೆಯನ್ನು ಬೆಂಬಲಿಸುವುದಿಲ್ಲವಾದ್ದರಿಂದ, ಕಡತವ್ಯವಸ್ಥೆಯಲ್ಲಿನ ಎಲ್ಲಾ ಕಡತ ಹಾಗು ಕಡತಕೋಶಗಳು ಒಂದೇ ರೀತಿಯ ಸುರಕ್ಷತಾ ಸನ್ನಿವೇಶಗಳನ್ನು ಹೊಂದಿರುತ್ತದೆ ನೀವು ftp ಡೆಮನ್ ಅನ್ನು NFS ಕಡತ ವ್ಯವಸ್ಥೆಯಿಂದ ಕಡತಗಳನ್ನು ಓದುವಂತೆ ಸಂರಚಿಸದೆ ಹೋಗಿದ್ದರೆ, ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲ್ಪಡುತ್ತದೆ.
or: SELinux ftp ଡେମନକୁ NFS ଫାଇଲତନ୍ତ୍ରରେ $ACCESS ଫାଇଲଗୁଡ଼ିକୁ ସଂରକ୍ଷଣ କରିବାରୁ ପ୍ରତିରୋଧ କରିଥାଏ। NFS (Network Filesystem) ଟି Unix / Linux ରେ ବ୍ୟବହୃତ ଗୋଟିଏ ନେଟୱର୍କ ଫାଇଲତନ୍ତ୍ର। ftp ଡେମନ ସ୍ଥାପିତ ପାଇଲତନ୍ତ୍ରରୁ ଗୋଟିଏ କିମ୍ବା ଅଧିକ ଫାଇଲ କିମ୍ବା ଡିରେକ୍ଟୋରୀକୁ ପଢ଼ିବା ପାଇଁ ଚେଷ୍ଟା କରିଥିଲା। NFS ଫାଇଲତନ୍ତ୍ର ପରି ଏହାକୁ ସମର୍ଥନ କରିନଥାଏ SELinux ନାମପଟି, ସମସ୍ତ ଫାଇଲ ଏବଂ ଡ଼ିରେକ୍ଟୋରୀ ଫାଇଲତନ୍ତ୍ରରେ ସମାନ ସୁରକ୍ଷା ପ୍ରସଙ୍ଗ ଥାଏ। ଯଦି ଆପଣ ftp ଡେମନକୁ NFS ଫାଇଲ ତନ୍ତ୍ରରୁ ସଂରକ୍ଷଣ ନକରନ୍ତି ତେବେ ଏହି ଅବିଗମ୍ୟ ପଚେଷ୍ଟା କରିବେ ନାହିଁ।
te: SELinux అనునది ftp డెమోన్ NFS దస్త్రవ్యవస్థ నందుగల నిల్వవున్న దస్త్రాలను $ACCESS నుండి నిరోధిస్తుంది. NFS (Network Filesystem) అనునది నెట్వర్కు దస్త్రవ్యవస్థ ఉమ్మడిగా Unix/Linux సిస్టమ్స్‍ నందు ఉపయోగించేది. ftp డెమోన్ అనునది ఒకటి లేదా అంతకేంటే ఎక్కువ దస్త్రాల లేదా సంచయాలును ఈ సిస్టమ్ యొక్క మౌంటెడ్ దస్త్రవ్యవస్థనుండి చదువుటకు ప్రయత్నిస్తుంది. NFS దస్త్రవ్యవస్థ స్వచ్చమైన SELinux లైబులింగ్‌ను మద్దతివ్వదుకనుక, దస్త్రవ్యవస్థ నందు వున్న అన్ని దస్త్రములు మరియు సంచయాలు ఒకే రక్షణ సందర్భంను కలిగివుంటాయి. మీరు ftp డెమోన్‌ను NFS దస్త్రవ్యవస్థనుండి దస్త్రాలను చదువుటకు ఆకృతీకరించి వుండకపోతే ఈ వాడుక యత్నము అమర్యాద యత్నమును సూచిస్తుంది.
uk: SELinux запобігла $ACCESS до файлів на розділі NFS. NFS (Network Filesystem) - мережна файлова система, що звичайно використовується у системах UNIX/Linux. Служба ftp намагається прочитати дані з підключеної файлової системи цього типу. NFS система не підтримує низькорівневе маркування SELinux, усі файли та каталоги файлової системи мають однаковий контекст безпеки. Якщо ви не налаштовували службу ftp на читання з розділів NFS, ця спроба отримання доступу може бути спробою вторгнення.
zh_tw: SELinux 防止 ftp 幕後程式 $ACCESS 儲存於 NFS 檔案系統上的檔案。 NFS (Network Filesystem) 是個普遍使用在 Unix / Linux 系統上的網路 檔案系統。 ftp 幕後程式嘗試由一個此類型的已掛載檔案系統 讀取一個或更多個檔案或目錄。因為 NFS 檔案系統不支援 fine-grained 的 SELinux 標記，因此所有檔案系統中的 檔案和目錄都會擁有相同的安全情境。 若您並未設定 ftp 幕後程式來讀取 NFS 檔案系統中的檔案的話， 此存取代表系統可能已遭到嘗試入侵的警訊。

source: Changing the "allow_ftpd_use_nfs" boolean to true will allow this access: "setsebool -P allow_ftpd_use_nfs=1."
as: "$allow_ftpd_use_nfs" বুলিয়ানক true লে সলনি কৰিলে এই অভিগমৰ অনুমতি পোৱা যাব: "setsebool -P allow_ftpd_use_nfs=1।"
es: Cambiando el booleano "allow_ftpd_use_nfs" a verdadero permitirá este acceso: "setsebool -P allow_ftpd_use_nfs=1."
gu: "allow_ftpd_use_nfs" બુલિયન કિંમતને ખરામાં બદલવાનું આ વપરાશની પરવાનગી આપશે: "setsebool -P allow_ftpd_use_nfs=1."
ja: "allow_ftpd_use_nfs"ブーリアンを「true」に変更するとこのアクセスを 許可します: "setsebool -P allow_ftpd_use_nfs=1."
kn: ಈ ನಿಲುಕಣೆಯನ್ನು ಅನುಮತಿಸಲು "allow_ftpd_use_nfs" ಬೂಲಿಯನ್ ಅನ್ನು ನಿಜ ಎಂದು ಬದಲಾಯಿಸಲಾಗುತ್ತಿದೆ: "setsebool -P allow_ftpd_use_nfs=1."
or: "allow_ftpd_use_nfs" ବୁଲିଆନକୁ true ରେ ପରିବର୍ତ୍ତନ କରିବା ଦ୍ୱାରା ଏହି ଅଭିଗମ୍ୟକୁ ଅନୁମତି ମିଳିଥାଏ: "setsebool -P allow_ftpd_use_nfs=1."
te: "allow_ftpd_use_nfs" బూలియన్‌ను సత్యంకు అమర్చుట అనునది ఈ వాడుకను అనుమతిస్తుంది: "setsebool -P allow_ftpd_use_nfs=1."
uk: Встановлення логічної змінної «allow_ftpd_use_nfs» у TRUE дозволить доступ: «setsebool -P allow_ftpd_use_nfs=1»
zh_tw: 若將「allow_ftpd_use_nfs」布林值更改為 true 將會允許此存取： 「setsebool -P allow_ftpd_use_nfs=1。」
