Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: If you want to allow samba to run unconfined scripts
as: যদি আপুনি samba ক উন্মুক্ত লিপিসমূহ চলোৱাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que samba ejecute scripts no confinados
gu: જો તમે મર્યાદિત ન થયેલ સ્ક્રિપ્ટોને ચલાવવા માટે samba ને પરવાનગી આપવા માંગો છો
ja: samba が、 不特定のスクリプトを実行することを、もし許可したい場合。
kn: samba ವು ನಿರ್ಬಂಧಿತವಲ್ಲದ ಸ್ಕ್ರಿಪ್ಟುಗಳನ್ನು ಚಲಾಯಿಸುವಂತೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ଅବନ୍ଧିତ ସ୍କ୍ରିପ୍ଟଗୁଡ଼ିକୁ ଚଲାଇବା ପାଇଁ samba କୁ ଅନୁମତି ଦିଅନ୍ତି।
uk: Якщо ви бажаєте дозволити samba запускати скрипти без обмежень

source: If you want to support NFS home directories
as: যদি আপুনি NFS ঘৰ ডাইৰেকটৰিসমূহ সমৰ্থন কৰিব বিচাৰে
es: Si desea tener soporte NFS en los directorios personales
gu: જો તમે NFS ઘર ડિરેક્ટરીઓને આધાર આપવા માંગો છો
ja: NFS ホームディレクトリを、もしサポートしたい場合
kn: NFS ನೆಲೆ ಕೋಶಗಳಿಗೆ ಬೆಂಬಲಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದರೆ
or: ଯଦି ଆପଣ NFS ମୂଳ ସ୍ଥାନ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ସମର୍ଥିନ କରିବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు NFS నివాస డైరెక్టరీలకు తోడ్పాటు నివ్వవలెనంటే
uk: Якщо ви бажаєте увімкнути підтримку домашніх каталогів у NFS
zh_tw: 如果您想要支援 NFS 家目錄。

source: If you want to allow ftp servers to connect to all ports > 1023
as: যদি আপুনি ftp চাৰ্ভাৰসমূহক 1023 কে ডাঙৰ সকলো পোৰ্টলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow confined applications to run with kerberos.
as: যদি আপুনি গোপন অনুপ্ৰয়োগসমূহ kerberos ৰ সৈতে চলাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que aplicaciones confinadas sean ejecutadas con kerberos.
gu: જો તમે kerberos સાથે ચલાવવા માટે મર્યાદિત કાર્યક્રમોને પરવાનગી આપવા માંગો છો.
ja: 特定のアプリケーションが、 kerberos を実行することを、もし許可したい場合。
kn: ನಿರ್ಬಂಧಿತ ಅನ್ವಯಗಳನ್ನು ಕರ್ಬರೋಸ್‌ನೊಂದಿಗೆ ಚಲಾಯಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ବନ୍ଧିତ ପ୍ରୟୋଗମାନଙ୍କୁ usb ଉପକରଣଗୁଡ଼ିକୁ କର୍ବୋରସ ସହିତ ଚଲାଇବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте дозволити обмеженим програмам запускатися за допомогою kerberos.

source: If you want to allow BIND to bind apache port.
as: যদি আপুনি BIND ক apache পোৰ্টৰ সৈতে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।

source: If you want to allow gitisis daemon to send mail
as: যদি আপুনি gitisis ডিমনক মেইল প্ৰেৰণ কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow httpd to connect to memcache server
as: যদি আপুনি httpd ক memcache চাৰ্ভাৰলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que httpd se conecte con el servidor memcache
gu: જો તમે memcache સર્વર સાથે જોડાવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: https が、 memcache サーバに接続することを、もし許可したい場合。
kn: ಸ್ಥಳೀಯ memacache ಪರಿಚಾರಕದೊಂದಿಗೆ httpd ಯೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ
or: ଯଦି ଆପଣ httpd କୁ memcache ସର୍ଭର ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте надати доступ httpd на з’єднання з сервером memcache

source: If you want to allow HTTPD scripts and modules to connect to cobbler over the network.
as: যদি আপুনি HTTPD লিপিসমূহ আৰু মডিউলসমূহক নেটৱাৰ্কৰে cobbler ৰ সৈতে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que módulos y scripts HTTPD se conecten con cobbler mediante la red.
gu: જો તમે નેટવર્ક ઉપર cobbler સાથે જોડાવા માટે HTTPD સ્ક્રિપ્ટો અને મોડ્યુલોને પરવાનગી આપવા માંગો છો.
ja: HTTPD スクリプトとモジュールが、ネットワーク経由で cobber に接続することを、もし許可したい場合。
kn: HTTPD ಸ್ಕ್ರಿಪ್ಟುಗಳು ಹಾಗು ಘಟಕಗಳು ಜಾಲಬಂಧದ ಮುಖಾಂತರ cobbler ದೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ HTTPD ସ୍କ୍ରିପ୍ଟ ଏବଂ ଏକକାଂଶଗୁଡ଼ିକୁ ନେଟୱର୍କ ଉପରେ cobbler ସହିତ ସଂଯୁକ୍ତ ହେବା ପାଇଁ ଅନୁମତି ଦେଇଥାଏ।
uk: Якщо ви бажаєте надати доступ скриптам і модулям HTTPD на встановлення з’єднання з Cobbler мережею.

source: If you want to allow unconfined executables to make their stack executable. This should never, ever be necessary. Probably indicates a badly coded executable, but could indicate an attack. This executable should be reported in bugzilla
as: যদি আপুনি উন্মুক্ত এক্সিকিউটেবুলসমূহক সিহতৰ স্টেক এক্সিকিউটেবুল কৰাৰ অনুমতি দিব বিচাৰে। ই কেতিযাও, কেতিযাও প্ৰয়োজনীয় হব নালাগে। সম্ভবত এটা বেয়া ধৰণে ক'ড কৰা এক্সিকিউটেবুল বুজায়, কিন্তু এটা আক্ৰমণৰ ইংগিত দিব পাৰে। এই এক্সিকিউটেবুলক bugzilla ত সংবাদিত কৰিব লাগিব
es: Si desea permitir que ejecutables no confinados conviertan a su porción de memoria en memoria ejecutable. Esto no debería ser necesario jamás. Tal vez sea un signo de un ejecutable mal codificado, pero también podría indicar que está siendo víctima de un ataque. Este ejecutable debería ser reportado en bugzilla.
gu: જો તમે તેનું સ્ટેક એક્સક્યૂટેબલ બનાવવા માટે બંધનમુક્ત એક્સક્યૂટેબલને પરવાનગી આપવા માંગો તો. આવુ કદી થવુ જોઇએ નહિં. કદાચ તે ખોટી રીતે કોડ થયેલ એક્સક્યૂટેબલ છે તે નક્કી થાય છે, પરંતુ હુમલો થઇ શકવાનું નક્કી થાય છે. આ એક્સક્યૂટેબલ એ બગઝીલામાં અહેવાલ કરવો જોઇએ
ja: 不特定の実行ファイルが、その stack を実行可能にすることを、もし許可したい場合。これは必要でない場合は有効にすべきではありません。もし悪意をもって実行にコーディングされている場合、攻撃を起こすかもしれません。この実行ファイルは bugzilla に報告するべきです。
kn: ನಿರ್ಬಂಧಿತವಲ್ಲದ ಎಗ್ಸಿಗ್ಯೂಟೆಬಲ್‌ಗಳು ತಮ್ಮ ಸ್ಟಾಕ್ ಅನ್ನು ಎಗ್ಸಿಗ್ಯೂಟೆಬಲ್‌ ಆಗಿ ಮಾಡಲು ಅನುಮತಿಸುತ್ತೀರಾದರೆ. ಇದು ಎಂದಿಗೂ ಸಹ ಅಗತ್ಯವಿರುವುದಿಲ್ಲ. ಬಹುಷಃ ಇದು ತಪ್ಪಾಗಿ ಕೋಡ್ ಮಾಡಲಾದ ಎಗ್ಸಿಗ್ಯೂಟೆಬಲ್ ಆಗಿರಬಹುದು, ಆದರೆ ಒಂದು ದಾಳಿಯನ್ನೂ ಸಹ ಸೂಚಿಸಬಹುದು. ಈ ಎಕ್ಸಿಗ್ಯೂಟೆಬಲ್ ಅನ್ನು ಬಗ್‌ಝಿಲ್ಲಾದಲ್ಲಿ ವರದಿ ಮಾಡಬೇಕು
or: ଯଦି ଆପଣ ଅବନ୍ଧିତ ନିଷ୍ପାଦନଗୁଡ଼ିକୁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି। ତେବେ ଏହା କଦାପି ଆବଶ୍ୟକ ହୋଇନଥାଏ। ସମ୍ଭବତଃ ଏହା ଭୁଲ ଭାବରେ ଲିଖିତ ନିଷ୍ପାଦନକୁ ସୂଚାଇଥାଏ, କିନ୍ତୁ କୌଣସି ଆକ୍ରମଣକୁ ସୂଚାଇଥାଏ। ଏହି ନିଷ୍ପାଦନଗୁଡ଼ିକୁ bugzilla ରେ ଖବର କରାଯାଇଥାଏ
te: మీరు లోబడని యెగ్జిక్యూటబుల్సు వాటి స్టాక్ యెగ్జిక్యూటబుల్ చేయుటకు అనుమతించగోరితే. ఇది యెప్పుడూ, యెప్పటికీ అవసరంకాదు. బహుశా చెడ్డగా కోడ్ చేయబడిన యెగ్జిక్యూటబుల్‌ను సూచించును, అయితే దాడిని సూచించగలదు. ఈ యెగ్జిక్యూటబుల్ బగ్‌జిల్లానందు నివేదించవలెను
uk: Якщо ви бажаєте дозволити виконуваним файлам без обмежень робити області стека виконуваними. Використання цієї можливості непотрібне для роботи будь-якої нормально написаної програми. Потреба у ньому свідчить про помилки у коді програми, але може також бути ознакою нападу на систему. Про цей виконуваний файл слід повідомити у системі стеження за вадами
zh_tw: 如果您想要允許未受限的可執行檔擁有自己的堆疊執行空間。 這其實是不需要的。這可能表示可執行檔撰寫不良；但也可能表示是攻擊。這個可執行檔應該回報至 bugzilla

source: If you want to allow confined virtual guests to manage cifs files
as: যদি আপুনি গোপন ভাৰছুৱেল অতিথিসমূহক cifs নথিপত্ৰসমূহ ব্যৱস্থাপনা কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que huéspedes virtuales confinados sean capaces de administrar archivos cifs
gu: જો તમે cifs ફાઇલોને સંચાલિત કરવા માટે મર્યાદિત વર્ચ્યુઅલ મહેમાનોને પરવાનગી આપવા માંગો છો
ja: 特定の仮想ゲストが、 cifs ファイルを管理することを、もし許可したい場合
kn: cifs ಕಡತಗಳನ್ನು ನಿರ್ವಹಿಸಲು ನೀವು ನಿರ್ಬಂಧಿತ ವರ್ಚುವಲ್ ಅತಿಥಿಗಳಿಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ବନ୍ଧିତ ଆଭାସୀ ଅତିଥିମାନଙ୍କୁ cifs ଫାଇଲଗୁଡ଼ିକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте надати доступ обмеженим гостьовим віртуальним системам на керування файлами cifs

source: If you want to allow sasl to read shadow
as: যদি আপুনি sasl ক ছায়া পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que sasl lea sobre shadow
gu: જો તમે શૅડો ને વાંચવા માટે sasl ને પરવાનગી આપવા માંગો છો
ja: sasl が、 shadow を読むことを、もし許可したい場合
kn: ಛಾಯೆಯನ್ನು sasl ಓದಲು ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ sasl କୁ shadow ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
uk: Якщо ви бажаєте надати доступ sasl до читання файла shadow

source: If you want to allow ftp servers to upload files, used for public file transfer services. Directories must be labeled public_content_rw_t.
as: যদি আপুনি ftp চাৰ্ভাৰসমূহক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত, ৰাজহুৱা নথিপত্ৰসমূহ আপল'ড কৰাৰ অণুমতি দিব বিচাৰে। ডাইৰেকটৰিসমূহ public_content_rw_t লেবেল কৰা থাকিব লাগিব।
es: Si desea permitir que servidores ftp carguen archivos, utilizados por servicios de transferencia de archivos públicos. Los directorios deben ser etiquetados como labeled public_content_rw_t.
gu: જો તમે ફાઇલોને અપલોડ કરવા માટે ftp સર્વરોને પરવાનગી આપવા માંગો છો, સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરેલ છે. ડિરેક્ટરીઓ public_content_rw_t લેબલ થયેલ હોવી જ જોઇએ.
ja: ftp サーバが、 ファイルをアップロードし、共有ファイル転送サービスを使用することを、もし許可したい場合。ディレクトリは public_content_rw_t にラベルされていなければいけません。
kn: ftp ಪರಿಚಾರಕಗಳು ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ. ಕೋಶಗಳನ್ನು public_content_rw_t ಎಂದು ಲೇಬಲ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ.
or: ଯଦି ଆପଣ ftp ସର୍ଭରକୁ ଫାଇଲଗୁଡ଼ିକୁ ଧାରଣ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି। ତେବେ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକ ନିଶ୍ଚିତ ଭାବରେ public_content_rw_t ରେ ନାମକରଣ ହୋଇଥିବ।
uk: Якщо ви бажаєте надати доступ серверам ftp до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами. Каталоги має бути позначено міткою public_content_rw_t.

source: If you want to allow video playing tools to run unconfined
as: যদি আপুনি ভিডিঅ' চলোৱা সঁজুলিসমূহক উন্মুক্তভাৱে চলাৰ অনুমতি দিব বিচাৰে

source: If you want to allow gssd to read temp directory. For access to kerberos tgt.
as: যদি আপুনি gssd ক অস্থায়ী ডাইৰেকটৰি পঢ়াৰ অনুমতি দিব বিচাৰে। kerberos tgt লে অভিগমৰ বাবে।
es: Si desea permitir que gssd lea directorios temporales. Para acceso a tgt kerberos.
gu: જો તમે temp ડિરેક્ટરીને વાંચવા માટે gssd ને પરવાનગી આપવા માંગો છો. kerberos tgt માં પ્રવેશવા માટે.
ja: gssd が、 temp ディレクトリを読むことを、もし許可したい場合。 kerberos tgt にアクセスします。
kn: gssd ಯನ್ನು ತಾತ್ಕಾಲಿಕ ಕೋಶದಿಂದ ಓದಲು ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ. ಕರ್ಬರೋಸ್ tgt ಅನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳಲು.
or: ଯଦି ଆପଣ gssd କୁ ଅସ୍ଥାୟୀ ଡିରେକ୍ଟୋରୀକୁ ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି। କର୍ବୋରୋସ tgt କୁ ଅଭିଗମ୍ୟ କରିବା ପାଇଁ।
uk: Якщо ви бажаєте дозволити gssd читання даних з каталогу temp. Призначено для доступу до tgt kerberos.

source: If you want to allow webadm to manage files in users home directories
as: যদি আপুনি webadm ক ব্যৱহাৰকাৰীসমূহৰ ঘৰ ডাইৰেকটৰিসমূহত নথিপত্ৰসমূহ ব্যৱস্থাপনা কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que webadm administre archivos en los directorios personales de los usuarios
gu: જો તમે વપરાશકર્તાઓની ઘર ડિરેક્ટરીઓમાં ફાઇલોને સંચાલિત કરવા માટે webadm ને પરવાનગી આપવા માંગો છો
ja: webadm が、ユーザのホームディレクトリのファイルを管理することを、もし許可したい場合
kn: ಬಳಕೆದಾರರ ನೆಲೆ ಕೋಶಗಳಲ್ಲಿನ ಕಡತಗಳನ್ನು ನಿರ್ವಹಿಸಲು wedbadm ಗೆ ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ଚାଳକର ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକରେ ଫାଇଲ ପରିଚାଳନା କରିବା ପାଇଁ webadm କୁ ଅନୁମତି ଦିଅନ୍ତି
uk: Якщо ви бажаєте надати webadm доступ до керування файлами у домашніх каталогах користувачів

source: If you want to allow clamd to use JIT compiler
as: যদি আপুনি clamd ক JIT কমপাইলাৰ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que clamd utilice el compilador JIT
gu: જો તમે JIT કમ્પાઇલરને વાપરવા માટે clamd ને પરવાનગી આપવા માંગો છો
ja: clamd が、 JIT コンパイラを使用することを、もし許可したい場合
kn: JIT ಕಂಪೈಲರನ್ನು ಬಳಸುವಂತೆ ನೀವು clamd ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ clamd କୁ JIT ସଙ୍କଳନ ଉପକରଣଗୁଡ଼ିକୁ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте дозволити clamd використання компілятора JIT

source: If you want to allows XServer to execute writable memory
as: যদি আপুনি XServer ক লিখিব পৰা মেমৰি এক্সিকিউট কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que el servidor X ejecute memoria modificable
gu: જો તમે લખી શકાય મેમરીને ચલાવાવ માટે XServer ને પરવાનગી આપવા માંગો છો
ja: Xserver が、 書込み可能メモリを実行することを、もし許可したい場合
kn: XServer ಬರೆಯಬಹುದಾದ ಮೆಮೊರಿಯನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವಂತೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ XServer କୁ ଲିଖନଯୋଗ୍ୟ ସ୍ମୃତିକୁ ନିଷ୍ପାଦନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
uk: Якщо ви бажаєте дозволити графічному серверу виконувати дані з області пам’яті, доступної для запису

source: If you want to allow Git daemon session to bind tcp sockets to all unreserved ports.
as: যদি আপুনি Git ডিমন অধিবেশনক সকলো অসংৰক্ষিত পোৰ্টলে tcp চকেটসমূহ বন্ধাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el demonio de sesión Git asocie zócalos tcp a todos los puertos no reservados.
gu: જો તમે બધા અનારક્ષિત પોર્ટોમાં tcp સોકેટોને બાંધવા માટે Git ડિમન સત્રને પરવાનગી આપવા માંગો છો.
ja: Git デーモンセッションが、 tcp ソケットを、全ての予約されていない port に結び付けることを、もし許可したい場合
kn: tcp ಸಾಕೆಟ್‌ಗಳು ಕಾದಿರಿಸದೆ ಇರುವ ಎಲ್ಲಾ ಸಂಪರ್ಕಸ್ಥಾನಗಳೊಂದಿಗೆ ಬೈಂಡ್ ಆಗುವಂತೆ ನೀವು Git ಡೀಮನ್ ಅಧಿವೇಶನಕ್ಕೆ ಅನುಮತಿಸುವುದಾದಲ್ಲಿ.
or: ଯଦି ଆପଣ Git ଡେମନ ଅଧିବେଶନକୁ tcp ସକେଟଗୁଡ଼ିକରେ ସମସ୍ତ ଅସଂରକ୍ଷିତ ପୋର୍ଟଗୁଡ଼ିକରେ ବାନ୍ଧିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте надати доступ сеансу фонової служби Git на прив’язку сокетів tcp до всіх незарезервованих портів.

source: If you want to allow HTTPD to run SSI executables in the same domain as system CGI scripts.
as: যদি আপুনি HTTPD ক চিস্টেম CGI লিপিসমূহ দৰে একেটা ডমেইনত SSI এক্সিকিউটেবুলসমূহ চলোৱাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que HTTPD ejecute ejecutables SSI en el mismo dominio que los scripts CGI.
gu: જો તમે સિસ્ટમ CGI સ્ક્રિપ્ટો તરીકે એજ ડોમેઇનમાં ચલાવી શકાય તેવા SSI ને ચલાવવા માટે HTTPD ને પરવાનગી આપવા માંગો છો.
ja: HTTPD が、 SSI 実行ファイルを同じドメイン内で、システム CGI スクリプトとして実行することを、もし許可したい場合
kn: HTTPD ಯು SSI ಎಕ್ಸಿಗ್ಯೂಟೆಬಲ್‌ ಅನ್ನು ವ್ಯವಸ್ಥೆಯ CGI ಸ್ಕ್ರಿಪ್ಟುಗಳ ರೀತಿಯದ್ದೇ ಆದ ಡೊಮೈನ್‌ನಲ್ಲಿ ಚಲಾಯಿಸಲು ಅನುಮತಿಸ ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ HTTPD କୁ SSI ନିଷ୍ପାଦନଯୋଗ୍ୟକୁ ସମାନ ଡମେନରେ ଚଲାଇବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି ଯେପରିକିତନ୍ତ୍ର CGI ସ୍କ୍ରିପ୍ଟ।
uk: Якщо ви бажаєте дозволити HTTPD запускати виконувані файли SSI у одному домені зі скриптами CGI системи.

source: If you want to allow samba to share any file/directory read/write.
as: যদি আপুনি samba ক যিকোনো নথিপত্ৰ/ডাইৰেকটৰি পঢ়া/লিখা হিচাপে অংশীদাৰী কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir a samba compartir cualquier archivo o directorio de lectura o escritura.
gu: જો તમે કોઇપણ ફાઇલ/ડિરેક્ટી વાંચવા/લખવા ને વહેંચવા માટે samba ને પરવાનગી આપવા માંગો છો.
ja: samba が、全ての読み書き可能なファイルやディレクトリを共有することを、もし許可したい場合
kn: samba ವು ಓದಲು/ಬರೆಯಲು ಯಾವುದೆ ಕಡತ/ಕೋಶವನ್ನು ಹಂಚಿಕೊಳ್ಳಲು ನೀವು ಅನುಮತಿಸಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ samba କୁ କୌଣସି ପଠନ/ଲିଖନ ଫାଇଲ/ଡିରେକ୍ଟୋରୀକୁ ସହଭାଗ କରିବାକୁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି।
uk: Якщо ви бажаєте дозволити samba надавати доступ до будь-якого файла або каталогу лише у режимі читання або запису.

source: If you want to allow Puppet master to use connect to MySQL and PostgreSQL database
as: যদি আপুনি MySQL আৰু PostgreSQL ডাটাবেইচ লে সংযোগ কৰিবলে Puppet মাস্টাৰ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow httpd to act as a FTP server by listening on the ftp port.
as: যদি আপুনি httpd ক ftp পোৰ্টত শুনি এটা FTP চাৰ্ভাৰ হিচাপে কাৰ্য্য কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que httpd actúe como servidor FTP escuchando sobre el puerto ftp.
gu: જ તમે ftp પોર્ટ પર સાંભળીને FTP સર્વર તરીકે વર્તવા માટે httpd ને પરવાનગી આપવા માંગો છો.
ja: httpd が、 ftp port をリスニングし、FTP サーバとしてふるまうことを、もし許可したい場合。
kn: httpd ಯು ftp ಸಂಪರ್ಕಸ್ಥಾನದಲ್ಲಿನ ಆಲಿಸುವ ಮೂಲಕ FTP ಪರಿಚಾರಕವಾಗಿ ವರ್ತಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ftp ପୋର୍ଟରେ ଶୁଣିକରି httpd କୁ FTP ସର୍ଭର ଭାବରେ କାର୍ଯ୍ୟ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте надати доступ до використання httpd у режимі сервера FTP очікуванням даних на порті ftp.

source: If you want to enable extra rules in the cron domain to support fcron.
as: যদি আপুনি fcron ক সমৰ্থন দিবলে cron ডমেইনত অতিৰিক্ত নিয়মসমূহ সামৰ্থবান কৰিব বিচাৰে।
es: Si desea habilitar reglas adicionales en el dominio cron para soportar fcron.
gu: જો તમે fcron ને આધાર આપવા માટે ક્રોન ડોમેઇનમાં વધારાનાં નિયમોને સક્રિય કરવા માંગો છો.
ja: cron ドメインのほかのルールを有効にし、もし fcron をサポートしたい場合。
kn: fcron ಅನ್ನು ಬೆಂಬಲಿಸಲು cron ನಲ್ಲಿ ಹೆಚ್ಚುವರಿ ನಿಯಮಗಳನ್ನು ಶಕ್ತಗೊಳಿಸಲು ನೀವು ಬಯಸುವಿರಾದರೆ.
or: ଯଦି ଆପଣ fcron କୁ ସହାୟତା କରିବା ପାଇଁ cron ଡମେନରେ ଅତିରିକ୍ତ ନିୟମାବଳୀକୁ ସକ୍ରିୟ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте увімкнути додаткові правила у домені cron з метою підтримки fcron.

source: If you want to allow internal-sftp to read and write files in the user ssh home directories.
as: যদি আপুনি অভ্যন্তৰীয়-sftp ক ব্যৱহাৰকাৰী ssh ঘৰ ডাইৰেকটৰিসমূহত নথিপত্ৰসমূহ পঢ়িব আৰু লিখিব অনুমতি দিব বিচাৰে।
es: Si desea permitir que internal-sftp lea y escriba archivos en los directorios ssh personales del usuario.
gu: જો તમે વપરાશકર્તા ssh ઘર ડિરેક્ટરીઓમાં ફાઇલોને વાંચવા અને લખવા માટે internal-sftp ને પરવાનગી આપવા માંગો છો.
ja: internal-sftp が、ユーザ ssh ホームディレクトリのファイルを読み書きすることを、もし許可したい場合。
kn: internal-sftp ಯು ಬಳಕೆದಾರ ssh ನೆಲೆ ಕೋಶಗಳನ್ನು ಓದಲು ಹಾಗು ಬರೆಯಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ ଚାଳକ ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକରେ ଫାଇଲଗୁଡ଼ିକୁ ପଢ଼ିବା ଏବଂ ଲେଖିବା ପାଇଁ ଆଭ୍ୟନ୍ତରୀଣ-sftp କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: వాడుకరి ssh నివాస డైరెక్టరీలనందలి ఫైళ్ళను చదువుటకు మరియు వ్రాయుటకు మీరు అంతర్గత-sftpను అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити вбудованому серверу sftp читати і записувати файли до домашніх каталогів ssh користувачів.
zh_tw: 如果您想要允許 internal-sftp 讀寫位於使用者 ssh 家目錄的檔案。

source: If you want to allow http daemon to connect to zabbix
as: যদি আপুনি http ডিমনক zabbix লে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow all domains to use other domains file descriptors
as: যদি আপুনি সকলো ডমেইনক অন্য ডমেইন নথিপত্ৰ বিৱৰকসমূহ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que todos los dominios utilicen otros descriptores de archivo de dominio
gu: જો તમે બીજા ડોમેઇન ફાઇલ વર્ણનકર્તાને વાપરવા માટે બધા ડોમેઇનને પરવાનગી આપવા માંગો છો
ja: 全てのドメインが、他のドメインのファイルディスクリプタを使用することを、もし許可したい場合
kn: ಎಲ್ಲಾ ಡೊಮೈನ್‌ಗಳು ಬೇರೆ ಡೊಮೈನ್‌ಗಳ ಕಡತ ವಿವರಣೆಗಾರರನ್ನು ಬಳಸಲು ನೀವು ಅನುಮತಿಸುವಿರಾದರೆ
or: ଯଦି ଆପଣ ସମସ୍ତ ଡମେନକୁ ଅନ୍ୟ ଡମେନ ଫାଇଲ ବର୍ଣ୍ଣନାକାରୀମାନଙ୍କୁ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте дозволити всім доменам використовувати дескриптори файлів інших доменів

source: If you want to allow users to login using a radius server
as: যদি আপুনি ব্যৱহাৰকাৰীসমূহক এটা ব্যাসাৰ্দ্ধ চাৰ্ভাৰ ব্যৱহাৰ কৰি প্ৰৱেশ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir a los usuarios registrarse utilizando un servidor radius
gu: જો તમે radius સર્વરની મદદથી પ્રવેશવા માટે વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો
ja: ユーザが、 radius サーバを使用してログインすることを、もし許可したい場合
kn: ಬಳಕೆದಾರರು ರೇಡಿಯಸ್ ಪರಿಚಾರಕವನ್ನು ಬಳಸಿಕೊಂಡು ಪ್ರವೇಶಿಸಲು ನೀವು ಅನುಮತಿಸಬಯಸುವಿರಾದರೆ
or: ଯଦି ଆପଣ ଚାଳକକୁ radius ସର୍ଭର ବ୍ୟବହାର କରି ଲଗଇନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте дозволити користувачам здійснювати вхід до системи за допомогою сервера radius

source: If you want to allow Cobbler to access cifs file systems.
as: যদি আপুনি Cobbler ক cifs নথিপত্ৰ প্ৰণালীসমূহ অভিগম কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitirle a Cobbler acceso a todos los sistemas de archivos cifs.
gu: જો તમે cifs ફાઇલ સિસ્ટમોને પ્રવેશવા માટે Cobbler ને પરવાનગી આપવા માંગો છો.
ja: Cobbler が、 cifs ファイルシステムにアクセスすることを、もし許可したい場合
kn: cifs ಕಡತ ವ್ಯವಸ್ಥೆಗಳಿಗೆ ನಿಲುಕಿಸಿಕೊಳ್ಳುವಂತೆ ನೀವು Cobbler ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଆପଣ Cobbler କୁ cifs ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ଅଭିଗମ୍ୟତା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте надати доступ Cobbler до файлових систем cifs.

source: If you want to allow httpd daemon to change system limits
as: যদি আপুনি httpd ডিমনক চিস্টেম সীমাসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que lso demonios https modifiquen el límite de sus sistemas
gu: જો તમે સિસ્ટમ મર્યાદાઓને બદલવા માટે httpd ડિમનને પરવાનગી આપવા માંગો છો
ja: httpd デーモンが、システム limit を変更することを、もし許可したい場合
kn: ವ್ಯವಸ್ಥೆಯ ಮಿತಿಯನ್ನು ಬದಲಾಯಿಸಲು httpd ಡೀಮನ್‌ಗೆ ಅನುಮತಿಸಲು ನೀವು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ତନ୍ତ୍ର ସୀମା ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ httpd ଡେମନକୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте дозволити фоновій службі httpd для внесення змін у параметри обмеження системи

source: If you want to allow squid to connect to all ports, not just HTTP, FTP, and Gopher ports.
as: যদি আপুনি squid ক কেৱল HTTP, FTP, আৰু Gopher পোৰ্টসমূহৰ বাহিৰেও সকলো পোৰ্টসমূহলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que squid se conecte con todos los puertos, no sólo con los puertos HTTP, FTP, y Gopher.
gu: જો તમે બધા પોર્ટો સાથે જોડાવા માટે squid પરવાનગી આપવા માંગો છો, HTTP, FTP, અને Gopher પોર્ટો માટે ફક્ત નહિં.
ja: squid が、 HTTP, FTP, Gopher port だけでなく、全ての port に接続することを、もし許可したい場合。
kn: squid ಯು ಕೇವಲ HTTP, FTP, ಹಾಗು Gopher ಸಂಪರ್ಕಸ್ಥಾನಗಳಲ್ಲದೆ ಎಲ್ಲಾ ಸಂಪರ್ಕಸ್ಥಾನಗಳಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ squid କୁ HTTP, FTP, ଏବଂ Gopher ପୋର୍ଟଗୁଡ଼ିକ ସହିତ ବାକି ସମସ୍ତ ପୋର୍ଟଗୁଡ଼ିକ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте надати доступ squid на встановлення з’єднань на всіх портах, а не лише портах HTTP, FTP і Gopher.

source: If you want to allow syslogd the ability to read/write terminals
as: যদি আপুনি syslogd ক টাৰমিনেলসমূহক পঢ়া/লিখাৰ অনুমতি দিব বিচাৰে

source: If you want to allow users to read system messages.
as: যদি আপুনি ব্যৱহাৰকাৰীসমূহক চিস্টেম বাৰ্তাসমূহ পঢ়াৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que los usuarios lean mensajes del sistema.
gu: જો તમે સિસ્ટમ સંદેશાઓને વાંચવા માટે વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો.
ja: ユーザが、システムメッセージを読むことを、もし許可したい場合。
kn: ವ್ಯವಸ್ಥೆಯ ಸಂದೇಶಗಳನ್ನು ಬಳಕೆದಾರರು ಓದಲು ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ ଚାଳକକୁ ତନ୍ତ୍ର ସନ୍ଦେଶଗୁଡ଼ିକୁ ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте надавати користувачам доступ до читання системних повідомлень.

source: If you want to enable support for systemd as the init program.
as: যদি আপুনি init প্ৰগ্ৰাম হিচাপে systemd ৰ বাবে সমৰ্থন সামৰ্থবান কৰিব বিচাৰে।
es: Si desea habilitar soporte para que systemd sea el programa init.
gu: જો તમે init કાર્યક્રમ તરીકે systemd માટે આધારને સક્રિય કરવા માંગો છો.
ja: init プログラムとしての systemd のサポートを、もし有効したい場合。
kn: init ಪ್ರೊಗ್ರಾಮ್‌ನಂತೆ systemd ಗಾಗಿ ಬೆಂಬಲವನ್ನು ಶಕ್ತಗೊಳಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ init ପ୍ରଗ୍ରାମ ଭାବରେ systemd ପାଇଁ ସହାୟତାକୁ ସକ୍ରିୟ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте увімкнути підтримку systemd як програми ініціалізації системи.

source: If you want to allow any files/directories to be exported read/only via NFS.
as: যদি আপুনি যিকোনো নথিপত্ৰ/ডাইৰেকটৰিক NFS ৰে কেৱল/পঢ়িব পৰা হিচাপে ৰপ্তানি কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que cualquier archivo/directorio sea exportado como de sólo lectura mediante NFS.
gu: જો તમે NFS મારફતે ફક્ત વાંચી શકાય તે રીતે નિકાસ કરવા માટે કોઇપણ ફાઇલો/ડિરેક્ટરીઓને પરવાનગી આપવા માંગો છો.
ja: 全てのファイルやディレクトリが、 NFS 経由で読み取り変更にされることを、もし許可したい場合
kn: ಯಾವುದೆ ಕಡತಗಳನ್ನು/ಕೋಶಗಳನ್ನು NFS ಮೂಲಕ ಓದಲು/ಮಾತ್ರವಾಗಿ ರವಾನಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ଯେକୌଣସି କେବଳ ପଠନୀୟ ଫାଇଲ/ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ NFS ମାଧ୍ଯମରେ ପଠାଇବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте дозволити експорт будь-яких файлів або каталогів у режимі лише для читання за допомогою NFS.

source: If you want to allow system cron jobs to relabel filesystem for restoring file contexts.
as: যদি আপুনি চিস্টেম cron কাৰ্য্যসমূহক নথিপত্ৰ পৰিপ্ৰেক্ষতিতসমূহ পুনৰউদ্ধাৰ কৰিবলে নথিপত্ৰপ্ৰণালী পুনৰলেবেল কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que tareas programadas del sistema re etiqueten el sistema de archivos para restaurar contextos de archivos.
gu: જો તમે ફાઇલ સંદર્ભોનો પુન:સંગ્રહ કરવા માટે ફાઇલસિસ્ટમને પુન:લેબલ કરવા માટે સિસ્ટમ ક્રોન જૉબને પરવાનગી આપવા માંગો છો.
ja: システム cron ジョブが、ファイルシステムを再ラベルし、ファイルコンテンツをリストアすることを、もし許可したい場合
kn: ವ್ಯವಸ್ಥೆಯ ಸನ್ನಿವೇಶಗಳನ್ನು ಪುನಃಸ್ಥಾಪನೆ ಮಾಡಲು ವ್ಯವಸ್ಥೆಯ cron ಕಾರ್ಯಗಳು ಕಡತವ್ಯವಸ್ಥೆಯ ಮರು ಲೇಬಲ್ ಮಾಡುವುದನ್ನು ಅನುಮತಿಸಬಯಸುವಿರಾದರೆ.
or: ଯଦି ଆପଣ ତନ୍ତ୍ର କ୍ରନ କାର୍ଯ୍ୟକୁ ଫାଇଲତନ୍ତ୍ରକୁ ଫାଇଲ ପ୍ରସଙ୍ଗଗୁଡ଼ିକୁ ପୁନଃନାମକରଣ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте дозволити системним завданням cron змінювати мітки файлової системи для відновлення контекстів файлів.

source: If you want to allow anon internal-sftp to upload files, used for public file transfer services. Directories must be labeled public_content_rw_t.
as: যদি আপুনি anon internal-sftp ক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত, নথিপত্ৰসমূহ আপল'ড কৰাৰ অনুমতি দিব বিচাৰে। ডাইৰেকটৰিসমূহ public_content_rw_t লেবেল কৰা থাকিব লাগিব।
es: Si desea permitir que internal-sftp anónimos carguen archivos, utilizados por servicios de transferencias de archivos. Los directorios deben ser etiquetados public_content_rw_t.
gu: જો તમે ફાઇલોને અપલોડ કરવા માટે anon internal-sftp ને પરવાનગી આપવા માંગો તો, સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરવે છે. ડિરેક્ટરીઓ public_content_rw_t લેબલ થયેલ હોવી જ જોઇએ.
ja: anon internal-sftp が、ファイルをアップロードし、共有ファイル転送サービスを使用することを、もし許可したい場合。ディレクトリは public_content_rw_t にラベルされていなければいけません。
kn: anon internal-sftp ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ. ಕೋಶಗಳನ್ನು public_content_rw_t ಎಂದು ಲೇಬಲ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ.
or: ଯଦି ଆପଣ anon ଆଭ୍ୟନ୍ତରୀଣ-sftp କୁ ଫାଇଲଗୁଡ଼ିକୁ ଧାରଣ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି। ତେବେ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକ ନିଶ୍ଚିତ ଭାବରେ public_content_rw_t ରେ ନାମକରଣ ହୋଇଥିବ।
uk: Якщо ви бажаєте надати доступ анонімному вбудованому серверу sftp до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами. Каталоги має бути позначено міткою public_content_rw_t.
