Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: If you want to allow confined web browsers to read home directory content
as: যদি আপুনি গোপণ ৱেব ব্ৰাউছাৰসমূহক ঘৰ ডাইৰেকটৰিৰ বিষয়বস্তু পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que los navegadores web confinados puedan leer los contenidos del directorio personal
gu: જો તમે ઘર ડિરેક્ટરી સમાવિષ્ટને વાંચવા માટે મર્યાદિત વેબ બ્રાઉઝરોને પરવાનગી આપવા માંગો છો
ja: 特定のwebブラウザが、 ホームディレクトリのコンテンツを読むことを、もし許可したい場合
kn: ನಿರ್ಬಂಧಿತ ಜಾಲ ವೀಕ್ಷಕಗಳು ನೆಲೆ ಕೋಶದಲ್ಲಿನ ವಿಷಯವನ್ನು ಓದಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ସିମୀତ ୱେବ ବ୍ରାଉଜରମାନଙ୍କୁ ମୂଳ ସ୍ଥାନ ବିଷୟବସ୍ତୁକୁ ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: లోబడిన వెబ్ బ్రౌజర్లు నివాస సంచయ సారమును చదువుటకు అనుమతించాలని మీరు కోరుకుంటే
uk: Якщо ви бажаєте надати доступ обмеженим програмам для перегляду інтернету до читання даних з домашнього каталогу
zh_tw: 如果您想要讓受限的瀏覽器讀取家目錄的內容

source: If you want to allow xguest users to configure Network Manager and connect to apache ports
as: যদি আপুনি xguest ব্যৱহাৰকাৰীসমূহক Network Manager সংৰূপণ কৰিবলে আৰু apache পোৰ্টসমূহলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que los usuarios xguest configuren Network Manager y se conecten a puertos apache
gu: જો તમે Network Manager ને રૂપરેખાંકિત કરવા માટે xguest વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો અને apache સાથે જોડાવો
ja: xguest ユーザが、 Network Manager を調整し、apache ポートに接続することを、もし許可したい場合
kn: ಜಾಲಬಂಧ ವ್ಯವಸ್ಥಾಪಕವನ್ನು ಸಂರಚಿಸಿ ನಂತರ ಅಪಾಚೆ ಸಂಪರ್ಕಸ್ಥಾನಗಳಿಗೆ xguest ಬಳಕೆದಾರರಿಗೆ ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ xguest ଚାଳକମାନଙ୍କୁ ନେଟୱର୍କ ପରିଚାଳକଙ୍କୁ ବିନ୍ୟାସ କରିବାକୁ ଚାହୁଁଛନ୍ତି ଏବଂ apache ପୋର୍ଟଗୁଡ଼ିକ ସହିତ ସଂଯୋଗ କରିବାକୁ ଚାହୁଁଛନ୍ତି
te: నెట్వర్క్ నిర్వాహికని ఆకృతీకరించుటకు మరియు అపాచి పోర్ట్సుకు అనుసంధానించుటకు మీరు xguest వాడుకరులను అనుమతించాలంటే
uk: Якщо ви бажаєте надати доступ користувачам xguest до налаштування Network Manager і встановлення з’єднання з портами apache
zh_tw: 如果您想要 xguest 使用者配置 Network Manager 並連接 apache 的連接埠

source: If you want to allow database admins to execute DML statement
as: যদি আপুনি ডাটাবেইচ প্ৰশাসকসমূহক DML বিবৃতি এক্সিকিউট কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que administradores de bases de datos ejecuten ordenes DML
gu: જો તમે DML વાક્યને ચલાવવા માટે ડેટાબેઝ એડમિનને પરવાનગી આપવા માંગો છો
ja: database admins が、 DML statement を実行することを、もし許可したい場合
kn: ದತ್ತಸಂಚಯ ನಿರ್ವಾಹಕರು DML ಹೇಳಿಕೆಯನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಲು ನೀವು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ତଥ୍ୟାଧାର ପ୍ରଶାସକଙ୍କୁ DML ଅଭିବ୍ୟକ୍ତିକୁ ନିଷ୍ପାଦନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: డాటాబేస్ నిర్వహకులను DML స్టేట్‌మెంట్‌ను నిర్వర్తించుటకు మీరు అనుమతించగోరితే
uk: Якщо ви бажаєте надати адміністраторам бази даних виконувати інструкцію DML
zh_tw: 若您希望允許資料庫管理員執行 DML statement

source: If you want to allow clamscan to read user content
as: যদি আপুনি clamscan ব্যৱহাৰকাৰী বিষয়বস্তুৰ পঢ়াৰ অনুমতি দিব বিচাৰে

source: If you want to allow tftp to modify public files used for public file transfer services.
as: যদি আপুনি tftp ক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত ৰাজহুৱা নথিপত্ৰসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir a tftp que modifique archivos públicos utilizados para servicios de transferencia de archivos públicos.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરેલ સાર્વજનિક ફાઇલોને બદલવા માટે tftp ને પરવાનગી આપવા માંગો છો.
ja: tftp が、共有ファイル転送サービスに使われる共有ファイルを編集することを、もし許可したい場合。
kn: tftp ಯು ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಮಾರ್ಪಡಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ tftp କୁ ସର୍ବସାଧାରଣ ଫାଇଲ ପରିବହନ ସର୍ଭରଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
te: పబ్లిక్ ఫైల్ ట్రాన్సుఫర్ సేవలకు వుపయోగించు పబ్లిక్ ఫైళ్ళను సవరించుటకు మీరు tftpను అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ tftp до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами.
zh_tw: 若您希望允許 tftp 修改使用於公共檔案傳輸的公用檔案

source: If you want to allow ZoneMinder to modify public files used for public file transfer services.
as: যদি আপুনি ZoneMinder ক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত ৰাজহুৱা নথিপত্ৰসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে।

source: If you want to allow direct login to the console device. Required for System 390
as: যদি আপুনি কনচৌল যন্ত্ৰলে প্ৰত্যক্ষ প্ৰৱেশৰ অনুমতি দিব বিচাৰে। চিস্টেম 390 ৰ বাবে প্ৰয়োজনীয়
es: Si desea permitir registro directo al dispositivo de consola. Es necesario para System 390
gu: જો તમે કન્સોલ સેવાને સીધુ જ પ્રવેશવાની પરવાનગી આપવા માંગો છો. સિસ્ટમ 390 માટે જરૂરી છે
ja: このコンソールデバイスに直接ログインを、もし許可したい場合。 System 390 では必要です。
kn: ನೀವು ಕನ್ಸೋಲ್ ಸಾಧನಕ್ಕೆ ನೇರವಾಗಿ ಪ್ರವೇಶವನ್ನು ಪಡೆಯುವುದಾದರೆ. System 390 ಗೆ ಅಗತ್ಯವಿರುತ್ತದೆ
or: ଯଦି ଆପଣ କୋନସୋଲ ଉପକରଣ ସହିତ ସିଧାସଳଖ ଲଗଇନକୁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି। ତନ୍ତ୍ର 390 ପାଇଁ ଆବଶ୍ୟକ
te: మీరు కన్సోల్ లాగిన్‌కు నేరుగా లాగిన్ అనుమతించగోరితే. ఇది సిస్టమ్ 390కు అవసరము
uk: Якщо ви бажаєте дозволити безпосередній вхід до системи консольного пристрою. Потрібен для System 390
zh_tw: 若您希望允許直接登入主控台裝置。System 390 需要這麼作

source: If you want to allow user spamassassin clients to use the network.
as: যদি আপুনি ব্যৱহাৰকাৰী ক্লাএন্টসমূহক নেটৱাৰ্ক ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el usuario utilice clientes spamassassin en la red.
gu: જો તમે નેટવર્કને વાપરવા માટે વપરાશકર્તા spamassassin ક્લાયન્ટોને પરવાનગી આપવા માંગો છો.
ja: ユーザ spamassassin クライアントが、このネットワークを使用することを、もし許可したい場合。
kn: ಬಳಕೆದಾರರು spamassassin ಕ್ಲೈಂಟ್‌ಗಳನ್ನು ಜಾಲಬಂಧದಲ್ಲಿ ಬಳಸುವುದನ್ನು ನೀವು ಅನುಮತಿಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ଚାଳକ spamassassin କ୍ଲାଏଣ୍ଟକୁ ନେଟୱର୍କରେ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦିଅନ୍ତି।
te: వాడుకరి spamassassin క్లైంట్స్ నెట్వర్కు వుపయోగించుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати клієнтським системам spamassassin користувача доступ до мережі.
zh_tw: 若您希望允許使用者 spamassassin 客戶端使用網路。

source: If you want to allow httpd to act as a relay
as: যদি আপুনি httpd ক এটা প্ৰেৰক হিচাপে কাৰ্য্য কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que httpd actúe como un relé
gu: જો તમે રિલે તરીકે વર્તવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: httpd が、 relay としてふるまうことを、もし許可したい場合
kn: httpd ಯು ರಿಲೆ ಆಗಿ ವರ್ತಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ପ୍ରସାରଣ ଭାବରେ କାର୍ଯ୍ୟ କରିବା ପାଇଁ httpd କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు httpdను రిలే వలె వ్యవరించుటకు యిష్టపడుతున్నారా
uk: Якщо ви бажаєте надати доступ до використання httpd у режимі перемикача мережі
zh_tw: 若您希望允許 httpd 作為接替

source: If you want to allow openvpn to read home directories
as: যদি আপুনি openvpn ক ঘৰ ডাইৰেকটৰিসমূহ পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que openvpn lea directorios personales
gu: જો તમે ઘર ડિરેક્ટરીઓને વાંચવા માટે openvpn ને પરવાનગી આપવા માંગો છો
ja: openvpnが、ホームディレクトリを読むことを、もし許可したい場合
kn: ನೆಲೆ ಕೋಶಗಳನ್ನು openvpn ಓದಲು ನೀವು ಅನುಮತಿಸಬೇಕಿದ್ದಲ್ಲಿ
or: ଯଦି ଆପଣ ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ପଢ଼ିବା ପାଇଁ openvpn କୁ ଅନୁମତି ଦିଅନ୍ତି
te: మీరు openvpn నివాస సంచయాలను చదువుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ openvpn до читання даних з домашніх каталогів
zh_tw: 若您希望允許 openvpn 讀取家目錄

source: If you want to allow usage of the gpg-agent --write-env-file option. This also allows gpg-agent to manage user files.
as: যদি আপুনি gpg-agent --write-env-file বিকল্প ব্যৱহাৰৰ অনুমতি দিব বিচাৰে। ই লগতে gpg-agent ক ব্যৱহাৰকাৰী নথিপত্ৰসমূহ ব্যৱস্থাপনা কৰাৰ অনুমতি দিয়ে।
es: Si desea permitir la utilización de la opción --write-env-file del agente gpg. Esto también permite al agente administrar archivos de usuario.
gu: જો તમે gpg-agent --write-env-file વિકલ્પનાં વપરાશને પરવાનગી આપવા માંગો છો. આ વપરાશકર્તા ફાઇલોને સંચાલિત કરવા માટે પણ gpg-agent ને પરવાનગી આપે છે.
ja: gpg-agent の --write-env-file オプションを、もし許可したい場合。これは同時に gpg-agent がユーザファイルを管理することを許可します。
kn: gpg-agent --write-env-file ಆಯ್ಕೆಯನ್ನು ಬಳಸಲು ಅನುಮತಿಸಬೇಕಿದ್ದಲ್ಲಿ. ಇದು ಬಳಕೆದಾರರ ಕಡತಗಳನ್ನು ನಿರ್ವಹಿಸಲೂ ಸಹ gpg-agent ಗೆ ಅನುಮತಿಸುತ್ತದೆ.
or: ଯଦି ଆପଣ gpg-agent --write-env-file ବିକଳ୍ପର ଉପଯୋଗିତାକୁ ଅନୁମତି ଦେବା ପାଇଁ ଚାହୁଁଛନ୍ତି। ତେବେ ଏହା ମଧ୍ଯ gpg-agent କୁ ଚାଳକ ଫାଇଲଗୁଡ଼ିକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଅନୁମତି ଦେଇଥାଏ।
te: మీరు gpg-agent --write-env-file ఐచ్చిక వుపయోగాన్ని యిష్టపడితే. ఇది gpg-agent ను వాడుకరి ఫైళ్ళను నిర్వహించుటకు అనుమతించును.
uk: Якщо ви бажаєте надати доступ до використання параметра --write-env-file клієнтської програми GPG. Використання цього параметра надає доступ цій програмі до файлів користувачів.
zh_tw: 若您希望允許使用 gpg-agent --write-env-file 選項。這亦能允許 gpg-agent 管理使用者檔案。

source: If you want to allow the Telepathy connection managers to connect to any generic TCP port.
as: যদি আপুনি টেলিপেথী সংযোগ ব্যৱস্থাপকসমূহক যিকোনো বৰ্গীয় TCP পোৰ্টলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que los administradores de conexión de Telepathy se conecten a cualquier puerto TCP genérico.
gu: જો તમે કોઇપણ TCP પોર્ટ સાથે જોડવા માટે ટૅલિપથી જોડાણ સંચાલકોને પરવાનગી આપવા માંગો છો.
ja: Telepathy コネクションマネジャが、一般的な TPC ポートに接続することを、もし許可したい場合。
kn: Telepathy ಸಂಪರ್ಕ ವ್ಯವಸ್ಥಾಪಕವು ಯಾವುದೆ ವಿಶಿಷ್ಟವಾದ TCP ಸಂಪರ್ಕಸ್ಥಾನದೊಂದಿಗೆ ಸಂಪರ್ಕ ಹೊಂದಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ଦୂରସଞ୍ଚାର ସଂଯୋଗ ପରିଚାଳକମାନଙ୍କୁ ଯେକୌଣସି ସାଧାରଣ TCP ପୋର୍ଟ ସହିତ ସଂଯୋଗ କରିବାକୁ ଅନୁମତି ଦେବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
te: మీరు టెలీపతి అనుసంధాన నిర్వహికలను యేదేని సాధారణ TCP పోర్టునకు అనుసంధానమగుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ інструментам керування з’єднаннями Telepathy до встановлення з’єднань на довільних портах TCP.
zh_tw: 若您希望允許 Telepathy 連線管理程式連至任何一般的 TCP 連接埠。

source: If you want to allow unconfined users to transition to the Mozilla plugin domain when running xulrunner plugin-container.
as: যদি আপুনি উন্মুক্ত ব্যৱহাৰকাৰীসমূহক xulrunner প্লাগিন-ধাৰক চলাই থাকোতে Mozilla প্লাগিন ডমেইনলে যোৱাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que los usuarios no confinados se trasladen al dominio de los complementos Mozilla cuando ejecuten el contenedor de complementos xulrunner.
gu: જો તમે Mozilla પ્લગઇન ડોમેઇનમાં પરિવહન કરવા માટે બંધનમુક્ત વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો જ્યારે xulrunner plugin-container ચલાવી રહ્યા હોય.
ja: 不特定のユーザが、 xulrunner plugin-container を実行したとき Mozilla プラグインドメインに移行することを、もし許可したい場合。
kn: xulrunner plugin-container ಅನ್ನು ಚಲಾಯಿಸುವಾಗ ನಿರ್ಬಂಧಿತವಲ್ಲದ ಬಳಕೆದಾರರು Mozilla ಪ್ಲಗ್ಇನ್ ಡೊಮೈನ್‌ಗೆ ವರ್ಗಾವಣೆ ಹೊಂದುವುದನ್ನು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ ବନ୍ଧନମୁକ୍ତ ଚାଳକମାନଙ୍କୁ Mozilla ପ୍ଲଗଇନ ଡମେନକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି ଯେତେବେଳେ ତାହା xulrunner ପ୍ଲଗଇନ-ଧାରକକୁ ଚଲାଇଥାଏ।
te: మీరు లోబడని వాడుకరులను xulrunner plugin-container నడుపుచున్నప్పుడు మొజిల్లా ప్లగిన్ డొమైన్‌కు బదిలీఅగుటను అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити користувачам без обмежень доступ до домену додатків mozilla під час запуску контейнера додатків xulrunner.
zh_tw: 若您希望允許未受限的使用者，在執行 xulrunner plugin-container 時轉移至 Mozilla 外掛區域。

source: If you want to allow confined virtual guests to read fuse files
as: যদি আপুনি গোপণ ভাৰছুৱেল অতিথিসমূহক fuse নথিপত্ৰসমূহ পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que huéspedes virtuales confinados sean capaces de leer archivos fuse
gu: જો તમે fuse ફાઇલોને વાંચવા માટે મર્યાદિત વર્ચ્યુઅલ મહેમાનોને પરવાનગી આપવા માંગો છો
ja: 特定の仮想ゲストが、 fuse ファイルを読むことを、もし許可したい場合。
kn: fuse ಕಡತಗಳನ್ನು ಓದಲು ನೀವು ನಿರ್ಬಂಧಿತ ವರ್ಚುವಲ್ ಅತಿಥಿಗಳಿಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ବନ୍ଧିତ ଆଭାସୀ ଅତିଥିମାନଙ୍କୁ ମିଳିତ ଫାଇଲଗୁଡ଼ିକୁ ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте надати доступ обмеженим гостьовим віртуальним системам (virt) на читання файлів fuse
zh_tw: 若您希望允許受限的虛擬客座端讀取 fuse 檔案

source: If you want to allow HTTPD scripts and modules to connect to databases over the network.
as: যদি আপুনি HTTPD লিপিসমূহ আৰু মডিউলসমূহক নেটৱাৰ্কৰে ডাটাবেইচত সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que programas y módulos HTTPD se conecten a bases de datos en la red.
gu: જો તમે નેટવર્ક પર ડેટાબેઝો સાથે જોડાવા માટે HTTPD સ્ક્રિપ્ટો અને મોડ્યુલોને પરવાનગી આપવા માંગો છો.
ja: HTTPD スクリプトとモジュールが、ネットワーク経由でデータベースに接続することを、もし許可したい場合。
kn: HTTPD ಸ್ಕ್ರಿಪ್ಟುಗಳು ಹಾಗು ಘಟಕಗಳು ಜಾಲಬಂಧದ ಮುಖಾಂತರ ದತ್ತಸಂಚಯಗಳೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ HTTPD ସ୍କ୍ରିପ୍ଟ ଏବଂ ଏକକାଂଶଗୁଡ଼ିକୁ ନେଟୱର୍କ ଉପରେ ତଥ୍ୟାଧାର ସହିତ ସଂଯୁକ୍ତ ହେବା ପାଇଁ ଅନୁମତି ଦେଇଥାଏ।
te: మీరు HTTPD స్క్రిప్ట్సు మరియు మాడ్యూళ్ళను నెట్వర్కునందు డాటాబేసెస్‌కు అనుసంధానమగుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ скриптам і модулям HTTPD на встановлення з’єднання з базами даних мережею.
zh_tw: 若您希望允許 HTTP script 和模組透過網路連至資料庫。

source: If you want to allow ssh with chroot env to read and write files in the user home directories
as: যদি আপুনি ssh ক ব্যৱহাৰকাৰী ঘৰ ডাইৰেকটৰিসমূহত chroot ৰ সৈতে নথিপত্ৰসমূহ পঢ়া আৰু লিখাৰ অনুমতি দিব বিচাৰে

source: If you want to allow users to connect to the local mysql server
as: যদি আপুনি ব্যৱহাৰকাৰীসমূহক স্থানীয় mysql চাৰ্ভাৰলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que los usuarios se conecten al servidor local mysql
gu: જો તમે સ્થાનિય mysql સર્વર સાથે જોડાવા માટે વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો
ja: ユーザが、ローカルの mysql サーバに接続することを、もし許可したい場合
kn: ಸ್ಥಳೀಯ mysql ಪರಿಚಾರಕದೊಂದಿಗೆ ಬಳಕೆದಾರರು ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ
or: ଯଦି ଆପଣ ଚାଳକକୁ ସ୍ଥାନୀୟ mysql ସର୍ଭର ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు వాడుకరులు స్థానిక mysql సేవికకు అనుసంధానమగుటను అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ користувачам на з’єднання з локальним сервером mysql
zh_tw: 若您希望允許使用者連至本機 mysql 伺服器

source: If you want to allow polipo to connect to all ports > 1023
as: যদি আপুনি polipo ক সকলে পোৰ্টৰ সৈতে সংযোগ কৰাব বিচাৰে > 1023

source: If you want to allow ftp servers to login to local users and read/write all files on the system, governed by DAC.
as: যদি আপুনি ftp চাৰ্ভাৰসমূহক স্থানীয় ব্যৱহাৰকাৰীসমূহত প্ৰৱেশ কৰি চিস্টেমত DAC ৰে ৰাজত্ব কৰা, সকলো নথিপত্ৰ পঢ়া/লিখাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que los servidores ftp se registren con los usuarios locales y lean/escriban todos los archivos del sistemas, gobernados por DAC.
gu: જો તમે સિસ્ટમ પર સ્થાનિય વપરાશકર્તાઓ અને વાંચતી/લખતી બધી ફાઇલોને પ્રવેશવા માટે ftp સર્વરોને પરવાનગી આપવા માંગો છો, DAC દ્દારા ચલાવાય છે.
ja: ftp サーバが、ローカルユーザでログインし、 DAC によって管理されている全てのシステムファイルを読み書きすることを、もし許可したい場合。
kn: ftp ಪರಿಚಾರಕಗಳು ಸ್ಥಳೀಯ ಬಳಕೆದಾರರಾಗಿ ಪ್ರವೇಶಿಸಲು ಹಾಗು DAC ನಿಂದ ಮೇಲ್ವಿಚಾರಣೆ ನಡೆಸಲಾಗುತ್ತಿರುವ ವ್ಯವಸ್ಥೆಯಲ್ಲಿನ ಎಲ್ಲಾ ಕೋಶಗಳನ್ನು ಓದಲು/ಬರೆಯಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ ftp ସର୍ଭରଗୁଡ଼ିକୁ ସ୍ଥାନୀୟ ଚାଳକରେ ଲଗଇନ କରିବାକୁ ଏବଂ DAC ଦ୍ୱାରା ପରିଚାଳିତ ତନ୍ତ୍ରରେ ଥିବା ସମସ୍ତ ଫାଇଲଗୁଡ଼ିକୁ ପଢ଼ିବା/ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు ftp సేవికలు స్థానిక వాడుకరులకు లాగిన్ అయ్యి మరియు DAC ఆధ్వర్యంలోని అన్ని సిస్టమ్ ఫైళ్ళను చదివి/వ్రాయుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати серверам ftp доступ до входу до системи від імені локальних користувачів і здійснювати читання або запис файлів у системі, що керується DAC.
zh_tw: 若您希望允許 ftp 伺服器登入本機使用者，並讀取/寫入系統上，所有由 DAC 所管理的檔案。

source: If you want to allow httpd to run gpg in gpg-web domain
as: যদি আপুনি httpd ক gpg-web ডমেইনত gpg চলোৱাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que httpd ejecute gpg en dominio gpg web
gu: જો તમે gpg-web ડોમેઇનમાં gpg ને ચલાવવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: httpd が、 gpg-web ドメインで、 gpg を実行することを、もし許可したい場合。
kn: gpg-web ಡೊಮೈನ್‌ನಲ್ಲಿನ gpg ಯನ್ನು ಚಲಾಯಿಸಲು httpd ಗೆ ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ gpg-web ଡମେନରେ gpg କୁ ଚଲାଇବା ପାଇଁ httpd କୁ ଅନୁମତି ଦେବା ପାଇଁ ଚାହୁଁଛନ୍ତି
te: మీరు httpdను gpg-web డెమోన్ నందు gpg నడుపగోరితే
uk: Якщо ви бажаєте дозволити httpd запускати gpg у домені gpg-web
zh_tw: 若您希望允許 httpd 在 gpg-web 區域中執行 gpg

source: If you want to allow samba to act as the domain controller, add users, groups and change passwords.
as: যদি আপুনি samba ক ডমেইন নিয়ন্ত্ৰক হিচাপে কাৰ্য্য কৰাৰ, ব্যৱহাৰকাৰীসম, দল যোগ কৰাৰ আৰু পাছৱাৰ্ডসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que samba actúe como el controlador del dominio, agregue usuarios, grupos y modifique contraseñas.
gu: જો તમે ડોમેઇન નિયંત્રક, વપરાશકર્તાઓ ઉમેરો, જૂથો અને પાસવર્ડો બદલો તરીકે વર્તવા માટે samba ને પરવાનગી આપવા માંગો છો.
ja: sambaが、ドメインコントローラとしてふるまい、ユーザや、グループ、パスワードの変更を追加することを、もし許可したい場合。
kn: samba ವು ಡೊಮೈನ್ ನಿಯಂತ್ರಕವಾಗಿ ವರ್ತಿಸಲು, ಬಳಕೆದಾರರನ್ನು, ಗುಂಪುಗಳನ್ನು ಸೇರಿಸಲು ಹಾಗು ಗುಪ್ತಪದಗಳನ್ನು ಬದಲಾಯಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ samba କୁ ଡମେନ ନିୟନ୍ତ୍ରକ ଭାବରେ କାର୍ଯ୍ୟ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି, ତେବେ ଚାଳକ, ଶ୍ରେଣୀମାନଙ୍କୁ ଯୋଗକରନ୍ତୁ ଏବଂ ପ୍ରବେଶ ସଂକେତଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରନ୍ତୁ।
te: మీరు samba ను డొమైన్ నియంత్రికలా, వాడుకరులను మరియు సమూహాలను జతపరచుదానిలా మరియు సంకేతపదములను మార్చుదానిలా వ్యవహరించుటకు అనుమతించాలంటే.
uk: Якщо ви бажаєте дозволити samba працювати у режимі контролера домену, додавати користувачів, групи і змінювати паролі.
zh_tw: 如果您想要允許 sambe 作為網域控制器、新增使用者與群組、並變更密碼。

source: If you want to allow httpd to execute cgi scripts
as: যদি আপুনি httpd ক cgi লিপিবোৰ এক্সিকিউট কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que httpd ejecute programas cgi
gu: જો તમે cgi સ્ક્રિપ્ટોને ચલાવવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: httpd が、cgi スクリプトを実行することを、もし許可したい場合。
kn: httpd ಯು cgi ಸ್ಕ್ರಿಪ್ಟುಗಳನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವಂತೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: cgi ସ୍କ୍ରିପ୍ଟଗୁଡ଼ିକୁ ନିଷ୍ପାଦନ କରିବା ପାଇଁ ଯଦି ଆପଣ httpd କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు httpd అనునది cgi స్క్రిప్టులను నిర్వర్తించుటకు అనుమతించాలని కొరుకుంటే.
uk: Якщо ви бажаєте дозволити httpd виконувати скрипти cgi
zh_tw: 如果您想要允許 httpd 執行 cgi script。

source: If you want to determine whether polipo can access cifs file systems.
as: যদি আপুনি polipo এ cifs নথিপত্ৰ প্ৰণালীসমূহ অভিগম কৰাটো নিৰ্ধাৰণ কৰিব বিচাৰে।

source: If you want to allow confined virtual guests to manage nfs files
as: যদি আপুনি গোপণ ভাৰছুৱেল অতিথিসমূহক nfs নথিপত্ৰসমূহ ব্যৱস্থাপনা কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que huéspedes virtuales confinados sean capaces de administrar archivos nfs
gu: જો તમે nfs ફાઇલોને સંચાલિત કરવા માટે મર્યાદિત વર્ચ્યુઅલ મહેમાનોને પરવાનગી આપવા માંગો છો
ja: 特定の仮想ゲストが、 nfs ファイルを管理することを、もし許可したい場合。
kn: nfs ಕಡತಗಳನ್ನು ನಿರ್ವಹಿಸಲು ನೀವು ನಿರ್ಬಂಧಿತ ವರ್ಚುವಲ್ ಅತಿಥಿಗಳಿಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ବନ୍ଧିତ ଆଭାସୀ ଅତିଥିମାନଙ୍କୁ nfs ଫାଇଲଗୁଡ଼ିକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте надати доступ обмеженим гостьовим віртуальним системам на керування файлами nfs
zh_tw: 如果您想要允許受限的虛擬客座端管理 nfs 檔案

source: If you want to allow all daemons the ability to read/write terminals
as: যদি আপুনি সকলো ডিমনক টাৰ্মিনেলসমূহ পঢ়া/লিখা ক্ষমতাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir a todos los demonios la posibilidad de leer/escribir en terminales
gu: જો તમે ટર્મિનલોને વાંચવા/લખવાની ક્ષમતા માટે બધા ડિમનને પરવાનગી આપવા માંગો છો
ja: 全てのデーモンが、 terminal で読み書きが可能になることを、もし許可したい場合。
kn: ಎಲ್ಲಾ ಡೆಮನ್‌ಗಳು ಟರ್ಮಿನಲ್‌ಗಳಲ್ಲಿ ಓದುವ/ಬರೆಯುವ ಸಾಮರ್ಥ್ಯವನ್ನು ನೀವು ಒದಗಿಸಲು ಬಯಸಿದಲ್ಲಿ
or: ଯଦି ଆପଣ ସମସ୍ତ ଡେମନମାନଙ୍କୁ ଟର୍ମିନାଲଗୁଡ଼ିକରେ ପଢ଼ିବା/ଲେଖିବା କ୍ଷମତା ଦେବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: అన్ని డెమోన్సును టెర్మినల్సు చదువుట/వ్రాయుటకు మీరు అనుమతించాలని కోరుకుంటే
uk: Якщо ви бажаєте дозволити всім фоновим службам здійснювати читання і запис даних до терміналів
zh_tw: 如果您想要允許所有 daemon 擁有讀寫終端機的能力

source: If you want to allow confined virtual guests to use serial/parallel communication ports
as: যদি আপুনি গোপণ ভাৰছুৱেল অতিথিসমূহক ক্ৰমিক/সমান্তৰাল সংযোগ পোৰ্টসমূহ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir a todos huépedes virtuales confinados utilizar puertos de comunicación seriales/paralelos
gu: જો તમે ક્રમશ:/સમાંતર વાર્તાલાપ પોર્ટોને વાપરવા માટે મર્યાદિત વર્ચ્યુઅલ મહેમાનોને પરવાનગી આપવા માંગો છો
ja: 特定の仮想ゲストが、 シリアル/パラレル通信 port を使用することを、もし許可したい場合
kn: ಅನುಕ್ರಮಿತ/ಸಮಾನಾಂತರದ ಸಂಪರ್ಕಸ್ಥಾನಗಳನ್ನು ಬಳಸಲು ನೀವು ನಿರ್ಬಂಧಿತ ವರ್ಚುವಲ್ ಅತಿಥಿಗಳಿಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ବନ୍ଧିତ ଆଭାସୀ ଅତିଥିମାନଙ୍କୁ କ୍ରମିକ/ସମାନ୍ତରାଳ ଯୋଗାଯୋଗ ପୋର୍ଟଗୁଡ଼ିକୁ ବ୍ୟବହାର କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: లోబడిన వర్చ్యువల్ గెస్టులు వరుస/సమాంతర సంప్రదింపు పోర్టులను వుపయోగించుటకు మీరు అనుమతించాలనుకుంటే.
uk: Якщо ви бажаєте дозволити обмеженим віртуальним гостьовим системам використовувати послідовні або паралельні порти обміну даними
zh_tw: 如果您想要允許受限的客座端使用序列 / 平行通訊埠

source: If you want to allow samba to modify public files used for public file transfer services. Files/Directories must be labeled public_content_rw_t.
as: যদি আপুনি samba ক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত ৰাজহুৱা নথিপত্ৰসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে। নথিপত্ৰসমূহ/ডাইৰেকটৰিসমূহ public_content_rw_t লেবেল কৰা থাকিব লাগিব।
es: Si desea que samba pueda modificar archivos públicos utilizados por servicios de transferencia de archivos públicos. Los archivos o directorios deben ser etiquetados como public_content_rw_t.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરેલ સાર્વજનિક ફાઇલોને બદલવા માટે samba ને પરવાનગી આપવા માંગો છો. ફાઇલો/ડિરેક્ટરીઓનું લેબલ public_content_rw_t થયેલ હોવુ જ જોઇએ.
ja: samba が、共通ファイルを編集し、共通ファイル転送サービスを使用することを、もし許可したい場合。 ファイル/ディレクトリは public_content_rw_t にラベルされていなければいけません。
kn: samba ವು ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಮಾರ್ಪಡಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ. ಕಡತಗಳು/ಕೋಶಗಳನ್ನು public_content_rw_t ಎಂದು ಲೇಬಲ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ.
or: ଯଦି ଆପଣ samba କୁ ସର୍ବସାଧାରଣ ଫାଇଲ ସ୍ଥାନାନ୍ତରଣ ସର୍ଭିସଗୁଡ଼ିକରେ ବ୍ୟବହୃତ ଫାଇଲଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି। ତେବେ ଫାଇଲ/ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକ ନିଶ୍ଚିତ ଭାବରେ public_content_rw_t ରେ ନାମକରଣ ହୋଇଥିବ।
te: పబ్లిక్ ఫైల్ బదిలీకరణ సేవల కొరకు వుపయోగించు పబ్లిక్ ఫైళ్ళను సవరించుటకు sambaను అనుమతించాలని మీరు అనుకుంటే. ఫైళ్ళు/డైరెక్టరీలు తప్పక public_content_rw_t గా లేబుల్ చేయబడాలి.
uk: Якщо ви бажаєте надати доступ samba до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами. Файли і каталоги має бути позначено міткою public_content_rw_t.
zh_tw: 如果您想要允許 samba 修改給公用檔案傳輸服務使用的公用檔案。 檔案 / 目錄必須標示為 public_content_rw_t。

source: If you want to allow rsync to run as a client
as: যদি আপুনি rsync ক ক্লাএন্ট হিচাপে চলাব বিচাৰে
es: Si desea que rsync sea ejecutado como cliente
gu: જો તમે ક્લાયન્ટ તરીકે ચલાવવા માટે rsync ને પરવાનગી આપવા માંગો છો
ja: rsync が、クライアントとして実行されることを、もし許可したい場合
kn: rsync ಅನ್ನು ಕ್ಲೈಂಟ್ ಆಗಿ ಚಲಾಯಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ rsync କୁ କ୍ଲାଏଣ୍ଟ ଭାବରେ ଚଲାଇବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు rsyncను క్లైంట్ వలె నడుచుటకు అనుమతించాలంటే
uk: Якщо ви бажаєте уможливити запуск rsync у режимі клієнта
zh_tw: 如果您想要允許 rsync 以用戶端執行

source: If you want to allow rgmanager domain to connect to the network using TCP.
as: যদি আপুনি rgmanager ডমেইনক TCP ব্যৱহাৰ কৰি নেটৱাৰ্কলে সংযোগ কৰাব বিচাৰে।
es: Si desea permitir que el dominio rgmanager se conecte a la red utilizando TCP.
gu: જો તમે TCP ની મદદથી નેટવર્ક સાથે જોડાવા માટે rgmanager ડોમેઇનને પરવાનગી આપવા માંગો છો.
ja: rgmanager ドメインが、 TCP を使用してネットワークに接続することを、もし許可したい場合。
kn: rgmanager ಡೊಮೈನ್ TCP ಅನ್ನು ಬಳಸಿಕೊಂಡು ಜಾಲಬಂಧದೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ rgmanager ଡମେନକୁ TCP ବ୍ୟବହାର କରି ନେଟୱର୍କ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: rgmanager డొమైన్‌ అనునది నెట్వర్కును TCP వుపయోగించి అనుసంధానమగుటకు మీరు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити домену rgmanager встановлювати з’єднання з мережею за допомогою TCP.
zh_tw: 如果您想要允許 rgmanager 網域透過 TCP 連上網路。

source: If you want to allow exim to read unprivileged user files.
as: যদি exim ক সুবিধাহিন ব্যৱহাৰকাৰী নথিপত্ৰসমূহ পঢ়াৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que exim lea archivos de usuario sin privilegios.
gu: જો તમે બિનઅધિકારી વપરાશકર્તા ફાઇલોને વાંચવા માટે exim ને પરવાનગી આપવા માંગો છો.
ja: exim が、 特権ファイルでないユーザファイルを読むことを、もし許可したい場合。
kn: ಅಧಿಕಾರವಿಲ್ಲದ ಬಳಕೆದಾರ ಕಡತಗಳನ್ನು ಓದಲು exim ಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ exim କୁ ଅଧିକାର ପ୍ରାପ୍ତ ହୋଇନଥିବା ଚାଳକ ଫାଇଲଗୁଡ଼ିକୁ ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు eximను అనుమతిలేని వాడుకరి ఫైళ్ళను చదువుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ exim на читання файлів непривілейованого користувача.
zh_tw: 如果您想要允許 exim 讀取無特權使用者的檔案。

source: If you want to allow sysadm to debug or ptrace all processes.
as: যদি আপুনি sysadm ক সকলো প্ৰক্ৰিয়া ডিবাগ অথবা ptrace কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el administrador de sistemas depure o realice ptrace sobre todos los procesos.
gu: જો તમે બધી પ્રક્રિયાઓને ડિબગ અથવા ptrace કરવા માટે sysadm ને પરવાનગી આપવા માંગો છો.
ja: sysadm が、全てのプロセスに対し、デバッグや ptrace することを、もし許可したい場合。
kn: sysadm ಎಲ್ಲಾ ಪ್ರಕ್ರಿಯೆಗಳ ದೋಷನಿವಾರಣೆ ಅಥವ ptrace ಮಾಡಲು ನೀವು ಅನುಮತಿಸಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ sysadm କୁ ସମସ୍ତ ପ୍ରକ୍ରିୟାକୁ ତ୍ରୁଟିମୁକ୍ତ ଅଥବା ptrace କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте дозволити адміністратору системи виконувати зневаджування та трасування всіх процесів.
