Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: SELinux denied access to $TARGET_PATH requested by $SOURCE. $TARGET_PATH has a context used for sharing by a different program. If you would like to share $TARGET_PATH from $SOURCE also, you need to change its file context to public_content_t. If you did not intend to allow this access, this could signal an intrusion attempt.
as: SELinux এ $SOURCE দ্বাৰা অনুৰোধ কৰা $TARGET_PATH নাকচ কৰিলে। $TARGET_PATH ৰ এটা পৃথক প্ৰগ্ৰাম দ্বাৰা অংশীদাৰী কৰিবলে ব্যৱহৃত এটা পৰিপ্ৰেক্ষতিত আছে। যদি আপুনি $SOURCE ৰ পৰা $TARGET_PATH অংশীদাৰী কৰিব বিচাৰে, আপুনি ইয়াৰ নথিপত্ৰ পৰিপ্ৰেক্ষতিত public_content_t লে সলনি কৰিব লাগিব। যদি আপুনি এই অভিগমৰ অনুমতি দিব নিবিচাৰে, ই এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে।
es: SELinux negó el acceso a $TARGET_PATH pedido por $SOURCE. $TARGET_PATH tiene un contexto usado para ser compartido por distintos programas. Si quiere compartir $TARGET_PATH también desde $SOURCE, necesita cambiar su contexto de archivo a public_content_t. Si no pretende hacer este acceso, entonces puede ser señal de un ataque.
gu: SELinux એ $TARGET_PATH નો $SOURCE દ્વારા અરજી થયેલ વપરાશ નામંજૂર કર્યો. $TARGET_PATH ને વિવિધ કાર્યક્રમો દ્વારા વહેચણીનો સંદર્ભ વપરાયેલ છે. જો તમે $TARGET_PATH ને $SOURCE માંથી પણ વહેંચવા માંગો, તો તમારે તેનો ફાઈલ સંદર્ભ public_content_t માં બદલવાની જરૂર છે. જો તમે આ વપરાશ રાખવાની ઈચ્છા દાખવો નહિં, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હશે.
ja: SELinux は $SOURCE に要求された $TARGET_PATH へのアクセスを拒否しました。 $TARGET_PATH は別のプログラムによる共有に使用されるコンテキストを持っています。 $SOURCE からも $TARGET_PATH を共有したい場合、そのファイルコンテキストを public_content_t に変更する必要があります。このアクセス許可を意図していなかった 場合は、これは不正侵入の試みの形跡と言えます。
kn: $SOURCE ನಿಂದ ಮನವಿಸಲ್ಲಿಸಲಾದ $TARGET_PATH ಗಾಗಿನ ನಿಲುಕಣೆಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. $TARGET_PATH ವಿವಿಧ ಪ್ರೋಗ್ರಾಂ ನಡುವೆ ಹಂಚಿಕೊಳ್ಳಲು ಬಳಸಲಾಗುವ ಒಂದು ಸನ್ನಿವೇಶವನ್ನು ಹೊಂದಿದೆ. If ನೀವು $SOURCE ನಿಂದ $TARGET_PATH ಅನ್ನೂ ಸಹ ಹಂಚಿಕೆ ಮಾಡಲು ಬಯಸಿದಲ್ಲಿ, ಅದರ ಕಡತ ಸನ್ನಿವೇಶವನ್ನು public_content_t ನಲ್ಲಿ ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. ನೀವು ಆ ಅನುಮತಿಗೆ ಬಯಸದೆ ಇದ್ದಲ್ಲಿ ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲಾಗುತ್ತದೆ.
or: SELinux $SOURCE ଦ୍ୱାରା ଅନୁରୋଧ କରାଯାଇଥିବା $TARGET_PATH ରେ ଅଭିଗମ୍ୟ ପାଇଁ ବାରଣ କରିଛି। $TARGET_PATH ରେ ବିଭିନ୍ନ ପ୍ରଗ୍ରାମ ଦ୍ୱାରା ସହଭାଗ ହେବା ପାଇଁ ବ୍ୟବହୃତ ଗୋଟିଏ ପ୍ରସଙ୍ଗ ଅଛି। ଯଦିଆପଣ $TARGET_PATH କୁ $SOURCE ରୁ ସହଭାଗ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି, ତେବେ ଆପଣଙ୍କୁ ଏହାର ଫାଇଲ ପ୍ରସଙ୍ଗକୁ public_content_t କୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ହେବ। ଯଦି ଆପଣ ଏହି ଅଭିଗମ୍ୟତାକୁ ଅନୁମତି ଦେବା ପାଇଁ ଇଚ୍ଛାକରୁନାହାନ୍ତି, ତେବେ ଏହା ଏକ ବିନାଅନୁମତି ପ୍ରବେଶକୁ ସୂଚାଇଥାଏ।
te: SELinux అనునది $SOURCE ద్వారా అబ్యర్దించబడిన $TARGET_PATH కు వాడుకను తిరస్కరిస్తుంది. $TARGET_PATH అనునది వేరే ప్రోగ్రామ్‌ పంచుకొనుటకు వుపయోగించు సందర్భం కలిగివుంది. మీరు పంచుకోవాలంటే $TARGET_PATH ను $SOURCE నుండి, మీరు దాని దస్త్ర సందర్భమును public_content_t కు మార్చాలి. మీరు ఈ వాడుకకొరకు నిరీక్షించకపోతే, ఇది అమర్యాద యత్నమును సూచిస్తుంది.
uk: SELinux заборонила доступ до $TARGET_PATH за запитом $SOURCE. $TARGET_PATH має контекст спільного використання кількома програмами. Якщо ви також бажаєте використовувати $TARGET_PATH з $SOURCE, тоді треба змінити його контекст на public_content_t. Якщо ви це не планували, можливо має місце спроба вторгнення.
zh_tw: SELinux 拒絕 $SOURCE 所請求的 $TARGET_PATH 存取要求。 $TARGET_PATH 含有個用來和不同程式共享的情境。若您也 希望由 $SOURCE 共享 $TARGET_PATH 的話，您需要 將它的檔案情境更改為 public_content_t。若您並未允許 這項存取的話，這代表系統可能已遭到入侵的警訊。

source: You can alter the file context by executing chcon -t public_content_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
as: আপুনি নথিপত্ৰ পৰিপ্ৰেক্ষতিতক chcon -t public_content_t '$TARGET_PATH' এক্সিকিউট কৰি সলনি কৰিব পাৰিব আপুনি লগতে চিস্টেমৰ অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহ সলনি কৰিব লাগিব যাতে সিহতক এটা সম্পূৰ্ণ পুনৰলেবেলত সংৰক্ষণ কৰিব পাৰি। "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo ejecutando chcon -t public_content_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
gu: તમે chcon -t public_content_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઈલોને પણ સંપૂર્ણ પુન:લેબલ પર તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર બદલવી જ પડશે "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'" ATH'"
ja: chcon -t public_content_t '$TARGET_PATH' を実行すると、ファイルコンテキストを 変更することができます。 また、完全な再ラベルの後でもそれらを保持するためには、システム上でデフォルトの ファイルコンテキストファイルも変更しなければなりません。 "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
kn: chcon -t public_content_t '$TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ ಕಡತದ ಸನ್ನಿವೇಶವನ್ನು ಬದಲಾಯಿಸಬಹುದು ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
or: ଆପଣ chcon -t public_content_t '$TARGET_PATH' କୁ ନିଷ୍ପାଦନ କରି ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ବଦଳାଇପାରିବେ ସେମାନଙ୍କୁ ସମ୍ପୂର୍ଣ୍ଣ ପୁନଃ ନାମକରଣରେ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ଆପଣ ମଧ୍ଯ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ଫାଇଲକୁ ତନ୍ତ୍ରରେ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
te: మీరు ఫైలు సందర్భమును chcon -t swapfile_t '$TARGET_PATH' నిర్వర్తించుటద్వారా మార్చగలరు మీరు సిస్టమ్ నందు అప్రమేయ దస్త్ర సందర్బపు దస్త్రములనుకూడా తప్పక మార్చవలెను వాటిని పూర్తి నమ్మికతో వుంచుట కొరకు. "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
uk: Файловий контекст можна змінити, виконавши «chcon -t public_content_t '$TARGET_PATH'» Також треба змінити типові контексти файлів у системі, щоб вони збереглись навіть при повторній розмітці. «semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'»
zh_tw: 您可透過執行 chcon -t public_content_t '$TARGET_PATH' 來修改檔案 context 您也必須更改系統上的預設檔案情境檔，才能在完整重新標記的情況下將它們保留住。「semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'」

source: you want to treat $TARGET_BASE_PATH as public content
as: আপুনি $TARGET_BASE_PATH ক ৰাজহুৱা সমল হিচাপে ব্যৱহাৰ কৰিব বিচাৰে

source: You need to change the label on $TARGET_BASE_PATH to public_content_t or public_content_rw_t.
as: আপুনি $TARGET_BASE_PATH to public_content_t অথবা public_content_rw_t ত লেবেল সলনি কৰিব লাগিব।
es: necesita modificar la etiqueta en $TARGET_BASE_PATH a public_content_t o public_content_rw_t.
gu: public_content_t અથવા public_content_rw_t માટે $TARGET_BASE_PATH પર તમારે લેબલને બદલવાની જરૂર છે.
ja: $TARGET_BASE_PATH のラベルを public_content_t or public_content_rw_t に変更する必要があります。
kn: ನೀವು $TARGET_BASE_PATH ನಲ್ಲಿನ ಲೇಬಲ್ ಅನ್ನು public_content_t or public_content_rw_t ಗೆ ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ.
or: ଆପଣଙ୍କୁ $TARGET_BASE_PATH' ଉପରେ ନାମପଟିକୁ public_content_t କିମ୍ବା public_content_rw_t ନାମରେ ପରିବର୍ତ୍ତନ କରିବାକୁ ହେବ।
te: $TARGET_BASE_PATH పైని లేబుల్‌ను మీరు public_content_t లేదా public_content_rw_t కు మార్చవలసివుంటుంది.
uk: Вам слід змінити мітку на $TARGET_BASE_PATH на public_content_t або public_content_rw_t.
zh_tw: 您需要將 $TARGET_BASE_PATH 上的標籤更改為 public_content_t 或是 public_content_rw_t。

source: SELinux denied qemu access to the block device $TARGET_PATH. If this is a virtualization image, it needs to be labeled with a virtualization file context (virt_image_t). You can relabel $TARGET_PATH to be virt_image_t using chcon. You also need to execute semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a qemu image it could indicate either a bug or an intrusion attempt.
as: SELinux এ $TARGET_PATH প্ৰতিৰোধ কৰিবলে qemu অভিগম নাকচ কৰিলে। যদি ই এটা ভাৰছুৱেলাইজেষণ ছবি হয়, ইয়াক ভাৰছুৱেলাইজেষণ নথিপত্ৰ পৰিপ্ৰেক্ষতিতৰ সৈতে লেবেল কৰিব লাগিব (virt_image_t)। আপুনি chcon ব্যৱহাৰ কৰি $TARGET_PATH ক virt_image_t হবলে পুনৰ লেবেল কৰিব পাৰিব। আপুনি লগতে চিস্টেম অবিকল্পিতসমূহলে এই নতুন পথ যোগ কৰিবলে semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' এক্সিকিউট কৰিব লাগিব। যদি আপুনি $TARGET_PATH ক qemu ছবি হিচাপে ব্যৱহাৰ কৰিম বুলি ভবা নাই ই হয় এটা বাগ অথবা এটা অনাধিকাৰ প্ৰৱেশৰ চেষ্টা হব পাৰে।
gu: SELinux એ $TARGET_PATH માટે qemu વપરાશ નામંજૂર કર્યો. જો આ વર્ચ્યુઅલાઇઝ ઈમેજ હોય તો તેને વર્ચ્યુઅલાઇઝ ફાઈલ સંદર્ભ (virt_image_t) ના લેબલની જરૂર છે. chcon મદદથી virt_image_t કરવા માટે $TARGET_PATH ને ફરીથી લેબલ કરી શકાય છે. તમારે આ સિસ્ટમ મૂળભૂતોમાં નવા પાથને ઉમેરવા માટે semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' ચલાવવાની જરૂર પડશે જો તમારો $TARGET_PATH ને qemu ઈમેજ તરીકે વાપરવાતો હેતુ નહિં હોય તો તે ક્યાં તો ભૂલ સૂચવી શક્યું હોત અથવા તે ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.
ja: SELinux はブロックデバイス $TARGET_PATH への qemu のアクセスを拒否しました。 これが仮想化イメージの場合は、仮想化ファイルコンテキスト (virt_image_t) でラベルが付けられる必要があります。chcon を使用して $TARGET_PATH を virt_image_t に 再度ラベル付けすることができます。 また、semanage fcontext -a - t virt_image_t '$FIX_TARGET_PATH'も 実行して、この新しいパスをシステムデフォルトに 追加する必要があります。$TARGET_PATH を qemu イメージとして使用するつもりでなかった場合は、 それは、バグを示すか、又は不正侵入の試みを示すことになります。
kn: ಬ್ಲಾಕ್ ಸಾಧನ $TARGET_PATH ಗೆ qemu ಅನುಮತಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ಇದು ಒಂದು ವರ್ಚುವಲೈಸೇಶನ್ ಚಿತ್ರಿಕೆಯಾಗಿದ್ದರೆ, ಒಂದು ವರ್ಚುವಲೈಸೇಶನ್ನ ಕಡತ ಸನ್ನಿವೇಶ ಲೇಬಲ್ ಅನ್ನು ಹೊಂದಿರಬೇಕಾಗುತ್ತದೆ(virt_image_t). ನೀವು chcon ಅನ್ನು ಬಳಸಿಕೊಂಡು $TARGET_PATH ಅನ್ನು virt_image_t ಗೆ ಮರು ಲೇಬಲ್ ಮಾಡಬಹುದು. ಗಣಕ ಪೂರ್ವನಿಯೋಜಿತಗಳಿಗೆ ಈ ಹೊಸ ಮಾರ್ಗವನ್ನು ಸೇರಿಸಲು semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಬೇಕಾಗುತ್ತದೆ ನೀವು $TARGET_PATH ಅನ್ನು ಒಂದು qemu ಚಿತ್ರಿಕೆಯಾಗಿ ಬಳಸಲು ಬಯಸಿಲ್ಲದೆ ಹೋಗಿದ್ದರೆ ಇದು ಒಂದು ದೋಷ ಅಥವ ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲಾಗುವುದು.
or: SELinux $TARGET_PATH ରେ qemu ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଅଛି। ଯଦି ଏହା ଗୋଟିଏ ଆଭାସୀକରଣ ପ୍ରତିଛବି, ତେବେ ଏଥିରେ virt_image_t ର ଗୋଟିଏ ଫାଇଲ ପ୍ରସଙ୍ଗ (virt_image_t) ନାମପଟି ଥିବା ଉଚିତ। ଯଦି ଆପଣ ପ୍ରକୃତରେ ପ୍ରଚଳିତ ଡିରେକ୍ଟୋରୀରେ virt_image_t ପ୍ରତିଛବିକୁ ରଖିବାକୁ ଚାହୁଁଛନ୍ତି, ତେବେ ଆପଣ $TARGET_PATH କୁ virt_image_t ଭାବରେ chcon ବ୍ୟବହାର କରି ପୁନଃନାମକରଣ କରିପାରିବେ। ଆପଣଙ୍କୁ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ତନ୍ତ୍ରରେ ନୂତନ ପଥ ଯୋଗ କରିବା ପାଇଁ semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' କୁ ମଧ୍ଯ ନିଷ୍ପାଦନ କରିବାକୁ ହୋଇପାରେ। ଯଦି ଆପଣ $TARGET_PATH କୁ qemu ଭାବରେ ବ୍ୟବହାର କରିବାକୁ ଚାହୁଁନାହାନ୍ତି ତେବେ ଏହା ଗୋଟିଏ ତ୍ରୁଟି ଭାବରେ ଦୃଶ୍ୟମାନ ହୋଇପାରେ ଅଥବା ବିନାଅନୁମତିରେ ପ୍ରବେଶ ପ୍ରଚେଷ୍ଟା କରିପାରେ।
te: SELinux అనునది qemu యాక్సిస్‌ను నిరోదిస్తుంది $TARGET_PATH పరికరాన్ని బ్లాక్‌చేయుటకు. ఇది వర్చ్యువలైజేషన్ చిత్రము అయితే, అది వర్చ్యువలైజేషన్ ఫైలు సందర్భముతో (virt_image_t) లేబుల్ చేయవలసివుంది. మీరు $TARGET_PATHను virt_image_tగా రీలేబుల్ చేయగలరు chconతో. మీరు semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'ను నిర్వర్తించాలి ఈ కొత్త పాత్ సిస్టమ్ అప్రమేయాలకి జతచేయుటకు. మీరు $TARGET_PATH ను qemuలా వుపయోగించాలి అనుకొకపోతే అది అమర్యాద యత్నమును కాని బగ్‌ను కాని సూచిస్తుంది.
uk: SELinux закрила доступ qemu до $TARGET_PATH. Якщо це образ віртуалізації, він повинен мати мітку контексту virt_image_t. Можна змінити позначку $TARGET_PATH на virt_image_t за допомогою. Також виконайте команду «semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'» для додавання нового шляху у системний список стандартних шляхів. Якщо ви не планували використовувати $TARGET_PATH як образ qemu, можливо це помилка, або спроба вторгнення.
zh_tw: SELinux 拒絕 qemu 存取區塊裝置 $TARGET_PATH。 若這是個虛擬化映像檔的話，它必須要有個虛擬化檔案 context 標籤 (virt_image_t)。您可透過使用 chcon 來將 $TARGET_PATH 重新標記為 virt_image_t。您也需要執行 semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' 才可將此 新路徑新增至系統預設值。若您並未嘗試使用 $TARGET_PATH 來作為 qemu 映像檔的話，這顯示可能發生錯誤或是系統已遭到入侵的警訊。

source: You can alter the file context by executing chcon -t virt_image_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"
as: আপুনি নথিপত্ৰ পৰিপ্ৰেক্ষতিতক chcon -t virt_image_t '$TARGET_PATH' এক্সিকিউট কৰি সলনি কৰিব পাৰিব আপুনি লগতে চিস্টেমত অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহ সলনি কৰিব লাগিব যাতে সিহতক এটা সম্পূৰ্ণ পুনৰ লেবেলত সংৰক্ষণ কৰিব পাৰি। "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo chcon -t virt_image_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos incluso después de un reetiquetado completo. "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"
gu: તમે chcon -t virt_image_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઈલોને પણ સંપૂર્ણ પુન:લેબલ પર તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર બદલવી જ પડશે. "semanage fcontext -a -t virt_image_t '$TARGET_PATH'"
ja: chcon -t virt_image_t '$TARGET_PATH' を実行すると、ファイルコンテキストの 変更ができます。 また、完全な再ラベルの後でもそれらが保持できるようにシステム上でデフォルトのファイルコンテキストファイルの変更もしなければなりません。"semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"
kn: chcon -t virt_image_t '$TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ ಕಡತದ ಸನ್ನಿವೇಶವನ್ನು ಬದಲಾಯಿಸಬಹುದು. ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"
or: ଆପଣ chcon -t virt_image_t '$TARGET_PATH' କୁ ନିଷ୍ପାଦନ କରି ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ବଦଳାଇପାରିବେ ସେମାନଙ୍କୁ ସମ୍ପୂର୍ଣ୍ଣ ପୁନଃ ନାମକରଣରେ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ଆପଣ ମଧ୍ଯ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ଫାଇଲକୁ ତନ୍ତ୍ରରେ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "semanage fcontext -a -t virt_image_t '$TARGET_PATH'"
te: మీరు దస్త్ర సందర్భమును chcon -t virt_image_t '$TARGET_PATH' నిర్వర్తించుట ద్వారా మీరు మార్చవచ్చు మీరు అప్రమేయ దస్త్రము సందర్భ దస్త్రములను కూడా సిస్టమ్ నందు పూర్తి చేరికతో వుంచుటకు క్రమానుగతంగా మార్చవలెను. "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"
uk: Контекст файлу можна змінити, виконавши команду «chcon -t virt_image_t '$TARGET_PATH'» Також треба змінити типові контексти файлів у системі, щоб вони збереглись навіть при повторній розмітці. «semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH»
zh_tw: 您可透過執行 chcon -t virt_image_t '$TARGET_PATH' 來修改檔案情境 您也必須更改系統上的預設檔案情境檔，才能在完整標記的情況下將它們保留住。「semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'」

source: SELinux denied qemu access to $TARGET_PATH. If this is a virtualization image, it has to have a file context label of virt_image_t. The system is setup to label image files in directory./var/lib/libvirt/images correctly. We recommend that you copy your image file to /var/lib/libvirt/images. If you really want to have your qemu image files in the current directory, you can relabel $TARGET_PATH to be virt_image_t using chcon. You also need to execute semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a qemu image it could indicate either a bug or an intrusion attempt.
as: SELinux এ $TARGET_PATH লে qemu অভিগম নাকচ কৰিলে। যদি ই এটা ভাৰছুৱেলাইজেষণ ছবি হয়, ইয়াৰ এটা virt_image_t নথিপত্ৰ পৰিপ্ৰেক্ষতিত লেবেল থাকিব লাগিব। চিস্টেম /var/lib/libvirt/images ডাইৰেকটৰিত ছবি নথিপত্ৰসমূহ সঠিকভাৱে লেবেল কৰিবলে সংস্থাপিত। আমি আপোনাৰ ছবি নথিপত্ৰক /var/lib/libvirt/images লে কপি কৰাৰ উপদেশ দিও। যদি আপুনি সঁচাকে আপোনাৰ qemu ছবি নথিপত্ৰসমূহ বৰ্তমান ডাইৰেকটৰিত বিচাৰে, আপুনি chcon ব্যৱহাৰ কৰি $TARGET_PATH ক virt_image_t হবলে পুনৰ লেবেল কৰিব পাৰিব। আপুনি লগতে এই নতুন পথক চিস্টেম অবিকল্পিতসমূহলে যোগ কৰিবলে semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' এক্সিকিউট কৰিব লাগিব। যদি আপুনি $TARGET_PATH ক এটা qemu ছবি হিচাপে ব্যৱহাৰ কৰিব নিবিচাৰে ই হয় এটা বাগ নহলে এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে।
es: SELinux le ha negado a qemu el acceso a $TARGET_PATH. Si ésta es una imágen de virtualización, tiene que tener un contexto de archivo etiquetado como virt_image_t. El sistema está configurado para etiquetar correctamente los archivos de imagen en el directorio /var/lib/libvirt/images. Le recomendamos copiar su archivo de imagen en este directorio. Si realmente quiere mantener sus archivos de imagen qemu en el directorio actual, puede reetiquetar $TARGET_PATH para que sea virt_image_t utilizando chcon. Si hace esto, también necesitará ejecutar semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' para agregar esta nueva ruta a las predeterminadas del sistema. Si no pretende utilizar $TARGET_PATH como una imágen qemu, esto puede estar indicando o un error, o un intento de ataque.
gu: SELinux એ $TARGET_PATH માટે qemu વપરાશ નામંજૂર કર્યો. જો આ વર્ચ્યુલાઇઝેશન ઈમેજ હોય તો તેને virt_image_t નો ફાઈલ સંદર્ભ લેબલ ખસેડવું પડશે. સિસ્ટમ ઈમેજ ફાઈલોને ./var/lib/libvirt/images માં યોગ્ય રીતે લેબલ કરવા માટે સુયોજિત થયેલ છે. અમે આગ્રહ રાખીએ છીએ કે તમે તમારી ઈમેજ ફાઈલને આ /var/lib/libvirt/images નકલ કરો. જો તમે ખરેખર તમારી qemu ઈમેજ ફાઈલોને આ ડિરેક્ટરીમાં રાખવા માંગો, તો તમે $TARGET_PATH ને chcon ની મદદથી virt_image_t બનાવવા માટે પુનઃલેબલ કરી શકો. તમે આ નવા પાથને સિસ્ટમ મૂળભૂતોમાં ઉમેરવા માટે fcontext -a -t virt_image_t '$FIX_TARGET_PATH' ચલાવવાની જરૂર પડશે જો તમારો $TARGET_PATH ને qemu ઈમેજ તરીકે વાપરવાતો હેતુ નહિં હોય તો તે ક્યાં તો ભૂલ સૂચવી શક્યું હોત અથવા તે ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.
ja: SELinux は qemu による $TARGET_PATH へのアクセスを拒否しました。 これが 仮想化イメージの場合は、virt_image_t のファイルコンテキストラベルを持つ必要があります。 システムは /var/lib/libvirt/images ディレクトリー内で正しくイメージファイルをラベル付けするようにセットアップされています。 ユーザーのイメージファイルを var/lib/libvirt/images にコピーすることをお薦めします。 qemu イメージファイルを本当に現在のディレクトリー内に置きたい場合は、chcon を使用して $TARGET_PATH を virt_image_t に再ラベル付けすることができます。 また、semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' も実行して、 この新しいパスをシステムデフォルトに追加する必要があります。$TARGET_PATH を qemu イメージとして使用するつもりでなかった場合は、 それは、バグを示すか、又は不正侵入の試みを示すことになります。
kn: $TARGET_PATH ಗೆ qemu ಅನುಮತಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ಇದು ಒಂದು ವರ್ಚುವಲೈಸೇಶನ್ ಚಿತ್ರಿಕೆಯಾಗಿದ್ದರೆ, virt_image_t ನ ಒಂದು ಕಡತ ಸನ್ನಿವೇಶ ಲೇಬಲ್ ಅನ್ನು ಹೊಂದಿರಬೇಕು. ಗಣಕವು directoryಕಡತಕೋಶ./var/lib/libvirt/images ದಲ್ಲಿನ ಕಡತಗಳಿಗೆ ಸಮರ್ಪಕವಾಗಿ ಲೇಬಲ್ ಮಾಡಲು ಸಜ್ಜುಗೊಳಿಸಲಾಗಿದೆ. /var/lib/libvirt/images ಗೆ ನಿಮ್ಮ ಕಡತಗಳನ್ನು ನಕಲು ಮಾಡಲು ಸೂಚಿಸುತ್ತೇವೆ. ನಿಮ್ಮ xen ಚಿತ್ರಿಕಾ ಕಡತಗಳನ್ನು ಈಗಿನ ಕಡತಕೋಶದಲ್ಲಿ ನಿಜವಾಗಲೂ ಇರಿಸಲು ಬಯಸಿದಲ್ಲಿ, ನೀವು$TARGET_PATH ಅನ್ನು chcon ಬಳಸಿಕೊಂಡು virt_image_t ಆಗಿ ಮರು ಲೇಬಲ್ ಮಾಡಬಹುದು. ಗಣಕ ಪೂರ್ವನಿಯೋಜಿತಗಳಿಗೆ ಈ ಹೊಸ ಮಾರ್ಗವನ್ನು ಸೇರಿಸಲು semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಬೇಕಾಗುತ್ತದೆ ನೀವು $TARGET_PATH ಅನ್ನು ಒಂದು qemu ಚಿತ್ರಿಕೆಯಾಗಿ ಬಳಸಲು ಬಯಸಿಲ್ಲದೆ ಹೋಗಿದ್ದರೆ ಇದು ಒಂದು ದೋಷ ಅಥವ ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲಾಗುವುದು.
or: SELinux $TARGET_PATH ରେ qemu ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଅଛି। ଯଦି ଏହା ଗୋଟିଏ ଆଭାସୀକରଣ ପ୍ରତିଛବି, ତେବେ ଏଥିରେ virt_image_t ର ଗୋଟିଏ ଫାଇଲ ପ୍ରସଙ୍ଗ ନାମପଟି ଥିବା ଉଚିତ। ତନ୍ତ୍ରରେ ନାମପଟି ଫାଇଲଗୁଡ଼ିକୁ ଡିରେକ୍ଟୋରୀ ./var/lib/libvirt/imagesରେ ନକଲ କରିବା ପାଇଁ ସଠିକ ଭାବରେ ସେଟ କରାଯାଇଛି। ଆମେ ପରାମର୍ଶ ଦେଉଅଛୁ ଯେ ଆପଣ ଆପଣଙ୍କର ପ୍ରତିଛବି ଫାଇଲକୁ ./var/lib/libvirt/images ରେ ନକଲ କରନ୍ତୁ। ଯଦି ଆପଣ ପ୍ରକୃତରେ ପ୍ରଚଳିତ ଡିରେକ୍ଟୋରୀରେ qemu ପ୍ରତିଛବିକୁ ରଖିବାକୁ ଚାହୁଁଛନ୍ତି, ତେବେଆପଣ $TARGET_PATH କୁ ./var/lib/libvirt/images ଭାବରେ chcon ବ୍ୟବହାର କରି ପୁନଃନାମକରଣ କରିପାରିବେ। ଆପଣଙ୍କୁ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ତନ୍ତ୍ରରେ ନୂତନ ପଥ ଯୋଗ କରିବା ପାଇଁ semanage fcontext -a -t virt_image_t '$TARGET_PATH' କୁ ମଧ୍ଯ ନିଷ୍ପାଦନ କରିବାକୁ ହୋଇପାରେ। ଯଦି ଆପଣ $TARGET_PATH କୁ qemu ଭାବରେ ବ୍ୟବହାର କରିବାକୁ ଚାହୁଁନାହାନ୍ତି ତେବେ ଏହା ଗୋଟିଏ ତ୍ରୁଟି ଭାବରେ ଦୃଶ୍ୟମାନ ହୋଇପାରେ ଅଥବା ବିନାଅନୁମତିରେ ପ୍ରବେଶ ପ୍ରଚେଷ୍ଟା କରିପାରେ।
te: SELinux అనునది qemu యాక్సిస్‌ను $TARGET_PATHకు తిరస్కరిస్తుంది. ఇది వర్చ్యువలైజేషన్ ప్రతిబింబమైతే, అది ఫైలు సందర్భ లేబులుగా virt_image_t ని కలిగివుండాలి. ఆ సిస్టమ్ లేబుల్ చిత్రము ఫైళ్ళకు సంచయం ./var/lib/libvirt/images నందు సరిగా అమర్చబడాలి. మీ ప్రతిబింబము ఫైలును /var/lib/libvirt/images కు నకలుతీయమని మేము సిఫార్సుచేస్తున్నాము. ప్రస్తుత సంచయమునందు మీరు నిజంగా qemu ప్రతిబింబపు ఫైళ్ళను కలిగివుండాలి అనుకుంటే, మీరు $TARGET_PATH ను virt_image_tగా chconతో రీలేబుల్ చేయవచ్చు. మీరు semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'ను నిర్వర్తించాలి ఈ కొత్త పాత్ సిస్టమ్ అప్రమేయాలకి జతచేయుటకు. మీరు $TARGET_PATH ను qemuలా వుపయోగించాలి అనుకొకపోతే అది అమర్యాద యత్నమును కాని బగ్‌ను కాని సూచిస్తుంది.
uk: SELinux закрила доступ qemu до $TARGET_PATH. Якщо це образ віртуалізації, він повинен мати контекст virt_image_t Система налаштована правильно маркувати образи у /var/lib/libvirt/images Ми рекомендуємо скопіювати файл у цей каталог. Якщо ви справді бажаєте працювати з образами qemu у цьому каталозі, ви можете перемаркувати $TARGET_PATH як файл/каталог virt_image_t, використовуючи chcon. Після цього треба також виконати команду «semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'», щоб додати новий шлях у системний список. Якщо ви не збирались використовувати $TARGET_PATH як образ qemu, можливо це помилка, або спроба вторгнення.
zh_tw: SELinux 拒絕 qemu 存取 $TARGET_PATH。 若這是個虛擬化映像檔的話，它必須要有個檔案情境標籤 為 virt_image_t。該系統已被設置能正確地標記 ./var/lib/libvirt/images 目錄中的映像檔。我們建議您將您的映像檔複製至 /var/lib/libvirt/images。 若您希望您的 qemu 映像檔位於目前的目錄中的話，您可透過使用 chcon 來將 $TARGET_PATH 重新標記為 virt_image_t。您也需要執行 semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' 才可將此 新路徑新增至系統預設值。若您並未嘗試使用 $TARGET_PATH 來作為 qemu 映像檔的話，這顯示可能發生錯誤或是系統已遭到入侵的警訊。

source: $TARGET_BASE_PATH is a virtualization target
as: $TARGET_BASE_PATH হল এটা ভাৰছুৱেলাইজেষণ লক্ষ্য
es: $TARGET_BASE_PATH es un destino de virtualización
gu: $TARGET_BASE_PATH વર્ચ્યુઅલાઇઝેશન લક્ષ્ય છે
ja: $TARGET_BASE_PATH は仮想的なターゲットです
kn: $TARGET_BASE_PATH ಎನ್ನುವುದು ಒಂದು ವರ್ಚುವಲೈಸೇಶನ್ ಗುರಿಯಾಗಿದೆ
or: $TARGET_BASE_PATH ଟି ଗୋଟିଏ ଆଭାସୀକରଣ ଲକ୍ଷ୍ଯ ଅଟେ
te: $TARGET_BASE_PATH అనునది వర్చ్యులైజేషన్ లక్ష్యము
uk: $TARGET_BASE_PATH — цільова система віртуалізації
zh_tw: $TARGET_BASE_PATH 為虛擬化目標

source: You can restore the default system context to this file by executing the restorecon command. restorecon '$TARGET_PATH', if this file is a directory, you can recursively restore using restorecon -R '$TARGET_PATH'.
as: আপুনি restorecon কমান্ড এক্সিকিউট কৰি অবিকল্পিত চিস্টেম পৰিপ্ৰেক্ষতিতক এই নথিপত্ৰলে পুনৰউদ্ধাৰ কৰিব পাৰিব। restorecon '$TARGET_PATH', যদি এই নথিপত্ৰ এটা ডাইৰেকটৰি হয়, আপুনি restorecon -R '$TARGET_PATH' ব্যৱহাৰ কৰি বাৰংবাৰ পুনৰউদ্ধাৰ কৰিব পাৰিব।
es: Puede restaurar el contexto predeterminado del sistema para este archivo ejecutando el comando restorecon restorecon '$TARGET_PATH' Si este archivo es un directorio, puede restaurar recursivamente haciendo restorecon -R '$TARGET_PATH'.
gu: તમે મૂળભૂત સિસ્ટમ સંદર્ભ આ ફાઈલમાં restorecon આદેશ ચલાવીને પુનઃસંગ્રહી શકો. restorecon '$TARGET_PATH', જો આ ફાઈલ એ ડિરેક્ટરી હોય, તો તમે પુનરાવર્તિત રીતે restorecon -R '$TARGET_PATH' ની મદદથી પુનઃસંગ્રહી શકો.
ja: restorecon コマンドを実行することにより、このファイルへデフォルトのシステムコンテキストを 復元することが出来ます。 restorecon '$TARGET_PATH' もし、このファイルが ディレクトリーであれば、 restorecon -R '$TARGET_PATH' を使用して再帰的に復元することが出来ます。
kn: ಈ ಕಡತಕ್ಕೆ ಗಣಕದ ಪೂರ್ವನಿಯೋಜಿತ ಸನ್ನಿವೇಶವನ್ನು ಮರುಸ್ಥಾಪಿಸಲು restorecon ಆಜ್ಞೆಯನ್ನು ಬಳಸಬಹುದಾಗಿದೆ. restorecon '$TARGET_PATH', ಇದು ಒಂದು ಕಡತಕೋಶವಾಗಿದ್ದಲ್ಲಿ, restorecon -R '$TARGET_PATH' ಅನ್ನು ಬಳಸಿಕೊಂಡು ಪುನರಾವರ್ತಿತವಾಗಿ ಮರುಸ್ಥಾಪಿಸಬಹುದಾಗಿದೆ.
or: ଆପଣ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ତନ୍ତ୍ର ପ୍ରସଙ୍ଗକୁ ଏହି ଫାଇଲରେ restorecon ନିର୍ଦ୍ଦେଶକୁ ନିଷ୍ପାଦନ କରି ପୁନଃସ୍ଥାପନ କରିପାରିବେ। restorecon '$TARGET_PATH', ଯଦି ଏହି ଫାଇଲଟି ଗୋଟିଏ ଡିରେକ୍ଟୋରୀ ହୋଇଥାଏ, ତେବେ ଆପଣ ପୁନଃପୌନିକ ଭାବରେ restorecon -R '$TARGET_PATH' କୁ ବ୍ୟବହାର କରିପୁନଃସ୍ଥାପନ କରିପାରିବେ।
te: మీరు అప్రమేయ సిస్టమ్ సందర్భంను ఈ దస్త్రముకు restorecon ఆదేశమును ఉపయోగించి తిరిగివుంచగలరు. restorecon '$TARGET_PATH', ఈ దస్త్రము సంచయం అయితే, మీరు పునరావృతంగా తిరిగివుంచవచ్చు restorecon -R '$TARGET_PATH' ఉపయోగించి.
uk: Первинний контекст файлу можна відновити: «restorecon '$TARGET_PATH'» Для каталогу використовуйте команду «restorecon -R '$TARGET_PATH'».
zh_tw: 您可透過執行 restorecon 指令來復原此檔案的 預設系統情境。restorecon '$TARGET_PATH'，若此檔案是個目錄的話， 您可透過使用 restorecon -R '$TARGET_PATH' 來遞迴地復原。
