Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: If you want to allow Puppet client to manage all file types.
as: যদি আপুনি Puppet ক্লাএন্টক সকলো নথিপত্ৰ ধৰণ ব্যৱস্থাপনা কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el cliente Puppet administre todos los tipos de archivos.
gu: જો તમે બધા ફાઇલ પ્રકારોને સંચાલિત કરવા માટે Puppet ક્લાયન્ટને પરવાનગી આપવા માંગો છો.
ja: Puppet クライアントが、 全てのファイルタイプを管理することを、もし許可したい場合。
kn: Puppet ಕ್ಲೈಂಟ್ ಎಲ್ಲಾ ಬಗೆಯ ಕಡತಗಳನ್ನು ನಿರ್ವಹಿಸಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ Puppet କ୍ଲାଏଣ୍ଟକୁ ସମସ୍ତ ଫାଇଲ ପ୍ରକାରଗୁଡ଼ିକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: పప్పెట్ క్లైంట్‌ను అన్ని ఫైల్ రకాలను నిర్వహించుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити клієнтській частині Puppet керувати файлами будь-яких типів
zh_tw: 如果您想要允許 Puppet 用戶端管理所有檔案類型。

source: If you want to allow the use of the audio devices as the source for the entropy feeds
as: যদি আপুনি এনট্ৰপি ফিডসমূহৰ উৎস হিচাপে অডিঅ' ডিভাইচসমূহৰ ব্যৱহাৰৰ অনুমতি দিব বিচাৰে

source: If you want to allow ssh logins as sysadm_r:sysadm_t
as: যদি আপুনি ssh প্ৰৱেশসমূহক sysadm_r:sysadm_t হিচাপে অনুমতি দিব বিচাৰে
es: Si desea permitir que ssh se registre como sysadm_r:sysadm_t
gu: જો તમે sysadm_r:sysadm_t તરીકે ssh લૉગિનને પરવાનગી આપવા માંગો છો
ja: ssh ログインを sysadm_r:sysadm_t とすることを、もし許可したい場合
kn: ssh ಪ್ರವೇಶಗಳನ್ನಯ sysadm_r:sysadm_t ಆಗಿ ಅನುಮತಿಸಲು ನೀವು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ssh ଲଗଇନଗୁଡ଼ିକୁ sysadm_r:sysadm_t ଭାବରେ ଲଗଇନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଇଚ୍ଛା କରୁଛନ୍ତି
te: మీరు ssh లాగిన్సును sysadm_r:sysadm_t లా అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити SSH-вхід до системи від імені sysadm_r:sysadm_t
zh_tw: 如果您想要允許 ssh 登入為 sysadm_r:sysadm_t

source: If you want to determine whether Polipo session daemon can send syslog messages.
as: যদি আপুনি Polipo অধিবেশন ডিমনে syslog বাৰ্তাসমূহ পঠাব পাৰিব নে নিৰ্ধাৰণ কৰিব বিচাৰে।

source: If you want to allow BIND to write the master zone files. Generally this is used for dynamic DNS or zone transfers.
as: যদি আপুনি BIND ক মাস্টাৰ অঞ্চল নথিপত্ৰসমূহ লিখাৰ অনুমতি দিব বিচাৰে। সাধাৰণত ইয়াক চলমান DNS অথবা অঞ্চল স্থানান্তৰসমূহৰ বাবে ব্যৱহাৰ কৰা হয়।
es: Si desea permitir que BIND modifique la zona principal de los archivos. Por lo general esto es utilizado por DNS dinámico o transferencias de zona.
gu: જો તમે માસ્ટર ઝોન ફાઇલોને લખવા માટે BIND ને પરવાનગી આપવા માંગો છો. સામાન્ય રીતે આ ગતિશીલ DNS અથવા ઝોન પરિવહન માટે વાપરેલ છે.
ja: BIND が、 master zone ファイルに書き込むことを、もし許可したい場合。一般に、これは動的 DNS や zone 転送に使用されます。
kn: ಮಾಸ್ಟರ್ ವಲಯ ಕಡತಗಳಿಗೆ BIND ಬರೆಯುವುದನ್ನು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುವಿರಾದಲ್ಲಿ. ಸಾಮಾನ್ಯವಾಗಿ ಇದನ್ನು ಡೈನಮಿಕ್ DNS ಅಥವ ವಲಯ ವರ್ಗಾವಣೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುತ್ತದೆ.
or: ଯଦି ଆପଣ BIND କୁ ମୂଖ୍ୟ ଅଞ୍ଚଳ ଫାଇଲଗୁଡ଼ିକୁ ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି। ତେବେ ସାଧାରଣତଃ ଏହାକୁ DNS କିମ୍ବା ଅଞ୍ଚଳ ପରିବର୍ତ୍ତନ ପାଇଁ ବ୍ୟବହାର ହୋଇଥାଏ।
uk: Якщо ви бажаєте дозволити BIND виконувати запис файлів основної зони. Зазвичай, такий запис потрібен для динамічних DNS або при зміні зон.

source: If you want to allow Git daemon system to access cifs file systems.
as: যদি আপুনি Git ডিমন চিস্টেমক cifs নথিপত্ৰ প্ৰণালীলে অভিগমৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el demonio del sistema Git tenga acceso a sistemas de archivos cifs.
gu: જો તમે cifs ફાઇલ સિસ્ટમોનો વપરાશ માટે Git ડિમનને પરવાનગી આપવા માંગો છો.
ja: Git デーモンシステムが、 cifs ファイルシステムにアクセスすることを、もし許可したい場合
kn: cifs ಕಡತ ವ್ಯವಸ್ಥೆಗಳಿಗೆ ನಿಲುಕಿಸಿಕೊಳ್ಳುವಂತೆ ನೀವು Git ಡೀಮನ್ ವ್ಯವಸ್ಥೆಯನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଆପଣ Git ଡେମନ ତନ୍ତ୍ରକୁ cifs ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ଅଭିଗମ୍ୟତା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: Git డెమోన్ సిస్టమ్‌ను cifs ఫైల్ సిస్టమ్స్ యాక్సెస్ చేయుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ системі фонової служби Git до файлових систем cifs
zh_tw: 如果您想要允許 Git daemon 系統存取 cifs 檔案系統。

source: If you want to allow tor daemon to bind tcp sockets to all unreserved ports.
as: যদি আপুনি ডিমনক সকলো অসংৰক্ষিত পোৰ্টলে tcp চকেট বন্ধাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el demonio tor asocie zócalos tcp a todos los puertos no reservados.
gu: જો તમે બધા અનારક્ષિત પોર્ટો માટે tcp સોકેટોને બાંધવા માટે tor ડિમનને પરવાનગી આપવા માંગો છો.
ja: tor デーモンが、 tcp ソケットを全ての予約されていない port に結び付けることを、もし許可したい場合。
kn: nfs ಕಡತಗಳನ್ನು ನಿರ್ವಹಿಸಲು ನೀವು xen ಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ tor ଡେମନକୁ tcp ସକେଟଗୁଡ଼ିକରେ ସମସ୍ତ ଅସଂରକ୍ଷିତ ପୋର୍ଟଗୁଡ଼ିକରେ ବାନ୍ଧିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: tcp సాకెట్లను అన్ని రిజర్వుకాని పోర్ట్సుకు బైండ్ చేయుటకు టార్ డెమోన్‌ను అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ фоновій службі tor на прив’язку сокетів tcp до всіх незарезервованих портів
zh_tw: 如果您想要允許 tor daemon 綁定 tcp socket 至所有未保留的連接埠。

source: If you want to allow host key based authentication
as: যদি আপুনি হস্ট চাবি ভিত্তিয় প্ৰমাণীকৰণৰ অনুমতি দিব বিচাৰে
es: Si desea permitir autenticaciones basadas en llaves de equipos
gu: જો તમે યજમાન કી આધારિત સત્તાધિકરણને પરવાનગી આપવા માંગો છો
ja: host key ベースの認証を、もし許可したい場合。
kn: ಆತಿಥೇಯ ಆಧರಿತವಾದ ದೃಢೀಕರಣವನ್ನು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ
or: ହୋଷ୍ଟ କି ଆଧାରିତ ବୈଧିକରଣକୁ ଯଦି ଆପଣ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు హోస్ట్ కీ ఆధారిత ధృవీకరణను అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити розпізнавання на основі ключів вузла
zh_tw: 如果您想要允許以主機金鑰為基礎的認證

source: If you want to allow httpd to access cifs file systems
as: যদি আপুনি httpd ক cifs নথিপত্ৰ প্ৰণালীসমূহ অভিগম কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que httpd tenga acceso a sistemas de archivos cifs
gu: જો તમે cifs ફાઇલ સિસ્ટમોને વાપરવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: httpd が、 cifs ファイルシステムにアクセスすることを、もし許可したい場合
kn: cifs ಕಡತ ವ್ಯವಸ್ಥೆಗಳಿಗೆ ನಿಲುಕಿಸಿಕೊಳ್ಳುವಂತೆ ನೀವು httpd ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଆପଣ httpd କୁ cifs ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ଅଭିଗମ୍ୟତା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు httpdను cifs ఫైల్ సిస్టమ్సును యాక్సెస్ చేయుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ httpd до файлових систем cifs
zh_tw: 如果您想要允許 httpd 存取 cifs 檔案系統

source: If you want to allow piranha-lvs domain to connect to the network using TCP.
as: যদি আপুনি piranha-lvs ডিমনক TCP ব্যৱহাৰ কৰি নেটাৱৰ্কলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que dominios piranha-lvs puedan conectarse a la red utilizando TCP.
gu: જો તમે TCP ની મદદથી નેટવર્ક સાથે જોડાવા માટે piranha-lvs ડોમેઇનને પરવાનગી આપવા માંગો છો.
ja: piranha-lvs デーモンが、 TCP を使用してネットワークに接続することを、もし許可したい場合。
kn: piranha-lvs ಡೊಮೈನ್ TCP ಅನ್ನು ಬಳಸಿಕೊಂಡು ಜಾಲಬಂಧದೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ piranha-lvs ଡମେନକୁ TCP ବ୍ୟବହାର କରି ନେଟୱର୍କ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు piranha-lvs డొమైన్‌ను నెట్వర్కునకు TCP వుపయోగించి అనుసంధానమగుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити домену piranha-lvs встановлювати з’єднання з мережею за допомогою TCP.
zh_tw: 如果您想要允許 piranha-lvs 網域透過 TCP 連接網路。

source: If you want to disallow programs, such as newrole, from transitioning to administrative user domains.
as: যদি আপুনি প্ৰ্ৰগ্ৰামসমূহ যেনে, newrole ক, প্ৰশাসনীয় ব্যৱহাৰকাৰী ডমেইনসমূহৰ পৰা স্থানান্তৰ কৰা বিচাৰে।
es: Si desea deshabilitar que los programas, como ser por ejemplo newrole, se trasladen a dominios de usuarios administrativos.
gu: જો તમે વહીવટી વપરાશકર્તા ડોમેઇનો માટે પરિવર્તનમાંથી newrole જેવા કાર્યક્રમોને પરવાનગી આપવા માંગતા નથી.
ja: newrole などのプログラムが、 管理者権限のユーザドメインに移行することを、もし許可にしたくない場合。
kn: newrole ನಂತಹ ಪ್ರೊಗ್ರಾಮ್‌ಗಳು ವ್ಯವಸ್ಥಾಪನಾ ಬಳಕೆದಾರ ಡೊಮೈನ್‌ಗಳಿಗೆ ಮಾರ್ಪಾಡುಹೊಂದುವುದನ್ನು ಅನುಮತಿಸದೆ ಇರಲು ನೀವು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ ପ୍ରଗ୍ରାମଗୁଡ଼ିକୁ ଅନୁମତି ନଦେବା ପାଇଁ ଚାହାନ୍ତି, ଯେପରିକି ନୂତନ ଭୂମିକା, ସ୍ଥାନାନ୍ତରଣରୁ ପ୍ରଶାସନିକ ଚାଳକ ଡମେନଗୁଡ଼ିକୁ।
te: కొత్తరోల్ వంటి ప్రోగ్రామ్సును, నిర్వహణా వాడుకరి డొమైన్సునుండి బదిలీకరింపబడుటనుండి మీరు తిరస్కరించగోరితే.
uk: Якщо ви бажаєте заборонити програмам у безпечному режимі, зокрема newrole, здійснювати переведення до доменів адміністративних користувачів.
zh_tw: 如果您不想允許程式（例如 newrole）傳送到管理用途的使用者網域。

source: If you want to allow ABRT to modify public files used for public file transfer services.
as: যদি আপুনি ABRT ক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত ৰাজহুৱা নথিপত্ৰসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que ABRT modifique archivos públicos utilizados por servicios de archivos de datos públicos.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરેલ સાર્વજનિક ફાઇલોને બદલવા માટે ABRT ને પરવાનગી આપવા માંગો છો.
ja: ABRT が、 共有ファイルを編集し、共有ファイル転送サービスを使用することを、もし許可したい場合。
kn: ABRT ಯು ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಮಾರ್ಪಡಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ABRT କୁ ସର୍ବସାଧାରଣ ଫାଇଲ ପରିବହନ ସର୍ଭରଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
te: పబ్లిక్ ఫైల్ బదిలీకరణ సేవల కొరకు వుపయోగించు పబ్లిక్ ఫైళ్ళను సవరించుటకు ABRT అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ ABRT до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами.

source: If you want to allow pppd to be run for a regular user
as: যদি আপুনি pppd ক এটা সাধাৰণ ব্যৱহাৰৰ বাবে চলাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que pppd sea ejecutado por un usuario regular
gu: જો તમે નિયમિત વપરાશકર્તા માટે ચલાવવા માટે pppd ને પરવાનગી આપવા માંગો છો
ja: pppd が、 通常ユーザのために動作することを、もし許可したい場合
kn: pppd ಯು ಒಂದು ಸಾಮಾನ್ಯವಾದ ಬಳಕೆದಾರರಿಗಾಗಿ ಚಲಾಯಿಸಲು ನೀವು ಅನುಮತಿಸಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ pppd କୁ ଗୋଟିଏ ସାଧାରଣ ଚାଳକ ପାଇଁ ଚଲାଇବାକୁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
te: మీరు pppd అనునది రోజువారి వాడుకరి కొరకు నడుచుటను అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити запуск pppd від імені звичайного користувача
zh_tw: 如果您想要允許 pppd 以一般使用者執行

source: If you want to allow samba to share any file/directory read only.
as: যদি আপুনি samba ক যিকোনো নথিপত্ৰ/ডাইৰেকটৰিক কেৱল পঢ়িব পৰা বুলি অংশীদাৰী কৰিবলে অনুমতি দিব বিচাৰে।
es: Si desea permitir que samba comparta cualquier directorio o archivo de solo lectura.
gu: જો તમે ફક્ત વાંચી શકાય તેવી કોઇપણ ફાઇલ/ડિરેક્ટરીને વહેંચવા માટે samba ને પરવાનગી આપવા માંગો છો.
ja: samba が、 全てのファイルを読み取り専用で共有することを、もし許可したい場合。
kn: samba ವು ಓದಲು ಮಾತ್ರವಾದ ಯಾವುದೆ ಕಡತ/ಕೋಶವನ್ನು ಹಂಚಿಕೊಳ್ಳಲು ನೀವು ಅನುಮತಿಸಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ samba କୁ କୌଣସି କେବଳ ପଠନୀୟ ଫାଇଲ/ଡିରେକ୍ଟୋରୀକୁ ସହଭାଗ କରିବାକୁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
te: ఏ ఫైల్/డైరెక్టరీనైనా చదువుటకు మాత్రమే వలె samba బాగస్వామ్యపరచుకొనుటకు మీరు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити samba надавати доступ до будь-якого файла або каталогу лише у режимі читання.
zh_tw: 如果您想要允許 samba 以唯讀方式共享任何檔案或目錄。

source: If you want to allow ftp servers to connect to mysql database ports
as: যদি আপুনি ftp চাৰ্ভাৰসমূহক mysql ডাটাবেইচ পোৰ্টসমূহলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow Git daemon system to search home directories.
as: যদি আপুনি Git ডিমন চিস্টেমক ঘৰ ডাইৰেকটৰিসমূহ সন্ধান কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el demonio del sistema Git realice búsquedas en directorios personales
gu: જો તમે ઘર ડિરેક્ટરીઓને શોધવા માટે Git ડિમન સિસ્ટમને પરવાનગી આપવા માંગો છો.
ja: Git デーモンが、 ホームディレクトリを検索することを、もし許可したい場合。
kn: ನೆಲೆ ಕೋಶಗಳನ್ನು Git ಡೀಮನ್ ವ್ಯವಸ್ಥೆಯನ್ನು ಹುಡುಕಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ସନ୍ଧାନ ପାଇଁ Git ଡେମନ ତନ୍ତ୍ରକୁ ଅନୁମତି ଦିଅନ୍ତି।
te: మీరు Git డెమోన్ సిస్టమ్‌ను నివాస డైరెక్టరీలను శోదించుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити системі фонової служби Git виконувати пошук у домашніх каталогах
zh_tw: 如果您想要允許 Git daemon 系統搜尋家目錄。

source: If you want to support SAMBA home directories
as: যদি আপুনি SAMBA ঘৰ ডাইৰেকটৰিসমূহ সমৰ্থন কৰিব বিচাৰে
es: Si desea tener soporte SAMBA en directorios personales
gu: જો તમે SAMBA ઘર ડિરેક્ટરીઓને આધાર આપવા માંગો છો
ja: SAMBA ホームディレクトリを、もしサポートしたい場合
kn: SAMBA ನೆಲೆ ಕೋಶಗಳಿಗೆ ಬೆಂಬಲಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದರೆ
or: ଯଦି ଆପଣ SAMBA ମୂଳ ସ୍ଥାନ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ସମର୍ଥିନ କରିବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు SAMBA నివాస డైరెక్టరీలకు తోడ్పాటు నివ్వవలెననుకుంటే
uk: Якщо ви бажаєте використовувати підтримку домашніх каталогів SAMBA
zh_tw: 如果您想要支援 SAMBA 家目錄

source: If you want to allow mock to read files in home directories.
as: যদি আপুনি mock ক ঘৰ ডাইৰেকটৰিসমূহত নথিপত্ৰসমূহ পঢ়াৰ অনুমতি দিব বিচাৰে।

source: If you want to allow users to login using a sssd server
as: যদি আপুনি ব্যৱহাৰকাৰীসমূহক এটা sssd চাৰ্ভাৰ ব্যৱহাৰ কৰি প্ৰৱেশ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir a los usuarios registrarse utilizando un servidor sssd
gu: જો તમે sssd સર્વરની મદદથી પ્રવેશવા માટે વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો
ja: sssd サーバを使用してユーザーがログインすることを許可したい場合
kn: ಬಳಕೆದಾರರು sssd ಪರಿಚಾರಕವನ್ನು ಬಳಸಿಕೊಂಡು ಪ್ರವೇಶಿಸಲು ನೀವು ಅನುಮತಿಸಬಯಸುವಿರಾದರೆ
uk: Якщо ви бажаєте дозволити користувачам здійснювати вхід до системи за допомогою сервера sssd
zh_tw: 如果您想要允許使用者使用 sssd 伺服器登入

source: If you want to allow samba to create new home directories (e.g. via PAM)
as: যদি আপুনি samba ক নতুন ঘৰ ডাইৰেকটৰিসমূহ যেনে (উদাহৰণস্বৰূপ, PAM ৰে) সৃষ্টি কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que samba cree nuevos directorios personbales (p. ej, mediante PAM)
gu: જો તમે નવી ઘર ડિરેક્ટરીઓને બનાવવા માટે samba ને પરવાનગી આપવા માંગો છો (દા.ત. PAM મારફતે)
ja: samba が、 新しいホームディレクトリ作成することを、もし許可したい場合。(例 PAM経由)
kn: ಹೊಸ ನೆಲೆ ಕೋಶಗಳನ್ನು samba ವು ರಚಿಸಲು ನೀವು ಅನುಮತಿಸಬೇಕಿದ್ದಲ್ಲಿ (ಉದಾ, PAM ಮೂಲಕ)
or: ଯଦି ଆପଣ ନୂତନ ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ନିର୍ମାଣ ପାଇଁ samba କୁ ଅନୁମତି ଦିଅନ୍ତି ‍(ଯେପରିକି PAM ମାଧ୍ଯମରେ)
te: మీరు sambaను కొత్త నివాస డైరెక్టరీలను సృష్టించుటకు అనుమతించగోరితే (ఉ.దా. PAM ద్వారా)
uk: Якщо ви бажаєте дозволити samba створювати домашні каталоги (наприклад, за допомогою PAM)
zh_tw: 如果您想要允許 samba 建立新的家目錄（例如透過 PAM）

source: If you want to control users use of ping and traceroute
as: যদি আপুনি ব্যৱহাৰকাৰীসমূহৰ ping আৰু traceroute ৰ ব্যৱহাৰ নিয়ন্ত্ৰণ কৰিব বিচাৰে
es: Si desea controlar la utilización que hacen los usuarios de de ping y traceroute
gu: જો તમે પિંગ અને ટ્રેસરુટને વાપરવા વપરાશકર્તાઓને નિયંત્રણ કરવા માંગો છો
ja: ユーザによる ping と traceroute の使用を、もし管理したい場合
kn: ಬಳಕೆದಾರರು ಪಿಂಗ್ ಹಾಗು traceroute ಅನ್ನು ನಿಯಂತ್ರಿಸುವುದನ್ನು ನೀವು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ଚାଳକମାନଙ୍କର ping ଏବଂ traceroute ବ୍ୟବହାରକୁ ନିୟନ୍ତ୍ରଣ କରିବାକୁ ଇଚ୍ଛାକରନ୍ତି
te: వాడుకరులు ping మరియు traceroute వుపయోగించుటనుండి నియంత్రించగోరితే
uk: Якщо ви бажаєте керувати використанням користувачами програм ping і traceroute
zh_tw: 若您希望控制使用者如何使用 ping 和 traceroute

source: If you want to allow ftp servers to use cifs used for public file transfer services.
as: যদি আপুনি ftp চাৰ্ভাৰসমূহক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত cifs ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que servidores ftp utilicen cifs utilizados para los servicios de transferencia dearhivos públicos.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરેલ cifs ને વાપરવા માટે ftp સર્વરોને પરવાનગી આપવા માંગો છો.
ja: ftp サーバが、 cifs を共有ファイル転送サービスを使用することを、もし許可したい場合。
kn: ftp ಪರಿಚಾರಕವು ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ cifs ಗಳನ್ನು ಬಳಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ftp କୁ ସର୍ବସାଧାରଣ ଫାଇଲ ପରିବହନ ସର୍ଭିସଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ବ୍ୟବହୃତ cifs କୁ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: పబ్లిక్ ఫైల్ బదిలీకరణ సేవల కొరకు వుపయోగించుటకు ftp సర్వర్లు cifs వుపయోగించుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити серверам ftp використовувати cifs відкритих служб обміну файлами.
zh_tw: 若您希望允許 ftp 伺服器利用使用於公共檔案傳輸服務的 cifs。

source: If you want to allow the Irssi IRC Client to connect to any port, and to bind to any unreserved port.
as: যদি আপুনি Irssi IRC ক্লাএন্টক যিকোনো পোৰ্টলে সংযোগ কৰাৰ, আৰু যিকোনো অসংৰক্ষিত পোৰ্টলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el cliente Irssi de IRC pueda conectarse a cualquier puerto, y asociarse con cualquier puerto no reservado.
gu: જો તમે કોઇપણ પોર્ટ સાથે જોડાવા માટે Irssi IRC ક્લાયન્ટને પરવાનગી આપવા માંગો છો, અને કોઇપણ અનારક્ષિત પોર્ટને બાંધવા માટે.
ja: Irssi IRC クライアントが、 全ての port を、予約されていない port に結びつけることを、もし許可したい場合。
kn: Irassi IRC ಕ್ಲೈಂಟ್ ಯಾವುದೆ ಯಾವುದೆ ಸಂಪರ್ಕಸ್ಥಾನದೊಂದಿಗೆ ಸಂಪರ್ಕ ಹೊಂದಲು ಹಾಗು ಕಾದಿರಿಸಲಾದ ಸಂಪರ್ಕಸಾಧನದೊಂದಿಗೆ ಬೈಂಡ್ ಆಗಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ Irssi IRC କ୍ଲାଏଣ୍ଟକୁ ଯେକୌଣସି ସାଧାରଣ ପୋର୍ଟ ସହିତ ସଂଯୋଗ କରିବାକୁ, ଏବଂ କୌଣସି ଅସଂରକ୍ଷିତ ପୋର୍ଟକୁ ବାନ୍ଧିବା ପାଇଁ ଅନୁମତି ଦେବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
te: Irssi IRC క్లైంట్ యే పోర్టుకైనా అనుసంధానమగుటకు మీరు అనుమతించగోరితే, మరియు యే నిలిపివుంచని పోర్టుకైనా బందనం చేయగోరితే.
uk: Якщо ви бажаєте дозволити клієнтській програмі IRC Irssi встановлювати з’єднання на довільному порті і прив’язуватися до будь-якого незарезервованого порту.
zh_tw: 若您希望允許 Irssi IRC Client 連至任何連接埠，並綁定至任何未被預定的連接埠。

source: If you want to allow zabbix to connect to unreserved ports
as: যদি আপুনি zabbix ক অসংৰক্ষিত পোৰ্টসমূহলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow Apache to use mod_auth_pam
as: যদি আপুনি Apache ক mod_auth_pam ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que Apache utilice mod_auth_pam
gu: જો તમે mod_auth_pam ને વાપરવા માટે Apache ને પરવાનગી આપવા માંગો છો
ja: Apache が、 mod_auth_pam を使用することを、もし許可したい場合
kn: Apache ಯು mod_auth_pam ಅನ್ನು ಬಳಸುವುದನ್ನು ಅನುಮತಿಸಲು ನೀವು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ mod_auth_pam କୁ ବ୍ୟବହାର କରିବା ପାଇଁ Apache କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు అపాచీను mod_auth_pam వుపయోగించుటను అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити Apache використовувати mod_auth_pam
zh_tw: 如果您想要允許 Apache 使用 mod_auth_pam

source: If you want to allow ftp servers to use nfs used for public file transfer services.
as: যদি আপুনি ftp চাৰ্ভাৰসমূহক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত nfs ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que los servidores ftp utilicen nfs utilizados para los servicios de transferencia dearhivos públicos.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહનન સેવાઓ માટે વાપરેલ nfs ને વાપરવા માટે ftp સર્વરોને પરવાનગી આપવા માંગો છો.
ja: ftp サーバが、 nfs を共有ファイル転送サービスに使用することを、もし許可したい場合。
kn: ftp ಪರಿಚಾರಕವು ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ nfs ಗಳನ್ನು ಬಳಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ftp କୁ ସର୍ବସାଧାରଣ ଫାଇଲ ପରିବହନ ସର୍ଭିସଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ବ୍ୟବହୃତ nfs କୁ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: పబ్లిక్ ఫైల్ బదిలీకరణ సేవల కొరకు ftp సర్వర్లు nfs వుపయోగించుట మీరు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити серверам ftp використовувати nfs відкритих служб обміну файлами.
zh_tw: 如果您想要允許 ftp 伺服器使用用在公開檔案傳輸服務的 nfs。

source: If you want to allow httpd to read home directories
as: যদি আপুনি httpd ক ঘৰ ডাইৰেকটৰি পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que httpd lea directorios personales
gu: જો તમે ઘર ડિરેક્ટરીઓને વાંચવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: httpd が、ホームディレクトリを読むことを、もし許可したい場合
kn: ನೆಲೆ ಕೋಶಗಳನ್ನು httpd ಓದಲು ನೀವು ಅನುಮತಿಸಬೇಕಿದ್ದಲ್ಲಿ
or: ଯଦି ଆପଣ ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ପଢ଼ିବା ପାଇଁ httpd କୁ ଅନୁମତି ଦିଅନ୍ତି
te: మీరు httpd నివాస సంచయాలను చదువుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ httpd до читання даних з домашніх каталогів
zh_tw: 如果您想要允許 httpd 讀取家目錄

source: If you want to allow gpg web domain to modify public files used for public file transfer services.
as: যদি আপুনি gpg ৱেব ডমেইনক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত ৰাজহুৱা নথিপত্ৰসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que dominios web gpg modifiquen archivos públicos utilizados por servicios de transferencia de archivos públicos.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરેલ સાર્વજનિક ફાઇલોને બદલવા માટે gpg વેબ ડોમેઇનને પરવાનગી આપવા માંગો છો.
ja: gpg web ドメインが、 共有ファイルを編集して、共有ファイル転送サービスを使うことを、もし許可したい場合。
kn: gpg ಜಾಲ ಡೊಮೈನ್‌ ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಮಾರ್ಪಡಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ gpg ୱେବ ଡମେନକୁ ସର୍ବସାଧାରଣ ଫାଇଲ ପରିବହନ ସର୍ଭରଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
te: పబ్లిక్ ఫైల్ బదిలీకరణ సేవల కొరకు వుపయోగించు పబ్లిక్ ఫైళ్ళను సవరించుటకు gpg వెబ్ డొమైన్‌ను అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ веб-домену GPG до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами.
zh_tw: 如果您想要允許 gpg 網域修改用以公開傳輸服務的公開檔案。

source: If you want to allow rsync to export any files/directories read only.
as: যদি আপুনি rsync ক যিকোনো নথিপত্ৰ/ডাইৰেকটৰি কেৱল পঢ়িব পৰা হিচাপে এক্সপোৰ্ট কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que rsync exporte cualquier directorio o archivo de solo lectura.
gu: જો તમે કોઇપણ વાંચી શકાય તેવી ફાઇલો/ડિરેક્ટરીઓની નિકાસ કરવા માટે rsync ને પરવાનગી આપવા માંગો છો.
ja: rsync が、 全てのファイルやディレクトリを読み取り専用で転送することを、もし許可したい場合。
kn: rsync ಅನ್ನು ಯಾವುದೆ ಕಡತಗಳನ್ನು/ಕೋಶಗಳನ್ನು ಓದಲು ಮಾತ್ರವಾಗಿ ರವಾನಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ rsync କୁ ଯେକୌଣସି କେବଳ ପଠନୀୟ ଫାଇଲ/ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ପଠାଇବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: ఏదేని ఫైళ్ళు/డైరెక్టరీలు చదువుటకు మాత్రమే అనురీతిలో యెగుమతి చేయుటకు rsyncను అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити rsync експортувати дані файлів або каталогів лише для читання.
zh_tw: 如果您想要允許 rsync 以唯讀方式匯出任何檔案 / 目錄。

source: If you want to allow all unconfined executables to use libraries requiring text relocation that are not labeled textrel_shlib_t
as: যদি আপুনি সকলো উন্মুক্ত এক্সিকিউটেবুল সমূহক লাইব্ৰেৰীসমূহ যাৰ পাঠ পুনঃঅৱস্থানৰ প্ৰয়োজন যিসমূহক textrel_shlib_t লেবেল কৰা হোৱা নাই ব্যৱহাৰ কৰাৰ অনুমতি দিয়ে
es: Si desea permitir que todos los servicios ejecutables no confinados utilicen bibliotecas que piden reubicación de texto y que no estén etiquetados como textrel_shlib_t
gu: જો તમે લખાણ સ્થળાંતર કરવા જરૂરી લાઇબ્રેરીઓને વાપરવા માટે બધા બંધનમુક્ત એક્સક્યૂટેબલને પરવાનગી આપવા માંગો છો કે જે લેબલ textrel_shlib_t થયેલ નથી
ja: 全ての不特定の実行ファイルが、 textrel_shlib_t にラベルされていないライブラリを使用し、テキストの再配置を要求することを、もし許可したい場合
kn: ಎಲ್ಲಾ ನಿರ್ಬಂಧಿತವಲ್ಲದ ಎಕ್ಸಿಗ್ಯೂಟೆಬಲ್‌ಗಳನ್ನು textrel_shlib_t ಎಂದು ಲೇಬಲ್ ಮಾಡದೆ ಇರುವ ಪಠ್ಯದ ಸ್ಥಳಾಂತರದ ಅಗತ್ಯವಿರುವಂತಹ ಲೈಬ್ರರಿಗಳಲ್ಲಿ ಬಳಸಲು ಅನುಮತಿಸಲು ಬಯಸುವಿರಾದರೆ
or: ଯଦି ଆପଣ ସମସ୍ତ ବନ୍ଧିତ ନିଷ୍ପାଦନକୁ ଲାଇବ୍ରେରୀଗୁଡ଼ିକୁ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି ଯାହାକି ପାଠ୍ୟ ସ୍ଥାନାନ୍ତରଣ ଆବଶ୍ୟକ କରିଥାଏ ତାହା textrel_shlib_t ଭାବରେ ନାମକରଣ ହୋଇନଥାଏ
te: textrel_shlib_t తో లేబుల్ చేయని పాఠ పునఃస్థానీకరణకు అవసరమైన లైబ్రరీలను వుపయోగించుటకు లోబడని యెగ్జిక్యూటబుల్స్ అన్నింటిని మీరు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити всім виконуваним файлам без обмежень використовувати бібліотеки потрібні для пересування текстових даних, які не позначено міткою textrel_shlib_t
zh_tw: 如果您想要允許所有未受限的可執行檔使用函式庫，這函式庫需要移動文字、且未標示為 textrel_shlib_t

source: If you want to allow apache scripts to write to public content. Directories/Files must be labeled public_rw_content_t.
as: যদি আপুনি apache লিপিসমূহক ৰাজহুৱা বিষয়বস্তুলে লিখাৰ অনুমতি দিব বিচাৰে। ডাইৰেকটৰিসমূহ/নথিপত্ৰসমূহ public_rw_content_t লেবেল কৰা থাকিব লাগিব।
es: Si desea permitir que scripts apache escriban sobre contenidos públicos. Los archivos o directorios deben ser etiquetados como public_rw_content_t.
gu: જો તમે સાર્વજનિક સમાવિષ્ટમાં લખવા માટે apache સ્ક્રિપ્ટોને પરવાનગી આપવા માંગો છો. ડિરેક્ટરીઓ/ફાઇલોને લેબલ public_rw_content_t થયેલ હોવુ જ જોઇએ.
ja: apache スクリプトが、 共有コンテンツに書き込むことを、もし許可したい場合。ディレクトリやファイルは public_rw_content_t にラベルされていなければいけません。
kn: ಹಂಚಲಾದ ಸಾರ್ವಜನಿಕ ವಿಷಯಕ್ಕೆ apache ಸ್ಕ್ರಿಪ್ಟುಗಳನ್ನು ಬರೆಯಲು ಅನುಮತಿಸಬೇಕಾದಲ್ಲಿ. ಕೋಶಗಳನ್ನು/ಕಡತಗಳನ್ನು public_rw_content_t ಎಂದು ಲೇಬಲ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ.
or: ଯଦି ଆପଣ apache ସ୍କ୍ରିପ୍ଟକୁ ସର୍ବସାଧାରଣ ବିଷୟବସ୍ତୁକୁ ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି। ତେବେ ଡିରେକ୍ଟୋରୀ/ଫାଇଲଗୁଡ଼ିକୁନିଶ୍ଚିତ ଭାବରେ public_rw_content_t ଆକାରରେ ନାମକରଣ ହୋଇଥିବା ଉଚିତ।
te: పబ్లిక్ సారమునకు వ్రాయుటకు మీరు అపాచీ స్క్రిప్టులను అనుమతించగోరితే. డైరెక్టరీలు/ఫైళ్ళు తప్పక public_rw_content_t తో లేబుల్ చేయవలెను.
uk: Якщо ви бажаєте дозволити скриптам apache виконувати запис до каталогів відкритих даних. Каталоги або файли має бути позначено міткою public_rw_content_t.
zh_tw: 如果您想要允許 apache script 寫入公用內容。 目錄 / 檔案必須標示為 public_rw_content_t。

source: If you want to allow qemu to use cifs/Samba file systems
as: যদি আপুনি qemu ক cifs/Samba নথিপত্ৰ প্ৰণালীসমূহ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitirle a qemu utilizar sistemas de arvhivos cifs/Samba
gu: જો તમે cifs/Samba ફાઇલ સિસ્ટમોને વાપરવા માટે qemu ને પરવાનગી આપવા માંગો છો
ja: qemu が、 cifs/Samba ファイルシステムを使用することを、もし許可したい場合
kn: cifs/Samba ಕಡತ ವ್ಯವಸ್ಥೆಗಳು ಬಳಸುವಂತೆ ನೀವು qemu ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ qemu କୁ cifs/Samba ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: cifs/Samba ఫైల్ సిస్టమ్సును వుపయోగించుటకు మీరు qemu ను అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити qemu використовувати файлові системи cifs/Samba
zh_tw: 如果您想要允許 qemu 使用 cifs/Samba 檔案系統

source: If you want to determine whether Polipo session daemon can bind tcp sockets to all unreserved ports.
as: যদি আপুনি নিৰ্ধাৰণ কৰিব বিচাৰে Polipo অধিবেশন ডিমনে সকলো অসংৰক্ষিত পোৰ্টলে tcp চকেটসমূহ সংযোগ কৰিব পাৰে নে।
