Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: If you want to allow unprivileged users to execute DDL statement
as: যদি আপুনি সুবিধাবিহিন ব্যৱহাৰকাৰীসমূহক DDL বিবৃতি এক্সিকিউট কৰাৰ অনুমতি দিব বিচাৰে

source: If httpd scripts should be allowed to write to public directories you need to turn on the $BOOLEAN boolean and change the file context of the public directory to public_content_rw_t. Read the httpd_selinux man page for further information: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t public_content_rw_t <path>"
es: Si los scripts de httpd deben tener acceso de escritura a directorios públicos, necesita poner en 1 el valor de $BOOLEAN y cambiar el contexto de archivo del directorio público a public_content_rw_t. Lea la página man de httpd_selinux para más información: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" También debe cambiar los archivos de contexto de archivo por defecto en el sistema, a los efectos de preservarlos en caso de un reetiquetado completo. "semanage fcontext -a -t public_content_rw_t <path>"
gu: જો httpd સ્ક્રિપ્ટો જાહેર ડિરેક્ટરીઓમાં લખવા માટે માન્ય હોવી જોઈએ તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની અને જાહેર ડિરેક્ટરીનો ફાઈલ સંદર્ભ public_content_rw_t માં બદલવાની જરૂર છે. આગળની જાણકારી માટે httpd_selinux મદદ પાનું વાંચો: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" તમારે સંપૂર્ણ નામ બદલવા પર પણ તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર મૂળભૂત ફાઇલ સંદર્ભ ફાઇલોને પણ બદલવુ જ જોઇએ. "semanage fcontext -a -t public_content_rw_t <path>"
ja: httpd スクリプト が公共ディレクトリーへの書き込み許可を必要とする場合は、 $BOOLEAN ブーリアンをオンにして、公共ディレクトリーのファイルコンテキストを public_content_rw_t に 変更します。詳細は httpd_selinux の man ページをご覧下さい : "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" また、完全な再ラベルでファイルコンテキストを維持する為にはシステム上の デフォルトのファイルコンテキストファイルを変更しなければなりません。 "semanage fcontext -a -t public_content_rw_t <path>"
kn: httpd ಸ್ಕ್ರಿಪ್ಟ್‍ಗಳು ಸಾರ್ವಜನಿಕ ಕೋಶಗಳಿಗೆ ಬರೆಯುವಂತೆ ಅನುಮತಿಸ ಬೇಕೆಂದರೆ ನೀವು $BOOLEAN ಬೂಲಿಯನ್ ಅನ್ನು ಆನ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ ಹಾಗು ಸಾರ್ವಜನಿಕ ಕಡತಕೋಶದ ಕಡತ ಸನ್ನಿವೇಶವನ್ನು public_content_rw_t ಗೆ ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗಾಗಿ httpd_selinux ಈ ಸಹಾಯ ಪುಟವನ್ನು ನೋಡಿ: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" ಲೇಬಲ್ ಅನ್ನು ಸಂಪೂರ್ಣವಾಗಿ ಬದಲಾಯಿಸಿದ ನಂತರವೂ ವ್ಯವಸ್ಥೆಯಲ್ಲಿನ ಕಡತಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಕಡತ ಸನ್ನಿವೇಶಗಳನ್ನು ಕಾಪಾಡಲು ಅವುಗಳನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t public_content_rw_t <path>"
or: ଯଦି httpd ସ୍କ୍ରିପ୍ଟଗୁଡ଼ିକ ଆପଣ ବଦଳାଇବାକୁ ଥିବା ଡିରେକ୍ଟୋରୀରେ ଲେଖିବା ପାଇଁ ଅନୁମତି ପ୍ରାପ୍ତ ହୋଇଥାଏ$BOOLEAN ବୁଲିଆନ ଏବଂ ସାର୍ବଜନିକ ଡିରେକ୍ଟୋରୀର ଫାଇଲ ପ୍ରସଙ୍ଗକୁ public_content_rw_tକୁ ପରିବର୍ତ୍ତନ କରିପାରିବେ। ଅଧିକ ସୂଚନା ପାଇଁ httpd_selinux ର ମୂଖ୍ୟ ପୃଷ୍ଠାକୁ ପଢ଼ନ୍ତୁ: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" ଆପଣଙ୍କୁ ସେହି ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ପାଇଲଗୁଡ଼ିକୁ ତନ୍ତ୍ରରେ ସେମାନଙ୍କୁ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ପରିବର୍ତ୍ତନ କରିବା ଉଚିତ। "semanage fcontext -a -t public_content_rw_t <path>"
te: httpd స్క్రిప్ట్స్‍ అనునవి ఒకవేళ పబ్లిక్ సంచయాలకు వ్రాయుటకు అనుమతింయవలసి వస్తే మీరు $BOOLEAN బూలియన్‌ను అన్ చేసి మరియు దస్త్రము సందర్బం పబ్లిక్‌సంచంయం యొక్కది public_content_rw_t కు మార్చవలసి వస్తుంది. httpd_selinux మాన్ పుటను చదవండి తరువాతి సమాచారం కొరకు: "setsebool -P $‌BOOLEAN=1; chcon -t public_content_rw_t <path>" మీరు అప్రమేయ దస్త్ర సందర్భ దస్త్రాలను సిస్టమ్ పైన వాటిని పూర్తి నమ్మదగినవిగా వుంచుటకు మార్చవలసివుంటుంది. "semanage fcontext -a -t public_content_rw_t <path>"
uk: Для дозволу сценаріям httpd виконання записи у спільні теки необхідно встановити логічну змінну $BOOLEAN та замінити контекст спільної теки на public_content_rw_t. За докладною інформацією зверніться до сторінки довідки httpd_selinux: «setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>» Також треба змінити типові контексти файлів у системі, щоб вони збереглись навіть при повторній розмітці. «semanage fcontext -a -t public_content_rw_t <path>»

source: You must tell SELinux about this by enabling the '%s' boolean.
es: Debe informar esto a SELinux habilitando el booleano '%s'.
gu: '%s' બુલિયનને સક્રિય કરીને આ વિશે તમારે SELinux ને કહેવુ જ જોઇએ.
ja: これについては、SELinux に '%s' boolean を有効にする設定をしなければいけません。
kn: '%s' ಬೂಲಿಯನ್ ಅನ್ನು ಶಕ್ತಗೊಳಿಸುವ ಮೂಲಕ ನೀವು SELinux ಗೆ ಇದರ ಬಗ್ಗೆ ಹೇಳಬೇಕು.
or: '%s' ବୁଲିଆନକୁ ସକ୍ରିୟ କରି ଆପଣ SELinux କୁ ଏହା ବିଷୟରେ କହିବା ଉଚିତ।
te: మీరు '%s' బూలియన్‌ను చేతనము చేయుట ద్వారా SELinuxకు దీని గురించి తెలుపాలి.
uk: Вам слід повідомити про це SELinux наданням логічному параметру «%s» значення true.

source: Ignore if IPV6 is disabled.
es: Ignorar si IPV6 esta deshabilitado.
gu: અવગણો જો IPV6 નિષ્ક્રિય હોય.
ja: IPV6 が無効なら無視します。
kn: IPV6 ಅನ್ನು ಅಶಕ್ತಗೊಳಿಸಲಾಗಿದ್ದಲ್ಲಿ ಆಲಕ್ಷಿಸು.
or: ଯଦି IPV6 କୁ ନିଷ୍କ୍ରିୟ କରାଯାଇଛି ତେବେ ଅଗ୍ରାହ୍ୟ କରନ୍ତୁ।
te: ఒకవేళ IPV6 అచేతనము చేయబడితే పట్టించుకోకు.
uk: Ігноруйте, якщо IPV6 вимкнено.

source: you want to allow want to treat $TARGET_BASE_PATH as pubic content
es: desea permitir que want trate a $TARGET_BASE_PATH como contenido público
gu: સાર્વજનિક સમાવિષ્ટ તરીકે $TARGET_BASE_PATH વર્તવા માટે તમે પરવાનગી આપવા માંગો છો
ja: $TARGET_BASE_PATH を共有コンテンツとして扱うことを、許可したい
kn: $TARGET_BASE_PATH ಅನ್ನು ಸಾರ್ವತ್ರಿಕೆ ವಿಷಯವಾಗಿ ಪರಿಗಣಿಸಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಿ
or: $TARGET_BASE_PATH କୁ ସର୍ବସାଧାରଣ ବିଷୟବସ୍ତୁ ଭାବରେ ବ୍ୟବହାର କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି କି
te: $TARGET_BASE_PATH ను పబ్లిక్ సారంగా పరిగణించాలని అనుకొనుచున్నాను అనేదాన్ని అనుమతించాలని అనుకొనుచున్నారా
uk: ви бажаєте дозволити обробку даних $TARGET_BASE_PATH як відкритих даних

source: If you want to allow unconfined users to transition to the nsplugin domains when running nspluginviewer
es: Si desea permitir que usuarios no confinados se trasladen a dominios en nsplugin cuando ejecuten nspluginviewer
gu: જો તમે nsplugin ડોમેઇનમાં પરિવહન કરવા માટે બંધનમુક્ત વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો જ્યારે nspluginviewer ચલાવી રહ્યા હોય
ja: 不特定のユーザが、 nspluginviewer 動作時に nsplugin に移行することを、もし許可したい場合
kn: nspluginviewer ಅನ್ನು ಚಲಾಯಿಸುವಾಗ ನಿರ್ಬಂಧಿತವಲ್ಲದ ಬಳಕೆದಾರರು nsplugin ಪ್ಲಗ್ಇನ್ ಡೊಮೈನ್‌ಗಳಿಗೆ ವರ್ಗಾವಣೆ ಹೊಂದುವುದನ್ನು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ବନ୍ଧନମୁକ୍ତ ଚାଳକମାନଙ୍କୁ nsplugin ପ୍ଲଗଇନ ଡମେନକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି ଯେତେବେଳେ ତାହା nspluginviewer କୁ ଚଲାଇଥାଏ।
te: nspluginviewer నడుపుచున్నప్పుడు లోబడని వాడుకరులను nsplugin డొమైన్సుకు బదిలీకరణను మీరు అనుమతించగోరితే
uk: Якщо ви бажаєте переводити користувача без обмежень до доменів nsplugin під час запуску nspluginviewer

source: If you want to allow ftp servers to use connect to mysql database
es: Si desea permitir que servidores ftp sean utilizados para conectarse a una base de datos mysql
gu: જો તમે mysql ડેટાબેઝ સાથે જોડાવા માટે ftp સર્વરોને પરવાનગી આપવા માંગો છો
ja: ftp サーバが、 mysql データベースに接続することを、もし許可したい場合
kn: mysql ದತ್ತಸಂಚಯದೊಂದಿಗೆ ftp ಪರಿಚಾರಕಗಳು ಸಂಪರ್ಕವನ್ನು ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ
or: ଯଦି ଆପଣ ftp ସର୍ଭରଗୁଡ଼ିକୁ mysql ତଥ୍ୟାଧାର ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
te: ftp సర్వర్లను mysql డాటాబేస్‌కు అనుసంధానించబడుటకు మీరు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити серверам ftp встановлювати з’єднання з базою даних mysql

source: If you want to transition to confined qemu domains from unconfined user
es: Si desea que un usuario no confinado se traslade a dominios qemu confinados
gu: જો તમે બંધનમુક્ત વપરાશકર્તામાંથી મર્યાદિત qemu ડોમેઇનો માટે પરિવહન કરવા માંગો છો
ja: 不特定のユーザを、特定の qemu ドメインへ、もし移行したい場合
kn: ನಿರ್ಬಂಧಿತವಲ್ಲದ ಬಳಕೆದಾರರಿಂದ ನಿರ್ಬಂಧಿತವಾದ qemu ಡೊಮೈನ್‌ಗಳಿಗೆ ವರ್ಗಾಯಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ବନ୍ଧିତ qemu ଡମେନଗୁଡ଼ିକୁ ଅବନ୍ଧିତ ଚାଳକପାଖରୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ଚାହାନ୍ତି
te: లోబడిన qemu డొమైన్లకు లోబడని వాడుకరినుండి బదిలీకరించగోరితే
uk: Якщо ви бажаєте дозволити переведення до обмежених доменів qemu від імені користувача без обмежень

source: If you want to allow exim to connect to databases (postgres, mysql)
es: Si desea permitir que exim se conecte a bases de datos (postgres, mysql)
gu: જો તમે ડેટાબેઝો (postgres, mysql) સાથે જોડાવા માટે exim ને પરવાનગી આપવા માંગો છો
ja: exim が、 データベース (postgres, mysql) に接続することを、もし許可したい場合
kn: ದತ್ತಸಂಚಯಗಳೊಂದಿಗೆ (postgres, mysql) exim ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ)
or: ଯଦି ଆପଣ exim କୁ ତଥ୍ୟାଧାର ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି (postgres, mysql)
te: మీరు exim ను డాటాబేస్‌ల (postgres, mysql) అనుసంధానమునకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити exim встановлювати з’єднання з базами даних (postgres, mysql)

source: If you want to allow unconfined executables to map a memory region as both executable and writable, this is dangerous and the executable should be reported in bugzilla
es: Si desea permitir que ejecutables no confinados mapeen porciones de moemoria tanto como ejecutables como modificables (writable). Esto es peligroso, y el ejecutable no confinado debería ser reportado en bugzilla
gu: જો તમે બંને એક્સક્યૂટેબલ અને લખી શકાય તેવા મેમરી વિસ્તારને મેપ કરવા માટે બંધનમુક્ત એક્સક્યૂટેબલને પરવાનગી આપવા માંગો છો, આ ખતરનાક છે અને એક્સક્યૂટેબલે બગઝીલામાં અહેવાલ કરવો જોઇએ
ja: 不特定の実行ファイルが、 メモリ region を実行可能且つ書込み可能マップすることを、もし許可したい場合。これは危険で、この実行ファイルは bugzilla で報告されるべきです。
kn: ನಿರ್ಬಂಧಿತವಲ್ಲದ ಎಕ್ಸಿಗ್ಯೂಟೆಬಲ್‌ಗಳನ್ನು ಒಂದು ಮೆಮೊರಿ ಸ್ಥಳಕ್ಕೆ ಎಕ್ಸಿಗ್ಯೂಟೆಬಲ್ ಹಾಗು ಬರೆಯಬಹುದಾದ ರೀತಿಯಲ್ಲಿ ಮ್ಯಾಪ್ ಮಾಡಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ, ಇದು ಅಪಾಯಕಾರಿಯಾಗಿರುತ್ತದೆ ಹಾಗು ಎಕ್ಸಿಗ್ಯೂಟೆಬಲ್ ಅನ್ನು ಬಗ್‌ಝಿಲ್ಲಾದಲ್ಲಿ ವರದಿ ಮಾಡಬೇಕಾಗುತ್ತದೆ
or: ଯଦି ଆପଣ ଅବନ୍ଧିତ ନିଷ୍ପାଦନଯୋଗ୍ୟକୁ ସ୍ମୃତିସ୍ଥାନରେ ଉଭୟ ନିଷ୍ପାଦନଯୋଗ୍ୟ ଏବଂ ଲିଖନଯୋଗ୍ୟ ଭାବରେ map କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି, ତେବେ ଏହା ବିପଦଜନକ ହୋଇଥାଏ ଏବଂ ନିଷ୍ପାଦନଗୁଡ଼ିକୁ bugzilla ରେ ଖବର କରାଯାଇଥାଏ
te: లోబడని యెగ్జిక్యూటబుల్సును మెమొరీ ప్రాంతమునకు నిర్వర్తించదగునదిగా మరియు వ్రాయదగునవిగా మాప్ చేయుటకు అనుమతించగోరితే, ఇది ప్రమాదకరం మరియు యెగ్జిక్యూటబుల్ బగ్‌జిల్లానందు నివేదించబడాలి
uk: Якщо ви бажаєте дозволити виконуваним файлам без обмежень відображати ділянку пам’яті одночасно на виконувану і придатну до запису області, такий доступ є небезпечним. Вам слід повідомити про такий виконуваний файл до системи стеження за вадами

source: If you want to allow sshd to forward port connections
es: Si desea permitir que sshd reenvíe conexiones de puerto
gu: જો તમે ફૉર્વર્ડ પોર્ટ જોડાણો માટે sshd ને પરવાનગી આપવા માંગો છો
ja: sshd が、 port 接続を転送することを、もし許可したい場合。
kn: ಫಾರ್ವಾರ್ಡ್ ಸಂಪರ್ಕಸ್ಥಾನ ಸಂಪರ್ಕಗಳಿಗಾಗಿ sshd ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ
or: ଯଦି ଆପଣ sshd କୁ ଅଗ୍ରସରଣ ପୋର୍ଟ ସଂଯୋଗଗୁଡ଼ିକୁ ଅନୁମତି ଦେବା ପାଇଁ ଛାହୁଁଛନ୍ତି
te: మీరు పోర్టు అనుసంధానములను ఫార్వార్డు చేయుటకు sshdను అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ sshd до переспрямування з’єднань з портами

source: If you want to allow vidio playing tools to tun unconfined
es: Si desea permitir que las herramientas de reproducción vidio se ejecuten confinadas
gu: જો તમે બંધનમુક્ત રાકવા માટે વિડિયો પ્લેયિંગ સાધનને પરવાનગી આપવા માંગો છો
ja: 制約無しでビデオ再生ツールの実行を許可したい場合
kn: ವೀಡಿಯೊವನ್ನು ಚಲಾಯಿಸುವ ಉಪಕರಣಗಳನ್ನು ನಿರ್ಬಂಧಿತವಲ್ಲದ ರೀತಿಯಲ್ಲಿ ಚಲಾಯಿಸುವಂತೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ଭିଡିଓ ଚାଳକ ଉପକରଣକୁ ଚଲାଇବା ପାଇଁ ଅନୁମତି ଦିଅନ୍ତି
uk: Якщо ви бажаєте дозволити програмам, пов’язаним з відео, запускатися у режимі без обмежень

source: If you want to allow Puppet master to use connect to mysql and postgresql database
es: Si desea permitir que Puppet maestro se conecte a base de datos mysql y postgresql
gu: જો તમે mysql અને postgresql ડેટાબેઝ સાથે જોડાવા માટે Pupper માસ્ટર પરવાનગી આપવા માંગો છો
ja: Pupper マスターが、 mysql と postgresql データベースに接続することを許可したい場合
kn: mysql ಹಾಗು postgresql ದತ್ತಸಂಚಯದೊಂದಿಗೆ ಸಂಪರ್ಕವನ್ನು ಸಾಧಿಸಲು Puppet ಮಾಸ್ಟರ್ ಅನ್ನು ಬಳಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ
uk: Якщо ви бажаєте дозволити основній частині Puppet використовувати з’єднання з базою даних mysql і postgresql

source: If you want to allow unprived users to execute DDL statement
es: Si desea permitir que usuarios no privados ejecuten estatutos DDL
gu: જો તમે DDL વાક્યને ચલાવવા માટે બિનઅધિકારી વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો
ja: 権限のないユーザが、 DDL ステートメントを実行することを、もし許可したい場合
kn: ಅಧಿಕಾರವಿಲ್ಲದ ಬಳಕೆದಾರರು DDL ಹೇಳಿಕೆಯನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಲು ಅನುಮತಿಸಬೇಕೆಂದರೆ
or: ଯଦି ଆପଣ unprived ଚାଳକମାନଙ୍କୁ DDL ଅଭିବ୍ୟକ୍ତିକୁ ନିଷ୍ପାଦନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте дозволити непривілейованим користувачам виконувати інструкцію DDL
