Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be a mislabeled. $TARGET_PATH default SELinux type is <B>%s</B>, but its current type is <B>$TARGET_TYPE</B>. Changing this file back to the default type, may fix your problem. <p> File contexts can be assigned to a file in the following ways. <ul> <li>Files created in a directory receive the file context of the parent directory by default. <li>The SELinux policy might override the default label inherited from the parent directory by specifying a process running in context A which creates a file in a directory labeled B will instead create the file with label C. An example of this would be the dhcp client running with the dhclient_t type and creating a file in the directory /etc. This file would normally receive the etc_t type due to parental inheritance but instead the file is labeled with the net_conf_t type because the SELinux policy specifies this. <li>Users can change the file context on a file using tools such as chcon, or restorecon. </ul> This file could have been mislabeled either by user error, or if an normally confined application was run under the wrong domain. <p> However, this might also indicate a bug in SELinux because the file should not have been labeled with this type. <p> If you believe this is a bug, please file a bug report against this package.
as: SELinux এ $SOURCE দ্বাৰা অনুৰোধ কৰা অভিগম নাকচ কৰিলে। $TARGET_PATH ভুলভাৱে লেবেল কৰা তাকিব পাৰে। $TARGET_PATH অবিকল্পিত SELinux ধৰণ হল <B>%s</B>, কিন্তু ইয়াৰ বৰ্তমান ধৰণ হল <B>$TARGET_TYPE</B>। এই নথিপত্ৰক অবিকল্পিত ধৰণলে সলনি কৰিলে, এই সমস্যাৰ সমাধান হব পাৰে। <p> নথিপত্ৰ পৰিপ্ৰেক্ষতিতসমূহক এটা নথিপত্ৰলে নিম্নলিখিত ধৰণৰে ধাৰ্য্য কৰিব পৰা যাব। <ul> <li>এটা ডাইৰেকটৰিত সৃষ্টি কৰা নথিপত্ৰসমূহ উপধায়ক ডাইৰেকটৰিৰ নথিপত্ৰ পৰিপ্ৰেক্ষতিত অবিকল্পিতভাৱে গ্ৰহণ কৰে। <li>SELinux নীতিয়ে উপধায়ক ডাইৰেকটৰিৰ পৰা ইনহেৰিট কৰা অবিকল্পিত লেবেল অভাৰৰাইড কৰিব পাৰে পৰিপ্ৰেক্ষতিত A ত এটা প্ৰক্ৰিয়া ধাৰ্য্য কৰি যি B লেবেল কৰা ডাইৰেকটৰিত এটা নথিপত্ৰ সৃষ্টি কৰে যি পৰৱৰ্তী C লেবেলৰ সৈতে নথিপত্ৰ সৃষ্টি কৰে। ইয়াৰ এটা উদাহৰণ হব dhclient_t ধৰণৰ সৈতে চলি থকা dhcp ক্লাএন্ট আৰু ডাইৰেকটৰি /etc ত এটা নথিপত্ৰ সৃষ্টি কৰা। এই ফাইলে সাধাৰণত etc_t ধৰণক উপধায়ক ইনহেৰিটেন্চৰ বাবে প্ৰাপ্ত কৰিব কিন্তু ইয়াৰ পৰিৱৰ্তে নথিপত্ৰ net_conf_t ধৰণৰ সৈতে লেবেল কৰা হয় কাৰণ SELinux নীতিয়ে ইয়াক ধাৰ্য্য কৰে। <li>ব্যৱহাৰকাৰীসমূহে এটা নথিপত্ৰত নথিপত্ৰ পৰিপ্ৰেক্ষতিত সঁজুলিসমূহ যেনে chcon, অথবা restorecon ব্যৱহাৰ কৰি সলনি কৰিব পাৰিব। </ul> এই নথিপত্ৰ হয়তো ব্যৱহাৰকাৰী ত্ৰুটিৰ বাবে ভুলদৰে লেবেল হৈছে, অথবা যদি এটা সাধাৰণত গোপন অনুপ্ৰয়োগ এটা ভুল ডমেইনৰ অন্তৰ্গত আছিল। <p> যি কি নহওক, ই এটা SELinux ত এটা বাগ হব পাৰে কাৰণ নথিপত্ৰ এই ধৰণে লেবেল থাকিব নালাগিছিল। <p> যদি আপুনি ভাৱে ই এটা বাগ, অনুগ্ৰহ কৰি এই পেকেইজৰ বাবে এটা বাগ সংবাদ জমা দিয়ক।
es: SELinux negó el acceso requerido por $SOURCE. $TARGET_PATH puede estar mal etiquetado. El tipo SELinux predeterminado de $TARGET_PATH es <B>%s</B>, mientras que su tipo actual es <B>$TARGET_TYPE</B>. Modificar este archivo a su tipo predeterminado puede corregir este problema. <p> Los contextos de archivo pueden ser asignados a un archivo de las siguientes maneras. <ul> <li>De manera predeterminada, los archivos creados en un directorio reciben el contexto de archivo del directorio padre. <li>La política de SELinux puede cambiar esta etiqueta heredada en forma predeterminada desde el directorio padre, especificando que un proceso que corre en el contexto A, en vez de crear un archivo en un directorio etiquetado como B, en realidad creará archivos etiquetados como C. Un ejemplo de esto sería el cliente dhcp corriendo con el tipo dhclient_t creando un archivo en el directorio /etc. Este archivo recibiría normalmente el tipo etc_t debido a la herencia, pero en su lugar el archivo es etiquetado con el tipo net_conf_t porque la política SELinux lo indica así. <li> Los usuarios pueden modificar el contexto de un archivo utilizabdo herramientas como chcon o restorecon. </ul> Este archivo puede haber sido mal etiquetado por un error del usuario, o bien por una aplicación normalmente confinada que estuvo corriendo en el dominio incorrecto. <p> Sin embargo, esto también puede indicar un error de SELinux, ya que el archivo no debería haber sido etiquetado con este tipo. <p> Si piensa que es un error, por favor envíe un reporte de error contra este paquete.
gu: SELinux એ $SOURCE દ્વારા અરજી થયેલ વપરાશની નામંજૂરી આપી. $TARGET_PATH એ ખોટી રીતે લેબલ થયેલ હોઈ શકે. $TARGET_PATH મૂળભૂત SELinux પ્રકાર <B>%s</B> છે, પરંતુ તેનો વર્તમાન પ્રકાર <B>$TARGET_TYPE</B> છે. આ ફાઈલને મૂળભૂત પ્રકારમાં બદલવાનું, તમારી સમસ્યા સુધારી શકશે. <p> ફાઈલ સંદર્ભો ફાઈલને નીચેના માર્ગોએ સોંપી શકાશે. <ul> <li>ડિરેક્ટરીમાં બનાવેલ ફાઈલો પિતૃ ડિરેક્ટરીનો મૂળભૂત રીતે ફાઈલ સંદર્ભ મેળવે. <li>SELinux પોલીસિ પિતૃ ડિરેક્ટરીમાંથી બોલાવીને મૂળભૂત લેબલ પર ફરીથી લખી શકશે સંદર્ભ A માં ચાલી રહેલ પ્રક્રિયા સ્પષ્ટ કરીને કે જે B લેબલવાળી ડિરેક્ટરીમાં ફાઈલ બનાવે છે તે તેની જગ્યાએ લેબલ C સાથેની ફાઈલ બનાવશે. આનું ઉદાહરણ dhcp ક્લાઈન્ટ હોઈ શકે કે જે dhclient_t પ્રકાર સાથે ચલાવી રહ્યું હોય અને ડિરેક્ટરી /etc માં ફાઈલ બનાવો. આ ફાઈલ સામાન્ય રીતે etc_t પ્રકાર મેળવવી જોઈએ સંભવિત બોલાવાને કારણે પરંતુ તેની જગ્યાએ ફાઈલ એ net_conf_t પ્રકાર સાથે લેબલ થયેલ હોય છે કારણ કે SELinux પોલીસિ આને સ્પષ્ટ કરે છે. <li>વપરાશકર્તાઓ ફાઈલ પરનો ફાઈલ સંદર્ભ બદલી શકે છે chcon, અથવા restorecon જેવા સાધનોની મદદથી. </ul> આ ફાઈલ ક્યાં તો વપરાશકર્તા ભૂલને કારણે ખોટી રીતે લેબલ થઈ ગયેલ હોઈ શકે, અથવા જો સામાન્ય રીતે શુદ્ધ થયેલ કાર્યક્રમની મદદથી કે જે ખોટા ડોમેઈન હેઠળ ચાલી રહ્યો હતો. <p> છતાંય, આ SELinux માં પણ ભૂલ બતાતવી શકશે કારણ કે ફાઈલ આ પ્રકાર સાથે લેબલ થયેલ હોવી જોઈએ નહિં. <p> જો તમે એમ માનો કે આ ભૂલ છે, તો મહેરબાની કરીને આ પેકેજ વિરુદ્ધ ભૂલ અહેવાલ જમા કરો.
ja: SELinux は $SOURCE により要求されたアクセスを拒否しました。$TARGET_PATH が 間違ったラベルを持つ可能性があります。 $TARGET_PATH のデフォルト SELinux タイプは <B>%s</B> ですが、その現在のタイプは <B>$TARGET_TYPE</B> です。 このファイルを デフォルトのタイプに戻すことにより、問題が解決するかも知れません。 <p> ファイルコンテキストは以下の方法で １つのファイルに割り当てることが出来ます。 <ul> <li>１つのディレクトリー内で作成されたファイルは、デフォルトで親ディレクトリのファイルコンテキストを受け取ります。 <li>SELinux ポリシーは、ラベル B と言うディレクトリー内にファイルを 作成するコンテキスト A 内で実行しているプロセスを指定することにより、 親ディレクトリーから継承したデフォルトのラベルを上書きして その代わりに、ラベル C を持つファイルを作成するようになります。 この例として、dhclient_t タイプで実行していて、ディレクトリー /etc 内に ファイルを作成するような dhcp クライアントがあります。このファイルは、 通常、親からの継承の為に etc_t タイプを受け取りますが、SELinux ポリシーが指定することにより、代わりに net_conf_t タイプでラベルが付けられます。 <li>ユーザーは、chcon や restorecon などのツールを使用することで、 ファイル上のファイルコンテキストを変更することができます。 </ul> このファイルは、ユーザーエラーか、又は正常に制約されたアプリケーションが 間違ったドメインで実行されたことにより、 間違ったラベルが付けられた可能性があります。 <p> しかし、ファイルがこのタイプのラベルが付くはずがない為、これは、SELinux 内のバグである 可能性があります。 <p> これがバグだと思われる場合は、このパッケージに対してバグレポートを作成して下さい。
kn: $SOURCE ನಿಂದ ಸಲ್ಲಿಸಲಾದ ಮನವಿಯನ್ನು SELinux ತಿರಸ್ಕರಿಸಿದೆ. $TARGET_PATH ಯು ತಪ್ಪಾಗಿ ಲೇಬಲ್ ಮಾಡಲ್ಪಟ್ಟಿದೆ. $TARGET_PATH ನ ಪೂರ್ವನಿಯೋಜಿತ SELinux ಬಗೆಯು <B>%s</B>,ಆಗಿರುತ್ತದೆ, ಆದರೆ ಈಗಿರುವ ಬಗೆಯು <B>$TARGET_TYPE</B> ಆಗಿದೆ. ಈ ಕಡತವನ್ನು ಮರಳಿ ಪೂರ್ವನಿಯೋಜಿತಕ್ಕೆ ಬದಲಾಯಿಸಿದಲ್ಲಿ ಈ ತೊಂದರೆಯು ಪರಿಹರಿಸಲ್ಪಡಬಹುದು. <p> ಕಡತ ಸನ್ನಿವೇಶಗಳನ್ನು ಈ ಕೆಳಗಿನ ರೀತಿಯಲ್ಲಿ ಒಂದು ಕಡತಕ್ಕೆ ನಿಯೋಜಿಸಬಹುದಾಗಿದೆ. <ul> <li>ಒಂದು ಕಡತಕೋಶದಲ್ಲಿ ನಿರ್ಮಿಸಲ್ಪಟ್ಟ ಕಡತಗಳು ಪೂರ್ವನಿಯೋಜಿತವಾಗಿ ಮೂಲ ಕಡತಕೋಶದ ಸನ್ನಿವೇಶಗಳನ್ನು ಹೊಂದುತ್ತವೆ. <li>The SELinux ಪಾಲಿಸಿಯು ಸನ್ನಿವೇಶ A ನಲ್ಲಿ ಚಲಾಯಿತಗೊಳ್ಳುತ್ತಿರುವ ಒಂದು ಪ್ರಕ್ರಿಯೆಗೆ B ಎಂದು ಲೇಬಲ್ ಮಾಡಲಾದ ಒಂದು ಕಡತಕೋಶದಲ್ಲಿ ನಿರ್ಮಿಸಲಾದ ಕಡತವು ಬದಲಿಗೆ ಲೇಬಲ್ C ಯನ್ನು ಹೊಂದಿರುವ ಕಡತವನ್ನು ನಿರ್ಮಿಸಲು ಸೂಚಿಸುವ ಮೂಲಕ ಮೂಲ ಕಡತಕೋಶದಿಂದ ಒದಗಿ ಬಂದ ಲೇಬಲ್‍ ಅನ್ನು ತಿದ್ದಿಬರೆಯಬಹುದು ಇದಕ್ಕೊಂದು ಉದಾಹರಣೆ ಎಂದರೆ , dhclient_t ಯೊಂದಿಗೆ ಚಲಾಯಿತಗೊಳ್ಳುತ್ತಿರುವ dhcp ಕ್ಲೈಂಟ್‍ಕಡತಕೋಶ /etc ಯಲ್ಲಿ ಒಂದು ಕಡತವನ್ನು ನಿರ್ಮಿಸುತ್ತದೆ. ಈ ಕಡತವು ಸಾಮಾನ್ಯವಾಗಿ ಮೂಲದ ಪಾರಂಪರಿಕವಾಗಿ etc_t ಬಗೆಯನ್ನು ಪಡೆದುಕೊಳ್ಳಬೇಕು ಆದರೆ SELinux ಪಾಲಿಸಿಯು ಇದಕ್ಕೆ net_conf_t ಬಗೆಯ ಲೇಬಲ್ ಅನ್ನು ನಿಗದಿ ಪಡಿಸುತ್ತದೆ. <li>ಬಳಕೆದಾರರು chcon, ಅಥವ restorecon ನಂತಹ ಉಪಕರಣವನ್ನು ಬಳಸಿಕೊಂಡು ಒಂದು ಕಡತದ ಕಡತ ಸನ್ನಿವೇಶವನ್ನು ಬದಲಾಯಿಸಬಹುದು. </ul> ಈ ಕಡತವು ಬಳಕೆದಾರರ ತಪ್ಪಿನಿಂದಾಗಿ ಅಥವ ಒಂದು ನಿಗದಿತ ಅನ್ವಯವು ತಪ್ಪು ಕ್ಷೇತ್ರದ ಅಡಿಯಲ್ಲಿ ಚಲಾಯಿಸಲ್ಪಡುವುದಲ್ಲಿ ತಪ್ಪು ಲೇಬಲ್ ಮಾಡಲ್ಪಟ್ಟಿರಬಹುದು. <p> ಆದರೆ, ಇದು SELinux ನಲ್ಲಿನ ಒಂದು ದೋಷವೂ ಆಗಿರಬಹುದು ಏಕೆಂದರೆ ಕಡತಕ್ಕೆ ಈ ಬಗೆಯ ಲೇಬಲ್ ಆಗಿರಬಾರದು . <p> ಇದು ಒಂದು ದೋಷವೆಂದು ನಿಮಗೆ ಅನಿಸಿದಲ್ಲಿ, ದಯವಿಟ್ಟು ಈ ಪ್ಯಾಕೇಜ್‍ನ ವಿರುದ್ದ ಒಂದು ದೋಷ ವರದಿಯನ್ನು ಸಲ್ಲಿಸಿ.
uk: Правила SELinux забороняють доступ за запитом $SOURCE. Можливо, розмітка $TARGET_PATH некоректна. Стандартний тип SELinux для $TARGET_PATH має значення <B>%s</B>, але наразі тип — <B>$TARGET_TYPE</B>. Зміна типу на стандартний може виправити проблему. <p> Є декілька способів призначення контексту файлу. <ul> <li>Створювані у каталозі файли типово будуть успадковувати контекст каталогу. <li>Правила SELinux можуть перевизначити стандартні позначки, успадковані від батьківського каталогу. Так, процес з контекстом X, який створює файл у каталозі, позначеному як Y, насправді створює файл з позначкою Z. Прикладом може бути клієнт dhcp з типом dhclient_t, який створює файли у каталозі /etc. Зазвичай ці файли успадковують тип etc_t батьківського каталогу, але у цьому випадку він буде позначений як net_conf_t відповідно до параметрів SELinux. <li>Користувачі можуть змінити файловий контекст за допомогою chcon чи restorecon. </ul> Можливо, цей файл був помилково позначений неправильно чи він є обмежуваною програмою, що виконується у неправильному домені. <p> Проте це також може бути ознакою помилки у SELinux, оскільки файл не повинен бути так позначений. <p> Якщо ви думаєте, що це помилка, створіть запит у Bugzilla для цього пакета.
zh_tw: SELinux 拒絕 $SOURCE 的存取請求。$TARGET_PATH 可能 標記錯誤。$TARGET_PATH 預設 SELinux 類型為 <B>%s</B>，但它目前的類型為 <B>$TARGET_TYPE</B>。將 此檔案變更回預設類型可能修正您的問題。 <p> 檔案情境可以透過下列方式指派給檔案。 <ul> <li>目錄中建立的檔案預設情況下接收上層目錄的檔案情境。 <li>SELinux 方針可能透過指定執行情境 A 的程序在標記 B 的目錄中建立檔案， 建立的檔案標籤為 C 的方式，來凌駕從上層目錄繼承的預設標籤。這個情況 的例子為 dhcp 客戶端以 dhclient_t 類型執行，並在 /etc 目錄中建立檔案。 這個檔案一般由於親代繼承會接收 etc_t 類型；但該檔案會被標記為 net_conf_t 類型，因為 SELinux 方針指定這樣處理。 <li>使用者可以使用像是 chcon 或 restorecon 等工具來變更檔案的檔案情境。 </ul> 這個檔案可能由於使用者的錯誤，或是一般受限制應用程式在錯誤網域下執行而標記 錯誤。 <p> 然而，這可能暗示 SELinux 有臭蟲，因為該檔案不應該被標記為這種類型。 <p> 如果您認為這是臭蟲，請針對此套件提交一份臭蟲回報。

source: you want to fix the label. $TARGET_PATH default label should be %s.
as: আপুনি লেবেল ঠিক কৰিব বিচাৰে। $TARGET_PATH অবিকল্পিত লেবেল %s হব লাগিব।
es: desea arreglar la etiqueta . La etiqueta predeterminada de $TARGET_PATH debería ser %s.
gu: તમે લેબલને સુધારવા માંગો છો, $TARGET_PATH મૂળભૂત લેબલ %s હોવુ જોઇએ.
ja: ラベルを修正することになります。 $TARGET_PATH のデフォルトラベルは %s のはずです。
kn: ನೀವು ಲೇಬಲ್ ಅನ್ನು ಸರಿಪಡಿಸಲು ಬಯಸುತ್ತೀರಿ. $TARGET_PATH ಪೂರ್ವನಿಯೋಜಿತ ಲೇಬಲ್ %s ಆಗಿರಬೇಕು.
uk: ви бажаєте виправити мітку, типовою міткою $TARGET_PATH має бути %s.
zh_tw: 您希望修正標籤。 $TARGET_PATH 預設標籤應為 %s。

source: you can run restorecon.
as: আপুনি restorecon চলাব পাৰিব।
es: puede ejecutar restorecon.
gu: તમે restorecon ને ચલાવી શકો છો.
ja: restorecon を実行することができます。
kn: restorecon ಅನ್ನು ಚಲಾಯಿಸಬಹುದು.
or: ଆପଣ restorecon କୁ ଚଲାଇପାରିବେ।
te: మీరు restorecon ను నడుపగలరు.
uk: ви можете запустити restorecon.
zh_tw: 您可以執行 restorecon。

source: Restore Context
as: পুনৰুদ্ধাৰ পৰিপ্ৰেক্ষতিত
es: Restaurar Contexto
gu: સંદર્ભને પુન:સંગ્રહો
ja: コンテキストの 復元
kn: ಸನ್ನಿವೇಶವನ್ನು ಮರಳಿ ಸ್ಥಾಪಿಸು
or: ପୁନସ୍ଥାପନ କରନ୍ତୁ ପ୍ରସଙ୍ଗ
uk: Відновити контекст
zh_tw: 還原 情境

source: SELinux denied rsync access to $TARGET_PATH. If this is a RSYNC repository it has to have a file context label of rsync_data_t. If you did not intend to use $TARGET_PATH as a rsync repository it could indicate either a bug or it could signal a intrusion attempt.
as: SELinux এ $TARGET_PATH লে rsync অভিগম নাকচ কৰিলে। যদি ই এটা RSYNC ভঁৰাল হয় ইয়াৰ এটা rsync_data_t নথিপত্ৰ পৰিপ্ৰেক্ষতিত লেবেল থাকিব লাগিব। যদি $TARGET_PATH ক এটা rsync ভঁৰাল হিচাপে ব্যৱহাৰ কৰিব নিবিচাৰে ই এটা বাগ অথবা এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত হব পাৰে।
es: SELinux negó el acceso a $TARGET_PATH a rsync. Si éste es un repositorio RSYNC debe tener la etiqueta de contexto de archivo de rsync_data_t. Si no pretende usar $TARGET_PATH como un repositorio rsync, puede ser un error o una señal de un intento de ataque.
gu: SELinux એ $TARGET_PATH નો rsync વપરાશ નામંજૂર કર્યો. જો આ RSYNC રીપોઝીટરી હોય તો તેને rsync_data_t નું ફાઈલ સંદર્ભ લેબલ હોવું જોઈએ. જો તમે $TARGET_PATH ને rsync રીપોઝીટરી તરીકે વાપરવાનો હેતુ રાખ્યો નહિં હોય તો તે ક્યાં તો ભૂલ તરીકે સૂચવી શક્યું હોત અથવા તે ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.
ja: SELinux は rsync が $TARGET_PATH にアクセスするのを拒否しました。 これが、RSYNC のレポジトリーであるなら、rsync_data_t のファイル コンテキストラベルを持っている必要があります。$TARGET_PATH を rsync レポジトリーとして使用する予定でなかった場合、これはバグか、 あるいは、侵入の試みを示します。
kn: $TARGET_PATH ಗೆ rsync ಅನುಮತಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ಇದು ಒಂದು RSYNC ರೆಪೊಸಿಟರಿಯಾಗಿದ್ದಲ್ಲಿ ಇದರ ಕಡತ ಸನ್ನಿವೇಶವು rsync_data_t ಆಗಿರಬೇಕು. ನೀವು $TARGET_PATH ಅನ್ನು ಒಂದು rsync ರೆಪೊಸಿಟರಿಯಾಗಿ ಬಳಸಲು ಇಚ್ಛಿಸದೆ ಇದ್ದ ಪಕ್ಷದಲ್ಲಿ ಇದು ಒಂದು ದೋಷ ಅಥವ ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲಾಗುತ್ತದೆ
or: SELinux $TARGET_PATH କୁ rsync ଅଭିଗମ୍ୟତା ପାଇଁ ବାରଣ କରିଛି। ଯଦି ଏହା ଏକ RSYNC ସଂଗ୍ରହାଳୟ ତେବେ ଏଥିରେ rsync_data_t ନାମରେ ଫାଇଲ ପ୍ରସଙ୍ଗ ଥିବା ଉଚିତ। ଯଦି ଆପଣ $TARGET_PATH କୁ rsync ସଂଗ୍ରହାଳୟ ଭାବରେ ବ୍ୟବହାର କରିବାକୁଚାହୁଁନାହାନ୍ତି ତେବେ ଏହା ସମ୍ଭବତଃ ଗୋଟିଏ ତ୍ରୁଟିକୁ ସୂଚାଇପାରେ କିମ୍ବା ଏହା ଏକ ବିନାଅନୁମତି ପ୍ରବେଶକୁ ସୂଚାଇପାରେ।
te: SELinux అనునది rsync వాడుకను $TARGET_PATHకు తిరస్కరిస్తుంది. ఇది ఒక RSYNC రిపోజిటరీ అయితే ఇది ఒక దస్త్రము లేబుల్‌ను కలిగివుండాలి rsync_data_t యొక్కది. మీరు $TARGET_PATH ను rsync రిపోజిటరీలాగా వాడాలని లేకపోతే ఇది బగ్‌ గా గాని లేదా అమర్యాద యత్నముగా గాని సూచిస్తుంది.
uk: SELinux заборонила доступ rsync до $TARGET_PATH. Якщо це репозиторій RSYNC, він повинен мати контекст rsync_data_t. Якщо ви не використовуєте $TARGET_PATH як репозиторій rsync, можливо це помилка або спроба вторгнення.
zh_tw: SELinux 拒絕 rsync 存取 $TARGET_PATH。 若這是個 RSYNC 儲存庫的話，它必須要有個標記為 rsync_data_t 的 檔案情境。若您並未嘗試使用 $TARGET_PATH 來作為 rsync 儲存庫的話， 這顯示可能有臭蟲，或可能是系統已遭到嘗試入侵的警訊。

source: You can alter the file context by executing chcon -R -t rsync_data_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
as: আপুনি chcon -R -t rsync_data_t '$TARGET_PATH' এক্সিকিউট কৰি নথিপত্ৰ পৰিপ্ৰেক্ষতিত সলনি কৰিব পাৰিব আপুনি লগতে চিস্টেমত অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহ সলনি কৰিব লাগিব সিহতক এটা সম্পূৰ্ণ পুনৰলেবেলত সংৰক্ষণ কৰিবলে। "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
es: Puede modificar el contexto de archivo ejecutando chcon -R -t rsync_data_t '$TARGET_PATH' También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para que se preserven incluso después de un reetiquetado completo. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
gu: તમે chcon -R -t rsync_data_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઈલોને પણ સંપૂર્ણ પુન:લેબલ પર તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર બદલવી જ પડશે. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
ja: chcon -R -t rsync_data_t '$TARGET_PATH' を実行すると、ファイルコンテキストを変更することが出来ます。 また、それらを完全な再ラベルの後でも保持できるようにシステム上でデフォルトのファイルコンテキストも変更しなければなりません。"semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
kn: chcon -R -t rsync_data_t '$TARGET_PATH' ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ ಕಡತದ ಸನ್ನಿವೇಶವನ್ನು ಬದಲಾಯಿಸಬಹುದು ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
or: ଆପଣ chcon -R -t rsync_data_t '$TARGET_PATH' କୁ ନିଷ୍ପାଦନ କରି ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ବଦଳାଇପାରିବେ ସେମାନଙ୍କୁ ସମ୍ପୂର୍ଣ୍ଣ ପୁନଃ ନାମକରଣରେ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ଆପଣ ମଧ୍ଯ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ଫାଇଲକୁ ତନ୍ତ୍ରରେ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
te: మీరు దస్త్రము సందర్భంను chcon -R -t rsync_data_t '$TARGET_PATH' నిర్వర్తించుట ద్వారా మార్చవచ్చు.మీరు అప్రమేయ దస్త్ర సందర్భ దస్త్రములను సిస్టమ్ పైన వాటిని పూర్తి చేరికగా వుంచుటకు తప్పక మార్చాలి. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
uk: Файловий контекст можна змінити командою «chcon -R -t rsync_data_t '$TARGET_PATH'» Також терба змінити типові контексти файлів у системі, щоб вони збереглись при повторній розмітці. «semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'»
zh_tw: 您可透過執行 chcon -R -t rsync_data_t '$TARGET_PATH' 來修改檔案情境 您也必須更改系統上的預設檔案情境檔，才能在完整標記的情況下將它們保留住。「semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'」

source: $TARGET_BASE_PATH should be shared via the rsync daemon
as: $TARGET_BASE_PATH rsync ডিমনৰে অংশীদাৰী কৰিব লাগিব
es: $TARGET_BASE_PATH debería ser compartido mediante el demonio rsync
gu: $TARGET_BASE_PATH એ rsync ડિમન મારફતે વહેંચાયેલ હોવી જોઇએ
ja: $TARGET_BASE_PATH は rsync デーモンによって共有されるべきです
kn: $TARGET_BASE_PATH ಅನ್ನು rsync ಡೀಮನ್ ಮೂಲಕ ಹಂಚಬೇಕಾಗುತ್ತದೆ
or: $TARGET_BASE_PATH କୁ rsync ଡେମନ ମାଧ୍ଯମରେ ସହଭାଗ କରିବା ଉଚିତ
te: $TARGET_BASE_PATH అనునది తప్పక rsync డెమోన్ ద్వారా భాగస్వామ్యపరచబడాలి
uk: $TARGET_BASE_PATH має бути оприлюднено за допомогою фонової служби rsync
zh_tw: $TARGET_BASE_PATH 應該透過 rsync 幕後程式分享

source: You need to change the label on $TARGET_BASE_PATH
as: আপুনি $TARGET_BASE_PATH ৰ লেবেল সলনি কৰিব লাগিব
es: Necesita modificar la etiqueta en $TARGET_BASE_PATH
gu: તમારે $TARGET_BASE_PATH પર લેબલને બદલવાની જરૂર છે
ja: $TARGET_BASE_PATH のラベルを変更する必要があります。
kn: $TARGET_BASE_PATH ನಲ್ಲಿ ನೀವು ಲೇಬಲ್ ಅನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ
or: ଆପଣଙ୍କୁ $TARGET_BASE_PATH ଉପରେ ନାମପଟିକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ହେବ
te: మీరు $TARGET_BASE_PATH పైని లేబుల్‌ను మార్చాలి
uk: Вам слід змінити мітку на $TARGET_BASE_PATH
zh_tw: 您需要變更 $TARGET_BASE_PATH 上的標籤

source: SELinux is preventing Samba ($SOURCE_PATH) "$ACCESS" access to $TARGET_PATH.
as: SELinux এ $TARGET_PATH লে Samba ($SOURCE_PATH) "$ACCESS" অভিগম প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a Samba ($SOURCE_PATH) el acceso "$ACCESS" a $TARGET_PATH.
gu: SELinux એ Samba($SOURCE_PATH) "$ACCESS" વપરાશને $TARGET_PATH થી અટકાવી રહ્યું છે.
ja: SELinux は $TARGET_PATH への Samba ($SOURCE_PATH) による "$ACCESS" アクセスを阻止しています。
kn: Samba ($SOURCE_PATH) "$ACCESS" ವು $TARGET_PATH ಅನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆSELinux ತಡೆದಿದೆ.
or: SELinux Samba ($SOURCE_PATH) "$ACCESS" କୁ $TARGET_PATH ରେ ଅଭିଗମ୍ୟ ପାଇଁ ଅଟକାଉଛି।
te: SELinux అనునది సాంబా $SOURCE_PATH "$ACCESS" యాక్సెస్‌ను $TARGET_PATHకు నిరోధిస్తోంది.
uk: SELinux забороняє Samba ($SOURCE_PATH) отримувати доступ «$ACCESS» до $TARGET_PATH.
zh_tw: SELinux 防止 Samba（$SOURCE_PATH）「$ACCESS」存取 $TARGET_PATH。

source: SELinux denied samba access to $TARGET_PATH. If you want to share this directory with samba it has to have a file context label of samba_share_t. If you did not intend to use $TARGET_PATH as a samba repository it could indicate either a bug or it could signal a intrusion attempt. Please refer to 'man samba_selinux' for more information on setting up Samba and SELinux.
as: SELinux এ $TARGET_PATH লে samba অভিগম নাকচ কৰিলে। যদি আপুনি এই ডাইৰেকটৰিক samba ৰ সৈতে অংশীদাৰী কৰিব বিচাৰে ইয়াৰ samba_share_t নথিপত্ৰ পৰিপ্ৰেক্ষতিত লেবেল থাকিব লাগিব। যদি আপুনি $TARGET_PATH ক এটা samba ভঁৰাল হিচাপে ব্যৱহাৰ কৰা কথা ভবা নাই ই এটা বাগ অথবা এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত হব পাৰে। Samba আৰু SELinux সংস্থাপন কৰাৰ বিষয়ে অধিক তথ্যৰ বাবে 'man samba_selinux' চাওক।
es: SELinux ha negado a samba el acceso a $TARGET_PATH. Si quiere compartir este directorio con samba, debe tener el contexto de archivo etiquetado como samba_share_t. Si no pretende utilizar $TARGET_PATH como un repositorio samba, esto puede indicar o bien un error, o bien un intento de ataque. Por favor, vea 'man samba_selinux' para obtener mayor información sobre la configuración de Samba y de SELinux.
gu: SELinux એ $TARGET_PATH નો samba વપરાશ નામંજૂર કર્યો. જો તમે આ ડિરેક્ટરીને samba સાથે વહેંચવા માંગો તો તેને samba_share_t નું ફાઈલ સંદર્ભ લેબલ હોવું જોઈએ. જો તમે $TARGET_PATH ને samba રીપોઝીટરી તરીકે વાપરવાનો હેતુ રાખ્યો નહિં હોય તો તે ક્યાં તો ભૂલ સૂચવી શક્યું હોત અથવા તે ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત. મહેરબાની કરીને Samba અને SELinux સુયોજિત કરવા પર વધારે જાણકારી માટે 'man samba_selinux' નો સંદર્ભ લો.
ja: SELinux は samba が $TARGET_PATH へアクセスするのを拒否しました。 このディレクトリを samba で共有したい場合、samba_share_t の ファイルコンテキストラベルを持っている必要があります。$TARGET_PATH を samba レポジトリとして使用する意図で無かった場合、これはバグか、又は 侵入の試みの形跡を意味します。Samba と SELinux のセットアップに関する 詳細には 'man samba_selinux' を参照して下さい。
kn: $TARGET_PATH ಗೆ samba ಅನುಮತಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ನೀವು ಈ ಕಡತಕೋಶವನ್ನು samba ದೊಂದಿಗೆ ಹಂಚಲು ಬಯಸಿದಲ್ಲಿ ಅದರ ಕಡತ ಸನ್ನಿವೇಶ ಲೇಬಲ್ samba_share_t ಆಗಿರಬೇಕು. ನೀವು $TARGET_PATH ಅನ್ನು ಒಂದು samba ರೆಪೊಸಿಟರಿಯನ್ನು ಬಳಸಲು ಬಯಸದೆ ಹೋಗಿದ್ದಲ್ಲಿ ಇದು ಒಂದು ದೋಷ ಅಥವ ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲಾಗುತ್ತದೆ ದಯವಿಟ್ಟು Samba ಹಾಗು SELinux ಬಗೆಗಿನ ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗಾಗಿ "man samba_selinux" ಅನ್ನು ನೋಡಿ.
or: SELinux samba କୁ $TARGET_PATH ରେ ଅଭିଗମ୍ୟ କରିବାକୁ ବାରଣ କରିଥାଏ। ଯଦି ଏହା ଗୋଟିଏ samba ତେବେ ଏଥିରେ samba_share_t ର ଗୋଟିଏ ଫାଇଲ ପ୍ରସଙ୍ଗ ନାମପଟି ଥିବା ଉଚିତ। ଯଦି ଆପଣ $TARGET_PATH କୁ samba ଭାବରେ ବ୍ୟବହାର କରିବାକୁ ଚାହୁଁନାହାନ୍ତି, ତେବେ ଏହା ଏକ ତ୍ରୁଟି ଦର୍ଶାଇଥାଏ, ଏବଂ ଏହା ମଧ୍ଯ ଗୋଟିଏ ବିନାଅନୁମତିରେ ପ୍ରବେଶ ପାଇଁ ଚେଷ୍ଟାକରିପାରେ। ଦୟାକରି Samba ଏବଂ SELinux କୁ ସେଟ କରିବା ବିଷୟରେ ଅଧିକ ସୂଚନା ପାଇବା ପାଇଁ 'man samba_selinux' କୁ ଅନୁସରଣ କରନ୍ତୁ।
te: SELinux అనునది samba వాడుకను $TARGET_PATH కు తిరస్కరిస్తుంది. మీరు ఈ సంచయంను samba తో పంచుకోవాలంటే ఇది దస్త్రము సందర్బ లేబుల్ samba_share_t కలిగివుండాలి. మీరు $TARGET_PATH ను samba రిపోజిటరిగా వాడకోవాలనుకోకపోతే ఇది బగ్‌నుగాని లేదా అమర్యాద యత్నమును సూచిస్తుంది. Samba మరియు SELinux అమర్పుపై మరింత సమాచారము కొరకు దయచేసి 'man samba_selinux' చూడుము.
uk: SELinux заборонила доступ samba до $TARGET_PATH. Якщо ви бажаєте використовувати цей каталог разом з samba, він повинен мати контекст samba_share_t. Якщо ви не збирались використовувати $TARGET_PATH як репозиторій samba. Це може свідчити про помилку або про спробу вторгнення. Докладну інформацію про параметри Samba та SELinux можна знайти на сторінці довідки «man samba_selinux».
zh_tw: SELinux 拒絕 samba 存取 $TARGET_PATH。 若您希望與 samba 共享此目錄的話，它必須要有個 samba_share_t 的 檔案情境標籤。若您並未嘗試使用 $TARGET_PATH 來作為 samba 軟體庫的話， 這顯示可能發生錯誤，或是系統可能已遭到入侵的警訊。 欲取得更多有關於設定 Samba 和 SELinux 上的相關資訊，請參閱「man samba_selinux」。
