Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: Your system may be seriously compromised! $SOURCE_PATH tried to load a kernel module.
as: আপোনাৰ চিস্টেমত গুৰতৰভাৱে সাল সলনি হব পাৰে! $SOURCE_PATH এ এটা কাৰনেল মডিউল ল'ড কৰাৰ চেষ্টা কৰিছিল।
es: ¡Su sistema puede estar seriamente comprometido! $SOURCE_PATH intentó cargar un módulo del kernel.
gu: તમારી સિસ્ટમ ગંભીરતા થી સમાધાન કરી શકે છે! $SOURCE_PATH એ કર્નલ મોડ્યુલ ને લાવવા માટે પ્રયત્ન કર્યો હતો.
ja: ご使用のシステムには深刻な侵害の可能性があります! $SOURCE_PATH がカーネルモジュールをロードしようとしました。
kn: ನಿಮ್ಮ ಗಣಕವು ಗಂಭೀರವಾಗಿ ರಾಜಿ ಮಾಡಿಕೊಂಡಿರಬಹುದು! $SOURCE_PATH ಒಂದು ಕರ್ನಲ್ ಘಟಕವನ್ನು ಲೋಡ್ ಮಾಡಲು ಪ್ರಯತ್ನಿಸಿದೆ.
or: ଆପଣଙ୍କର ତନ୍ତ୍ର ଗଭୀରତାର ସହିତ କ୍ଷତିଗ୍ରସ୍ତ ହୋଇପାରେ! $SOURCE_PATH ଗୋଟିଏ କର୍ଣ୍ଣଲ ଏକକାଂଶଧାରଣ କରିବାକୁ ଚେଷ୍ଟାକରିପାରେ।
te: మీ సిస్టమ్ తీవ్రంగా రాజీ పడవచ్చు! $SOURCE_PATH కెర్నల్ మాడ్యూల్‌ను లోడు చేయుటకు ప్రయత్నిస్తోంది.
uk: Ваша система може бути серйозно скомпрометована! $SOURCE_PATH намагається завантажити модуль ядра.
zh_tw: 您的系統可能已嚴重遭到入侵！$SOURCE_PATH 已嘗試載入內核模組。

source: SELinux has prevented $SOURCE from loading a kernel module. All confined programs that need to load kernel modules should have already had policy written for them. If a compromised application tries to modify the kernel this AVC will be generated. This is a serious issue. Your system may very well be compromised.
as: SELinux এ $SOURCE ক এটা কাৰনেল মডিউল ল'ড কৰাৰ পৰা প্ৰতিৰোধ কৰিছে। সকলো গোপন প্ৰগ্ৰাম যিসমূহৰ কাৰনেল মডিউলসমূহ ল'ড কৰা প্ৰয়োজন সিহতৰ বাবে নীতি লিখা থাকিব লাগিব। যদি এটা ভুল অনুপ্ৰয়োগে কাৰনেল সলনি কৰাৰ চেষ্টা কৰে এই AVC সৃজন কৰা হব। ই এটা গুৰতৰ সমস্যা। আপোনাৰ চিস্টেমত ভাল সাল সলনি হব পাৰে।
es: SELinux le ha negado a $SOURCE acceso para cargar un módulo del kernel. Todos los programas confinados que necesiten cargar módulos del kernel deberían tener políticas definidas que les permitan hacerlo. Si una aplicación vulnerada intenta modificar el kernel, este AVC será generado. Este es un problema serio. Su equipo puede estar comprometido.
gu: SELinux એ કર્નલ મોડ્યુલને લોડ કરી રહ્યા હોય ત્યારે $SOURCE અટકાવેલ છે. બધા મર્યાદામાં રાખેલ કાર્યક્રમો કે જે તેઓ માટે પહેલેથી જ પોલિસી લખાયેલ હોવી જોઇએ તે કર્નલ મોડ્યુલ ને લોડ કરવાની જરૂર છે જો સમજૂતી થયેલ કાર્યક્રમ આ AVC ઉત્પન્ન થયેલ હશે તે કર્નલને બદલવા માટે પ્રયત્ન કરે છે. આ ગંભીર સમસ્યા છે તમારી સિસ્ટમ સારી રીતે સમાધાન થયેલ છે.
ja: SELinux は $SOURCE による カーネルモジュールのロードを阻止しました。 カーネルモジュールをロードする必要のある全ての特定のプログラムは既に それら自身用の ポリシーを書かせておくべきでした。侵害されたアプリケーションが カーネルを修正する試みをすると、この AVC が生成されるでしょう。これは 重大な 問題です。ご使用のシステムは侵害されている可能性が高くなります。
kn: ಒಂದು ಕರ್ನಲ್ ಘಟಕವನ್ನು ಲೋಡ್ ಮಾಡದಂತೆ $SOURCE ಅನ್ನು SELinux ತಡೆದಿದೆ. ಕರ್ನಲ್ ಘಟಕಗಳನ್ನು ಲೋಡ್ ಮಾಡಬೇಕಿರುವ ಮಿತಿಗೊಳಪಡಿಸಲಾದ ಎಲ್ಲಾ ಪ್ರೊಗ್ರಾಮ್‌ಗಳಲ್ಲೂ ಪಾಲಿಸಿಯನ್ನು ಬರೆದಿರಬೇಕು. ರಾಜಿ ಮಾಡಿಕೊಳ್ಳಲಾದ ಯಾವುದೆ ಅನ್ವಯವು ಕರ್ನಲ್ ಅನ್ನು ಮಾರ್ಪಡಿಸಲು ಪ್ರಯತ್ನಿಸಿದಲ್ಲಿ ಈ AVC ಯನ್ನು ತೋರಿಸಲಾಗುತ್ತದೆ ಇದು ಒಂದು ಗಂಭೀರವಾದ ಸಮಸ್ಯೆಯಾಗದ್ದು. ನಿಮ್ಮ ಗಣಕವು ರಾಜಿ ಮಾಡಿಕೊಂಡಿರುವಂತೆ ತೋರುತ್ತಿದೆ.
or: SELinux $SOURCE କୁ କର୍ଣ୍ଣଲ ଏକକାଂଶ ଧାରଣ କରିବାରୁ ବାରଣ କରିଛି। ସମସ୍ତ ସୂମୀତ ପ୍ରଗ୍ରାମଗୁଡ଼ିକ ଯାହାକି କର୍ଣ୍ଣଲ ଏକକାଂଶଗୁଡ଼ିକୁ ଧାରଣ କରିବା ଆବଶ୍ୟକ ମନେକରନ୍ତି ସେଥିରେ ପୂର୍ବରୁ ନିତୀ ଲିଖିତ ଅଛି। ଯଦି ଗୋଟିଏ ହାରମାନିଥିବା ପ୍ରୟୋଗ କର୍ଣ୍ଣଲକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ଚେଷ୍ଟାକରିଥାଏ ତେବେ ଏହି AVC ସୃଷ୍ଟି ହେବ। ଏହା ଏକ ଗୁରୁତର ସମସ୍ୟା ଅଟେ। ଆପଣଙ୍କ ତନ୍ତ୍ର ହୁଏତଃ ହାରମାନିପାରେ।
te: SELinux అనునది $SOURCEను కెర్నల్ మాడ్యూల్ లోడవ్వుటనుండి నిరోదిస్తుంది. కెర్నల్ మాడ్యూళ్ళను లోడుచేయవలసిన అన్ని నిరోధిత ప్రోగ్రాములు వాటి కొరకు వ్రాయబడివున్న పాలసీను కలిగివుండాలి. రాజీపడిన అనువర్తనము కెర్నల్‌ను సవరించుటకు ప్రయత్నిస్తే ఈ AVC వుద్భవింపచేయబడుతుంది. ఇది వొక తీవ్రమైన సమస్య. మీ సిస్టమ్ చాలా బాగా రాజీ పడవచ్చు.
uk: SELinux забороняє $SOURCE завантажувати модуль ядра. Для всіх програм, яким потрібен такий рівень доступу, мають існувати окремі правила. Якщо скомпрометована програма намагається змінити модуль, буде згенеровано AVC. Це суттєва проблема та може бути ознакою того, що система була скомпрометована.
zh_tw: SELinux 已防止 $SOURCE 載入內核模組。 所有需要載內核模組、受限制的程式都應要有個為它們而編寫 的方針。若有個遭到入侵的應用程式 嘗試修改內核的話，此 AVC 便會產生。這是一項嚴重的 問題。您的系統可能已遭到入侵。

source: you do not believe that $SOURCE_PATH should be attempting to modify the kernel by loading a kernel module.
as: আপুনি নাভাৱে যে $SOURCE_PATH এ কাৰনেল মডিউল ল'ড কৰি কাৰনেল সলনি কৰাৰ চেষ্টা কৰি আছে।
es: no cree que $SOURCE_PATH deba intentar modificar el kernel cargando un módulo.
gu: તમે માનતા નથી કે $SOURCE_PATH એ કર્નલ મોડ્યુલને લોડ કરવા દ્દારા કર્નલને બદલવાનો પ્રયત્ન કરવો જોઇએ.
ja: $SOURCE_PATH は kernel module をロードし、kernel を編集しようとすべきではありません。
kn: ನಿಮ್ಮ $SOURCE_PATH ಎನ್ನುವುದು ಕರ್ನಲ್‌ ಘಟಕವನ್ನು ಲೋಡ್ ಮಾಡುವ ಮೂಲಕ ಕರ್ನಲ್ ಅನ್ನು ಮಾರ್ಪಡಿಸಲು ಪ್ರಯತ್ನಿಸುತ್ತಿದೆ ಎಂದು ನಿಮಗನ್ನಿಸುವುದಿಲ್ಲ.
or: ଆପଣ ନିଜର $SOURCE_PATH କର୍ଣ୍ଣଲକୁ ପରିବର୍ତ୍ତନ କରୁଥିବ ବୋଲି ଆପଣ ବିଶ୍ୱାସ କରନ୍ତି ନାହିଁ, କର୍ଣ୍ଣଲ ଏକକାଂଶଗୁଡ଼ିକୁ ଧାରଣ କରିବା ଦ୍ୱାରା।
te: $SOURCE_PATH అనునది కెర్నల్ మాడ్యూల్‌ను లోడ్ చేయుట ద్వారా కెర్నల్‌ను సవరించుటకు యత్నించాలని మీరు నమ్మజాలరు.
uk: ви вважаєте, що $SOURCE_PATH не має намагатися змінити ядро завантаженням модуля ядра.
zh_tw: 您不認為 $SOURCE_PATH 應嘗試藉由載入 kernel 模組，修改 kernel。

source: A process might be attempting to hack into your system.
as: এটা প্ৰক্ৰিয়ায় হয়তো আপোনাৰ চিস্টেম হেক কৰাৰ চেষ্টা কৰি আছে।
es: Un proceso podría estar intentando atacar su sistema.
gu: પ્રક્રિયા તમારી સિસ્ટમમાં હેક કરવાનો પ્રયત્ન કરી શકે છે.
ja: あるプロセスがあなたのシステムへハッキングしようとしているかもしれません。
kn: ಒಂದು ಪ್ರಕ್ರಿಯೆಯು ನಿಮ್ಮ ವ್ಯವಸ್ಥೆಯನ್ನು ಹ್ಯಾಕ್ ಮಾಡಲು ಪ್ರಯತ್ನಿಸುತ್ತಿರಬಹುದು.
or: ଗୋଟିଏ ପ୍ରକ୍ରିୟା ହୁଏତଃ ଆପଣଙ୍କ ତନ୍ତ୍ରରେ ବିନାଅନୁମତିରେ ପ୍ରବେଶ କରିବା ପାଇଁ ଚେଷ୍ଟାକରୁଅଛି।
te: మీ సిస్టమ్‌ను హాక్ చేయుటకు వొక క్రమణం ప్రయత్నించి వుండవచ్చును.
uk: Ймовірно, процес намагається здійснити злам вашої системи.
zh_tw: 有程序可能試圖駭進您的系統。

source: SELinux is preventing $SOURCE_PATH the "sys_resource" capability.
as: SELinux এ $SOURCE_PATH ক "sys_resource" ক্ষমতা প্ৰতিৰোধ কৰি আছে।
es: SELinux está previniendo $SOURCE_PATH la capacidad de "sys_resource" .
gu: SELinux એ $SOURCE_PATH ની "sys_resource" ક્ષમતાને અટકાવી રહ્યું છે.
ja: SELinux は $SOURCE_PATH の "sys_resource" 能力を阻止しています。
kn: "sys_resource" ಸವಲತ್ತು ಅನ್ನು ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ $SOURCE_PATH ಅನ್ನು SELinux ತಡೆದಿದೆ
or: SELinux $SOURCE_PATH "sys_resource" କ୍ଷମତାକୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH "sys_resource" సామర్ద్యమును నిరోధించుచున్నది.
uk: SELinux забороняє $SOURCE_PATH використовувати можливість «sys_resource».
zh_tw: SELinux 防止 $SOURCE_PATH「sys_resource」功能。

source: Confined domains should not require "sys_resource". This usually means that your system is running out of disk space. Please clear up the disk and this AVC message should go away. If this AVC continues after you clear up the disk space, please report this as a bug.
as: গোপন ডমেইনসমূহৰ "sys_resource" প্ৰয়োজন হব নালাগে। ই সাধাৰণত বুজায় যে আপোনাৰ চিস্টেমত ডিস্ক স্থান কম হৈ আছে। অনুগ্ৰহ কৰি ডিস্ক পৰিষ্কাৰ কৰক আৰু এই AVC বাৰ্তা আতৰি যাব লাগে। যদি এই AVC আপুনি ডিস্ক স্থান পৰিস্খাৰ কৰাৰ পিছত চলি থাকে, অনুগ্ৰহ কৰি ইয়াক বাগ হিচাপে সংবাদিত কৰক।
es: "sys_resource" no debería requerir un dominio confinado. Esto suele significar que su sistema esta corriendo sin espacio disponible en disco. Por favor limpie el disco y este mensaje AVC debería desaparecer. Si el AVC continua luego de limpiar espacio en el disco, por favor reporte este error.
gu: શુદ્ધિત થયેલ ડોમેઈનને "sys_resource" ની જરૂર રહેતી નથી. આનો સામાન્ય રીતે એવો અર્થ થાય કે તમારી સિસ્ટમની ડિસ્ક જગ્યા ખૂટી ગઈ છે. મહેરબાની કરીને ડિસ્ક સાફ કરો અને આ AVC સંદેશો જતો રહેશે. જો આ AVC ચાલુ રહે તો પછી તમારે ડિસ્ક જગ્યા ખાલી કરવી પડશે, મહેરબાની કરીને આને ભૂલના અહેવાલ તરીકે જમા કરો.
ja: 特定のドメインは "sys_resource" を要求することはありません。これは通常、 使用システムのディスク領域が不足していることを意味します。ディスク領域を 空けると、 AVC メッセージは消えるはずです。ディスクを空けた後でもこの AVC が継続するならば、 これをバグとして報告して下さい。
kn: ಮಿತಿಗೊಳಪಟ್ಟ ಡೊಮೈನ್‌ಗಳಿಗೆ "sys_resource" ನ ಅಗತ್ಯವಿರುವುದಿಲ್ಲ. ಇದರ ನಿಜವಾದ ಅರ್ಥವೆಂದರೆ ನಿಮ್ಮ ಡಿಸ್ಕಿನ ಜಾಗ ಸಾಲುತ್ತಿಲ್ಲ ಎಂದಾಗಿರುತ್ತದೆ. ಡಿಸ್ಕಿನಲ್ಲಿ ಒಂದಿಷ್ಟು ಜಾಗವನ್ನು ಖಾಲಿ ಮಾಡಿ ಹಾಗು ನಂತರ ಈ AVC ಸಂದೇಶವು ಹೊರಟು ಹೋಗುತ್ತದೆ. ಡಿಸ್ಕಿನಲ್ಲಿ ಜಾಗ ಖಾಲಿ ಮಾಡಿದ ಮೇಲೂ ಈ AVC ಮುಂದುವರೆದಲ್ಲಿ, ದಯವಿಟ್ಟು ಒಂದು ದೋಷ ವರದಿಯನ್ನು ಸಲ್ಲಿಸಿ.
or: ନିଶ୍ଚିତ ଡମେନଗୁଡ଼ିକ "sys_resource" କୁ ଅଧିକାର କରିବା ଆବଶ୍ୟକ ନୁହଁ। ଏହା ସାଧାରଣତଃ ବୁଝାଏ ଯେ ଆପଣଙ୍କର ତନ୍ତ୍ରରେ ଡିସ୍କ ସ୍ଥାନ ସରି ଆସୁଛୁ। ଦୟାକରି ଡିସ୍କକୁ ସଫାକରନ୍ତୁଏବଂ ଏହି AVC ସନ୍ଦେଶ ପଳାଇଯାଇପାରେ। ଆପଣ ଡିସ୍କ ସ୍ଥାନ ସଫାକରି ସାରିବା ପରେ ଯଦି ଏହି AVC ଅଗ୍ରସର ହୁଏ, ତେବେ ଦୟାକରି ଏହାକୁ ଏକ ତ୍ରୁଟି ଭାବରେ ଖବର କରନ୍ତୁ।
te: నిర్భందించబడిన డొమైన్లకు "sys_resource" అవసరములేదు. సాధారణంగా దీనర్ధం మీ సిస్టమ్ నందు డిస్కు జాగా అయిపోతోందని. దయచేసి డిస్కును ఖాళీ చేయండి ఈ AVC సందేశము పోతుంది. మీరు డిస్కు జాగాను ఖాళీ చేసిన తర్వాత కూడా ఈ AVC కొనసాగితే, దయచేసి దీనిని బగ్‌లా నివేదించండి.
uk: Для доменів з обмеженнями не потрібний «sys_resource». Поява цього повідомлення, зазвичай, означає, що у системі залишилося мало місця на дисках. Будь ласка, вилучіть зайві компоненти, щоб позбутися цього повідомлення AVC. Якщо повідомлення з’являтиметься і після вивільнення місця на диску, будь ласка, повідомте про цю ваду розробникам.
zh_tw: 受限制的區域不應需要「sys_resource」。這通常代表您的系統磁碟空間不足。請清理您的磁碟， 在這之後，AVC 訊息便應該會消失。若此 AVC 在您騰出磁碟空間後依然繼續進行的話，請將此情況視為錯誤來回報。

source: you do not want to get this AVC any longer. These AVC's are caused by running out of resources, usually disk space on your / partition.
as: আপুনি আৰু এই AVC প্ৰাপ্ত কৰিব নিবিচাৰে। এই AVC সমূহক সম্পদৰ অভাৱত সৃষ্টি কৰা হয়, আপোনাৰ / বিভাজনত ডিস্ক স্থান ব্যৱহাৰ কৰি।
es: no desea obtener este AVC otra vez. Estos AVC's son ocasionados por recursos escasos del equipo, generalmente espacio en disco o en su prtición /.
gu: તમે આ AVC ને લાંબા સમય સુધી ઇચ્છતા નથી. આ AVC સ્ત્રોતોનું ચાલ્યા જવાનું કારણ થયેલ છે, સામાન્ય રીતે તમારા / પાર્ટીશન પર ડિસ્ક જગ્યા.
ja: この AVC を以降無効にしたい。これらのAVCはリソースの不足、通常はパーティション上のディスクスペースの不足によって起こります。
kn: ನೀವು ಈ AVC ಅನ್ನು ಇನ್ನು ಮುಂದೆ ಪಡೆಯಲು ಬಯಸುವುದಿಲ್ಲ. ಈ AVC ಗಳಿಗೆ ಕಾರಣ ಸಂಪನ್ಮೂಲಗಳ ಕೊರತೆಯಾಗಿರುತ್ತದೆ, ಸಾಮಾನ್ಯವಾಗಿ / ವಿಭಾಗದಲ್ಲಿ ಡಿಸ್ಕ್‍ ಜಾಗ ಇಲ್ಲದಿರುವಿಕೆಯಾಗಿರುತ್ತದೆ.
or: ଆପଣ ଏପର୍ଯ୍ୟନ୍ତ ଏହି AVC କୁ ପାଇବାକୁ ଚାହୁଁନାହାନ୍ତି। ଏହି AVC ଗୁଡ଼ିକ ଉତ୍ସର ଅଭାବ ହେତୁ ଘଟିଥାଏ, ସାଧାରଣତଃ ଆପଣଙ୍କ / ବିଭାଜନରେ ଥିବା ଡିସ୍କ ସ୍ଥାନ।
te: మీరు యికపై యీ AVC ను పొందగోరరు. వనరులు లేక పోవుటవలన యీ AVCలు వస్తాయి, సాధారణంగా మీ / విభజననందలి డిస్కు జాగా మూలంగా.
uk: ви не бажаєте більше отримувати це повідомлення AVC. Подібні повідомлення AVC спричинено нестачею ресурсів у системі, зазвичай місця на вашому кореневому розділі.
zh_tw: 您不希望再看見此 AVC。這些 AVC 乃因為資源不足所造成，一般為您 / 分割區上的磁碟空間。

source: you must cleanup diskspace or make sure you are not running too many processes.
as: আপুনি ডিস্কস্থান পৰিষ্কাৰ কৰিব লাগিব অথবা সুনিশ্চিত কৰিব যে আপুনি কেইবাটাও প্ৰক্ৰিয়া চলাই থকা নাই।
es: debe liberar espacio en disco o asegurarse que no esté ejecutando demasiados procesos.
gu: તમારે બેકસ્પેસને નીકાળી દેવી જ જોઇએ અથવા ખાતરી કરો કે તમે ઘણી બધી પ્રક્રિયાઓને ચલાવી રહ્યા નથી.
ja: ディスクスペースを確保するか、過剰なプロセスを動作させていないか確認しなければいけません。
kn: ನೀವು ಡಿಸ್ಕಿನಲ್ಲಿ ಒಂದಿಷ್ಟು ಜಾಗವನ್ನು ಖಾಲಿ ಮಾಡಬೇಕು ಅಥವ ಹಲವಾರು ಪ್ರಕ್ರಿಯೆಗಳು ಚಲಾವಣೆಗೊಳ್ಳುತ್ತಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಕೊಳ್ಳಬೇಕು.
or: ଆପଣ ନିଶ୍ଚିତ ଭାବରେ ଡିସ୍କ ସ୍ଥାନକୁ ସଫାକରିବା ଉଚିତ କିମ୍ବା ନିଶ୍ଚିତ କରନ୍ତୁ ଯେ ଆପଣ ଅତ୍ୟଧିକ ପ୍ରକ୍ରିୟା ଚଲାଉନାହାନ୍ତି।
te: మీరు తప్పక డిస్కుజాగాను ఖాళీ చేయాలి లేదా మీరు మరిన్ని క్రమణాలను నడుపకుండా వుండునట్లు చూచుకోవాలి.
uk: вам слід звільнити місце на диску або не запускати занадто багато процесів.
zh_tw: 您必須清出您的磁碟空間，或確認您未執行過多程序。

source: SELinux has prevented vbetool from performing an unsafe memory operation.
as: SELinux এ vbetool ক এটা অসুৰক্ষিত মেমৰি কাৰ্য্য পৰিৱেশন কৰাৰ পৰা প্ৰতিৰোধ কৰিছে।
es: SELinux negó a vbetool hacer una operación insegura con la memoria.
gu: SELinux એ vbetool ને અસલામત મેમરી ક્રિયા ને્ય રીતે ચલાવવાથી બચાવેલ છે.
ja: SELinux は vbetool による安全でないメモリー操作を阻止 しました
kn: vbetool ಒಂದು ಅಸುರಕ್ಷಿತ ಮೆಮೊರಿ ಕಾರ್ಯವನ್ನು ನಿರ್ವಹಿಸುವುದನ್ನು SELinux ತಡೆಯುತ್ತಿದೆ.
or: SELinux କୁ ସଠିକ ଭାବରେ ଗୋଟିଏ ଡେମନ ପରି ଚାଲିବାରୁ ଅଟକାଇଛି।
te: SELinux అనునది vbetoolను సురక్షితం కాని మెమొరీ ఆపరేషన్‌ను నిర్వర్తించుటనుండి నిరోధిస్తుంది.
uk: SELinux запобіг виконанню програмою vbetool небезпечної операції з пам'яттю.
zh_tw: SELinux 已防止 vbetool 進行一項不安全的記憶體作業。

source: SELinux denied an operation requested by $SOURCE, a program used to alter video hardware state. This program is known to use an unsafe operation on system memory but so are a number of malware/exploit programs which masquerade as vbetool. This tool is used to reset video state when a machine resumes from a suspend. If your machine is not resuming properly your only choice is to allow this operation and reduce your system security against such malware.
as: SELinux এ $SOURCE দ্বাৰা অনুৰোধ কৰা এটা কাৰ্য্য নাকচ কৰিছে, ভিডিঅ' হাৰ্ডৱেৰ অৱস্থা সলনি কৰিবলে ব্যৱহৃত এটা প্ৰগ্ৰাম। এই প্ৰগ্ৰাম চিস্টেম মেমৰিত এটা অসুৰক্ষিত কাৰ্য্য কৰাৰ বাবে জনাজাত কিন্তু লগতে কেইবাটাও দ্বেষপূৰ্ণ/লুন্ঠণ প্ৰগ্ৰামসমূহ আছে যি vbetool হিচাপে কাৰ্য্য কৰে। এই সঁজুলিক ভিডিঅ' অৱস্থা পুনৰসংহতি কৰিবলে ব্যৱহাৰ কৰা হয় যেতিয়া এটা মেচিন এটা স্থগিত অৱস্থাৰ পৰা পুনৰ আৰম্ভ হয়।I যদি আপোনাৰ মেচিন সঠিকভাৱে পুনৰ চলি থকা নাই আপোনাৰ একমাত্ৰ বিকল্প হল এই কাৰ্য্যৰ অনুমতি দিয়া আৰু এনে ধৰণৰ দ্বেষপূৰ্ণ প্ৰগ্ৰামৰ বিপৰিতে আপোনাৰ চিস্টেম সুৰক্ষা ত্ৰাস কৰা।
es: SELinux negó una operación pedida por $SOURCE, un programa usado para alterar el estado del hardware de video. Este programa es conocido por usar una operación insegura en la memoria del sistema por lo que hay un número de programas malware/exploit que se enmascaran como vbetool. Esta herramienta se usa para resetear el estado del video cuando una máquina reasume desde una suspensión. Si su máquina no está reasumiendo apropiadamente, su única opción es permitir esta operación y reducir la seguridad de su sistema contra tales malware.
gu: SELinux એ $SOURCE દ્દારા સૂચવેલ ક્રિયાને નામંજૂર કરે છે, વિડિયો હાર્ડવેર સ્થિતિને બદલવા માટે પ્રક્રિયાને વાપરેલ છે. આ ક્રિયા સિસ્ટમ મેમરી પર અસલામત ક્રિયાને વાપરવા માટે જાણીતુ છે પરંતુ તેથી malware/exploit પ્રક્રિયાઓની સંખ્યા છે કે જે vbetool તરીકે masquerade છે. આ સાધન વિડિયો સ્થિતિને પુન:સુયોજિત કરવા માટે વાપરેલ છે જ્યારે મશીનને નિલંબીત માંથી પાછુ લાવે છે ત્યારે. જો તમારાં મશીનને યોગ્ય રીતે પાછુ ન આવે તો તમને આ ક્રિયાને પરવાનગી આપવા માટેની ફક્ત પસંદગી છે અને આવાં માલવેર વિરુદ્દ તમારી સિસ્ટમની સુરક્ષાને ઘટાડે છે.
ja: SELinux は ビデオハードウェアの状態を変更するためのプログラムである $SOURCE によって 要求された操作を拒否しました。vbetool として仮装する他の多くの 違法/悪意プログラムと同様に、このプログラムはシステムメモリー上で 安全でない操作をすることで知られています。このツールはマシンがサスペンドから 復帰する時に ビデオの状態をリセットするために使用されます。使用中のマシンが正常に復帰しない場合は、 この操作を許可するのが唯一の選択肢となり、悪意プログラムに対するシステムのセキュリティを低下します。
kn: ವೀಡಿಯೊ ಯಂತ್ರಾಂಶವನ್ನು ಮಾರ್ಪಡಿಸುವಂತಹ ಒಂದು ಪ್ರೊಗ್ರಾಮ್ ಆದ $SOURCE ಇಂದ ಮನವಿ ಸಲ್ಲಿಸಲಾದ ಒಂದು ಕಾರ್ಯವನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ವ್ಯವಸ್ಥೆಯ ಮೆಮೊರಿಯಲ್ಲಿ ಈ ಪ್ರೊಗ್ರಾಮ್ ಅಸುರಕ್ಷಿತವಾದ ಕಾರ್ಯಾಚರಣೆಯನ್ನು ನಡೆಸುವುದು ಗೊತ್ತಿರುವ ವಿಷಯ ಅಲ್ಲದೆ ಹಲವಾರು ಮ್ಯಾಲ್‌ವೇರ್/ಮೋಸ ಮಾಡುವ ಪ್ರೊಗ್ರಾಮ್‌ಗಳು vbetool ಎಂದು ಸೋಗು ಹಾಕುತ್ತವೆ. ಗಣಕವು ಸ್ಥಗಿತಗೊಂಡ ಸ್ಥಿತಿಯಿಂದ ಮರಳಿ ಕಾರ್ಯಾರಂಭ ಮಾಡಿದಾಗ ಈ ಉಪಕರಣವು ವೀಡಿಯೊ ಸ್ಥಿತಿಯನ್ನು ಮರಳಿ ಹೊಂದಿಸುತ್ತದೆ ನಿಮ್ಮ ಗಣಕವು ಸರಿಯಾಗಿ ಮರಳಿ ಕಾರ್ಯಾರಂಭ ಮಾಡದೆ ಇದ್ದಲ್ಲಿ ನಿಮಗೆ ಇರುವ ದಾರಿ ಎಂದರೆ ಈ ಕಾರ್ಯಕ್ಕೆ ಅನುಮತಿಯನ್ನು ನೀಡುವುದು ಹಾಗು ಆ ಮೂಲಕ ಅಂತಹ ಮ್ಯಾಲ್‌ವೇರಿನ ವಿರುದ್ಧ ನಿಮ್ಮ ಗಣಕದ ಸುರಕ್ಷತೆಯನ್ನು ಕಡಿಮೆ ಮಾಡುವುದು.
or: SELinux $SOURCE ଦ୍ୱାରା ଅନୁରୋଧ କରାଯାଇଥିବା ଗୋଟିଏ ପ୍ରୟୋଗକୁ ବାରଣ କରିଥାଏ, ଭିଡିଓ ହାର୍ଡୱେର ଅବସ୍ଥାକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଗୋଟିଏ ପ୍ରଗ୍ରାମ ବ୍ୟବାହର ହୋଇଥାଏ। ଏହି ପ୍ରଗ୍ରାମଟି ଗୋଟିଏ ଅସୁରକ୍ଷିତ ପ୍ରୟୋଗକୁ ତନ୍ତ୍ର ସ୍ମୃତି ସ୍ଥାନରେ ବ୍ୟବାହର କରୁଥିବା ପରି ଜଣାପଡ଼େ କିନ୍ତୁ ସେହିପରି କିଛି ସଂଖ୍ୟକ କ୍ଷତିକାରକ/ଠକ ପ୍ରଗ୍ରାମଗୁଡ଼ିକ ଯାହାକି vbetool ଭାବରେ ଅଭିନୟ କରିଥାଏ। ଏହି ସାଧନଟିଭିଡିଓ ଅବସ୍ଥାକୁ ପୁନଃସ୍ଥାପନ କରିଥାଏ ଯେତେବେଳେ ଗୋଟିଏ ଯନ୍ତ୍ର ନିଲମ୍ବନରୁ ଫେରିଥାଏ। ଯଦି ଆପଣଙ୍କର ଯନ୍ତ୍ରଟି ସଠିକ ଭାବରେ ପୁନଃଚାଳନ ନହୁଏ ତେବେ ଆପଣଙ୍କର କେବଳ ଗୋଟିଏ ମାତ୍ର ବିକଳ୍ପ ହେଉଛି ଏହି ପ୍ରୟୋଗକୁ ଅନୁମତି ଦେବା ଏବଂ ଆପଣଙ୍କର ତନ୍ତ୍ରର ସୁରକ୍ଷାକୁ ଏହି ପରି କ୍ଷତିରୁ କମ କରିବା।
te: SELinux అనునది $SOURCE ద్వారా అభ్యర్ధించ బడిన ఆపరేషన్‌ను తిరస్కరించినది, వీడియో హార్డువేర్ స్థితిని మార్చుటకు వొక ప్రోగ్రామ్ వుపయోగించబడింది. ఈ ప్రోగ్రామ్ సురక్షితంకాని ఆపరేషన్‌ను సిస్టమ్ మెమొరీ పైన వుపయోగిస్తుంది అందువలన చాలా చెడ్డ/ప్రమాదకరమైన ప్రోగ్రామ్స్ vbetool వలె భ్రమింపచేస్తాయి. ఈ సాధనము అనునది సిస్టమ్ సస్పెండ్‌నుండి తిరిగివుంచబడినప్పుడు వీడియో స్థితిని తిరిగివుంచుటకు వుపయోగించబడుతుంది. మీ మీషన్ సరిగా తిరిగి వుంచబడక పోతే మీకు వున్న వొకే మార్గం ఈ ఆపరేషన్‌ను అనుమతించి మీ సిస్టమ్ రక్షణను తగినట్లు తగ్గించడమే.
uk: SELinux забороняє дію, запитану $SOURCE, програмою зміни стану відео обладнання. Ця програма звичайно виконує небезпечні операції пам'яті, у то же час так діють зловмисні програми, замасковані під vbetool. Ця утиліта відновлює стан відео при поверненні системи з режиму очікування. Якщо комп'ютер не відновлює роботу, залишається лише дозволити цю дію, послабляючи захист.
zh_tw: SELinux 拒絕一項 $SOURCE 所請求的作業，這是個用來 修改顯示硬體狀態的程式。已得知這項程式會在系統記憶體上 進行一項不安全的作業，而有些惡意軟體/安全漏洞程式也會假冒成 vbetool。這項工具主要 被使用於機器由暫停狀態復原時，重設顯示硬體狀態的情況下。若您的機器 無法正常復原的話，您唯一的選擇就是允許這 項作業並降低您系統對於此種惡意軟體的安全性。

source: If you decide to continue to run the program in question you will need to allow this operation. This can be done on the command line by executing: # setsebool -P mmap_low_allowed 1
as: যদি আপুনি প্ৰগ্ৰামক প্ৰশ্নত চলাবলে নিৰ্ধাৰন কৰিছে আপোনাৰ এই কাৰ্য্যক অনুমতি দিয়াৰ প্ৰয়োজন হব ইয়াক কমান্ড শাৰীত কৰিব পৰা যাব এক্সিকিউট কৰি: # setsebool -P mmap_low_allowed 1
es: Si decide continuar ejecutando el programa en cuestión, necesitará permitir esta operación. Esto se puede hacer por la línea de comando ejecutando: # setsebool -P mmap_low_allowed 1
gu: જો તમે પ્રશ્ર્નમાં પ્રક્રિયાને ચલાવવા માટે ચાલુ રાખવાનું નક્કી કરો તો તમારે આ ક્રિયાને પરવાનગી આપવાની જરૂર પડશે. આને ચલાવવા વડે આદેશ વાક્ય પર પૂરું થઇ શકે છે: # setsebool -P mmap_low_allowed 1
ja: 問題になっているプログラムを継続して実行する決定をした場合は、この 操作を許可する必要があります。これは以下のようにコマンドラインで 実行できます: # setsebool -P mmap_low_allowed 1
kn: ಪ್ರಶ್ನೆಯಲ್ಲಿರುವ ಅನ್ವಯವನ್ನು ನೀವು ಚಲಾಯಿಸಲು ಬಯಸಿದಲ್ಲಿ ಈ ಕಾರ್ಯಕ್ಕೆ ನೀವು ಅನುಮತಿಯನ್ನು ನೀಡಬೇಕಾಗುತ್ತದೆ.ಇದನ್ನು ನೆರವೇರಿಸಲು ಆಜ್ಞಾ ಸಾಲಿನಲ್ಲಿ ಈ ಕೆಳಗಿನ ಆಜ್ಞೆಯನ್ನು ಚಲಾಯಿಸಿ: # setsebool -P mmap_low_allowed 1
or: ଯଦି ଆପଣ ସେହି ପ୍ରଗ୍ରାମକୁ ପ୍ରଶ୍ନ ସହିତ ଚାଲୁରଖିବାକୁ ସିଦ୍ଧାନ୍ତ କରିଛନ୍ତି, ତେବେ ଆପଣଙ୍କୁ ଏହି ପ୍ରୟୋଗକୁ ଅନୁମତି ଦେବାକୁ ହେବ। ଏହା ନିର୍ଦ୍ଦେଶ ନାମାରେ ନିଷ୍ପାଦନ କରି କାର୍ଯ୍ୟକାରୀ ହୋଇଥାଏ: # setsebool -P mmap_low_allowed 1
te: మీరు ప్రోగ్రామ్‌ను కొనసాగించుటకు నిర్ణయించుకొంటే మీరు ఈ ఆపరేషన్‌ను అనుమతించ వలసివుంటుంది. ఇది ఆదేశ వరుసనందు దీనిని నిర్వర్తించుట ద్వారా చేయవచ్చును: # setsebool -P mmap_low_allowed 1
uk: Якщо ви хочете продовжити виконання цієї програми, треба це дозволити. Для цього виконайте: # setsebool -P mmap_low_allowed 1
zh_tw: 若您決定繼續執行疑似有問題的程式，您將需要 先允許進行這項作業。您可透過在指令列上輸入 這項指令來完成這項動作： # setsebool -P mmap_low_allowed 1

source: you want to ignore this AVC because it is dangerous and your machine seems to be working correctly.
as: আপুনি এই AVC উপেক্ষা কৰিব বিচাৰে কাৰণ ই বিপদজনক আৰু আপোনাৰ মেচিন সঠিকভাৱে কাৰ্য্য কৰি আছে।
es: quiere ignorar este AVC ya que es peligroso y pareciera ser que su máquina está funcionando correctamente.
gu: તમે આ AVC ને અવગણવા માંગો છો કારણ કે તે ખતરનાક છે અને એવુ લાગે છે કે તમારુ મશીન યોગ્ય રીતે કામ કરી રહ્યુ છે.
ja: このAVCを無効にしたい。このAVCは警告だが、マシンは正常に動作しているため。
kn: ನೀವು ಈ AVC ಯನ್ನು ಕಡೆಗಣಿಸಲು ಬಯಸುತ್ತೀರಿ ಏಕೆಂದರೆ ಇದು ಅಪಾಯಕಾರಿಯಾಗಿದೆ ಹಾಗು ನಿಮ್ಮ ಗಣಕವು ಸರಿಯಾಗಿ ಕೆಲಸಮಾಡುತ್ತಿದೆ ಎಂದು ತೋರುತ್ತಿದೆ.
or: ଆପଣ ଏହି AVC କୁ ଅଗ୍ରାହ୍ୟ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି କାରଣ ଏହା ବିପଦ ଜନକ ଅଟେ ଏବଂ ଆପଣଙ୍କର ଯନ୍ତ୍ର ସଠିକ ଭାବରେ କାର୍ଯ୍ୟ କରୁଅଛି ପରି ଲାଗୁଛି।
te: ఇది ప్రమాదకరమైంది మరియు మీ మిషన్ సరిగా పనిచేస్తున్నట్లే వుంది కావున మీరు యీ AVC విస్మరించాలని అనుకొనుచున్నారు.
uk: ви бажаєте ігнорувати це повідомлення AVC, оскільки воно може бути небезпечним, ваша система працює у звичному режимі.
zh_tw: 您希望忽略此 AVC，因為其風險性高並且您的機器看似運作正常。

source: you must tell SELinux about this by enabling the vbetool_mmap_zero_ignore boolean.
as: আপুনি vbetool_mmap_zero_ignore বুলিয়ান সামৰ্থবান কৰি SELinux ক ইয়াৰ বিষয়ে কব লাগিব।
es: debe informarle esto a SELinux habilitando el booleano vbetool_mmap_zero_ignore.
gu: vbetool_mmap_zero_ignore બુલિયનને સક્રિય કરીને આ વિશે તમારે SELinux ને કહેવુ જ જોઇએ.
ja: これについては、SELinux に vbetool_mmap_zero_ignore boolean を有効にする設定をしなければいけません。
kn: vbetool_mmap_zero_ignore ಬೂಲಿಯನ್ ಅನ್ನು ಶಕ್ತಗೊಳಿಸುವ ಮೂಲಕ ನೀವು SELinux ಗೆ ಇದರ ಬಗ್ಗೆ ಹೇಳಬೇಕು.
or: vbetool_mmap_zero_ignore ବୁଲିଆନକୁ ସକ୍ରିୟ କରି ଆପଣ SELinux କୁ ଏହା ବିଷୟରେ କହିବା ଉଚିତ।
te: మీరు vbetool_mmap_zero_ignore బూలియన్‌ను చేతనము చేయుటచే SELinuxకు దీని గురించి తెలుపాలి.
uk: вам слід повідомити про це SELinux встановленням значення true для параметра vbetool_mmap_zero_ignore.
zh_tw: 您必須透過啟用 vbetool_mmap_zero_ignore 布林值，來告知 SELinux 有關於此。

source: Turn off memory protection
as: মেমৰি সুৰক্ষা বন্ধ কৰক
es: Apagar la protección de memoria
gu: મેમરી સુરક્ષાને બંધ કરો
ja: メモリーの保護をオフにします
kn: ಮೆಮೊರಿ ಸಂರಕ್ಷಣೆಯನ್ನು ಆಫ್ ಮಾಡು
or: ସ୍ମୃତି ସ୍ଥାନ ସୁରକ୍ଷାକୁ ଅଫ କରନ୍ତୁ
te: మెమొరీ రక్షణను ఆఫ్ చేయుము
uk: Вимкнути захист па'мяті
zh_tw: 關閉記憶體保護

source: SELinux has prevented wine from performing an unsafe memory operation.
as: SELinux এ wine ক এটা অসুৰক্ষিত মেমৰি কাৰ্য্য পৰিৱেশন কৰাৰ পৰা প্ৰতিৰোধ কৰিছে।
es: SELinux negó a wine hacer uso inseguro de la memoria.
gu: SELinux એ wine ને અલામત મેમરી ક્રિયા તરીકે યોગ્ય રીતે ચલાવવાથી બચાવેલ છે.
ja: SELinux は wine による安全でないメモリー操作の実行を阻止しました。
kn: $SOURCE ಸಂಪರ್ಕವಾದ ಒಂದು ಡೆಮನ್ ಆಗಿ ಚಲಾಯಿತಗೊಳ್ಳುವುದನ್ನು SELinux ತಡೆಯುತ್ತಿದೆ.
or: SELinux କୁ ସଠିକ ଭାବରେ ଗୋଟିଏ ଡେମନ ପରି ଚାଲିବାରୁ ଅଟକାଇଛି।
te: SELinux అనునది wineను సురక్షితం కాని మెమొరీ ఆపరేషన్‌ను నిర్వర్తించుటనుండి నిరోధిస్తుంది.
uk: SELinux запобіг виконанню програмою wine небезпечної операції з пам'яттю.
zh_tw: SELinux 已防止 wine 執行一項不安全的記憶體作業。
