Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: SELinux has denied the $SOURCE the ability to mmap low area of the kernel address space. The ability to mmap a low area of the address space, as configured by /proc/sys/kernel/mmap_min_addr. Preventing such mappings helps protect against exploiting null deref bugs in the kernel. All applications that need this access should have already had policy written for them. If a compromised application tries modify the kernel this AVC would be generated. This is a serious issue. Your system may very well be compromised.
as: SELinux এ $SOURCE ক কাৰনেল ঠিকনা স্থানৰ নিম্ন স্থান mmap কৰাৰ ক্ষমতা নাকচ কৰিছে। ঠিকনা স্থানৰ এটা নিম্ন স্থান mmap কৰাৰ ক্ষমতা, /proc/sys/kernel/mmap_min_addr সংৰূপণ কৰা ধৰণে। এই ধৰণৰ মেপিং প্ৰতিৰোধ কৰা কাৰনেলত খালি deref বাগসমূহ লুন্ঠণ কৰা পৰা সুৰক্ষা প্ৰদান কৰে। সকলো অনুপ্ৰয়োগ যাৰ এই অভিগমৰ প্ৰয়োজন সিহতৰ বাবে নীতি লিখা থাকিব লাগিব। যদি এটা ভুল অনুপ্ৰয়োগে কাৰনেল সলনি কৰাৰ চেষ্টা কৰে এই AVC সৃজন কৰা হব। ই এটা গুৰুতৰ বিষয়। আপোনাৰ চিস্টেমত ভাল সাল সলনি হব পাৰে।
es: SELinux le ha negado a $SOURCE la posibilidad de realizar mmap sobre un área inferior del espacio de la dirección del kernel. La posibilidad de realizar esta acción está configurada por /proc/sys/kernel/mmap_min_addr. Prevenir estas asignaciones ayuda a protegerse contra errores de tipo "exploiting null deref" en el kernel. Todas las aplicaciones que necesiten este acceso, deberían haber tenido alguna política definida para ellas. Si una aplicación vulnerada intenta modificar el kernel, este AVC será generado. Este es un problema serio. Su sistema puede estar comprometido.
gu: SELinux એ કર્નલ સરનામાં સ્થાનનાં mmap નીચા સ્તરની સક્ષમતા માટે $SOURCE ને નામંજૂર કરેલ છે. સરનામાં સ્થાનની mmap નીચા સ્તરની સક્ષમતા, /proc/sys/kernel/mmap_min_addr તરીકે રૂપરેખાંકિત થયેલ છે. આવા મેપીંગોને અટકાવાનુંકર્નલમાં નલ deref ભૂલોનો ઉપયોગ વિરુદ્દ બચાવવા માટે મદદ કરે છે. બધા કાર્યક્રમો કે જે આ પ્રવેશની જરૂર તેઓ માટે પહેલેથી જ લખાયેલ પોલિસી છે તે માટે હોવી જોઇએ જો સમજૂતી થયેલ કાર્યક્રમ આ AVC ઉત્પન્ન થયેલ હશે તે કર્નલ ને બદલવા માટે પ્રયત્ન કરે છે આ ગંભીર સમસ્યા છે. તમારી સિસ્ટમ સારી રીતે સમાધાન થયેલ હોઇ શકે છે.
ja: SELinux は カーネルアドレススペースの低位置を mmap する $SOURCE の 能力を 拒否しました。アドレススペースの低位置を mmap する能力の 設定は 、 /proc/sys/kernel/mmap_min_addr で行われます。そのようなマッピングを 拒否することは カーネル内での null deref バグの悪用を防止する手助けになります。この アクセスを必要とする全てのアプリケーションはそれ自身用にポリシーを書かせて おくべきでした。侵害されたアプリケーションがカーネルを修正する試みをすると、 この AVC が 生成されるでしょう。これは重大な問題です。ご使用のシステムは侵害されている 可能性が 高くなります。
kn: $SOURCE ಅನ್ನು ಕರ್ನಲ್‌ನ ವಿಳಾಸ ಕ್ಷೇತ್ರದ ಕೆಳಗಿನ ಸ್ಥಳದ mmap ಮಾಡುವ ಸಾಮರ್ಥ್ಯವನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ ವಿಳಾಸ ಕ್ಷೇತ್ರದ ಕೆಳಗಿನ ಸ್ಥಳಕ್ಕೆ mmap ಮಾಡುವಿಕೆಯ ಸಾಮರ್ಥ್ಯವು, /proc/sys/kernel/mmap_min_addr ನಲ್ಲಿ ಸೂಚಿಸಲಾಗಿರುತ್ತದೆ. ಅಂತಹ ಮ್ಯಾಪಿಂಗ್ ಅನ್ನು ತಡೆಯುವುದರಿಂದ ಕರ್ನಲ್‌ನಲ್ಲಿನ ಶೂನ್ಯ deref ದೋಷಗಳ ದುರುಪಯೋಗ ಪಡೆಯುವುದರ ವಿರುದ್ಧ ರಕ್ಷಣೆಯನ್ನು ನೀಡುತ್ತದೆ. ಈ ನಿಲುಕಣೆಯನ್ನು ಬಯಸುವ ಎಲ್ಲಾ ಅನ್ವಯಗಳಲ್ಲೂ ಪಾಲಿಸಿಯನ್ನು ಬರೆದಿರಬೇಕು. ರಾಜಿ ಮಾಡಿಕೊಳ್ಳಲಾದ ಯಾವುದೆ ಅನ್ವಯವು ಕರ್ನಲ್ ಅನ್ನು ಮಾರ್ಪಡಿಸಲು ಪ್ರಯತ್ನಿಸಿದಲ್ಲಿ ಈ AVC ಯನ್ನು ತೋರಿಸಲಾಗುತ್ತದೆ ಇದು ಒಂದು ಗಂಭೀರವಾದ ಸಮಸ್ಯೆಯಾಗದ್ದು. ನಿಮ್ಮ ಗಣಕವು ರಾಜಿ ಮಾಡಿಕೊಂಡಿರುವಂತೆ ತೋರುತ್ತಿದೆ.
or: SELinux $SOURCE କୁ ବାରଣ କରିଛି ଯେଉଁଥିରେ କର୍ଣ୍ଣଲର ଠିକଣା ସ୍ଥାନର ନିମ୍ନ କ୍ଷେତ୍ରକୁmmap କରିବାର କ୍ଷମତା ଥାଏ। ଠିକଣା ସ୍ଥାନର ନିମ୍ନ କ୍ଷେତ୍ରକୁ mmap କରିବାର କ୍ଷମତାକୁ, /proc/sys/kernel/mmap_min_addr ଦ୍ୱାରା ବିନ୍ୟାସ କରାଯାଇଥିବା ପରି। ଏପରି ମ୍ୟାପିଙ୍ଗକୁ ବାରଣ କରିବା ଦ୍ୱାରା ଏହା ଶୂନ୍ୟ deref ତ୍ରୁଟିଗୁଡ଼ିକୁ କର୍ଣ୍ଣଲରେ ଶୋଷଣ କରିବାରୁ ରକ୍ଷା କରିଥାଏ। ସମସ୍ତ ପ୍ରୟୋଗଗୁଡ଼ିକ ଯାହାକି ଏହି ଅଭିଗମ୍ୟତା ଆବଶ୍ୟକ କରିଥାଏ ସେଥିରେ ପୂର୍ବରୁ ସେମାନଙ୍କ ପାଇଁ ନିତୀ ଲିଖିତ ହୋଇଛି। ଯଦି ଗୋଟିଏ ହାର ମାନିଥିବା ପ୍ରୟୋଗ କର୍ଣ୍ଣଲକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ଚେଷ୍ଟାକରେ ତେବେ ଏହି AVC ସୃଷ୍ଟି ହୋଇଥାଏ। ଏହା ଏକ ଗୁରୁତର ସମସ୍ୟା। ଆପଣଙ୍କର ତନ୍ତ୍ର ହୁଏତଃ ଭଲ ଭାବରେ ହାର ମାନିଛି।
te: SELinux అనునది $SOURCE కెర్నల్ చిరునామా స్పేసు యొక్క తక్కువ ప్రాంతమును mmap చేయగలగు సామర్ధ్యంను తిరస్కరిస్తుంది. చిరునామా స్పేస్ యొక్క తక్కువ ప్రాంతముకు mmap చేయగలగు సామర్థ్యం, /proc/sys/kernel/mmap_min_addr ఆకృతీకరించుట ద్వారా. ఇటువంటి మాపింగులను నిరోధించుట కెర్నల్ నందలి null deref bugs ఎక్సుప్లోటింగ్ రక్షణకు సహాయపడుతుంది. ఈ యాక్సెస్ అవసరమైన అన్ని అనువర్తనములు వాటినుండి యిప్పటికే కలగివున్న పాలసీను కలిగివుండాలి. ఒకవేళ రాజీపడిన అనువర్తనము కెర్నల్‌ను మార్చుటకు ప్రయత్నిస్తే ఈ AVC వుద్భవించబడుతుంది. ఇది వొక తీవ్రమైన సమస్య. మీ సిస్టమ్ చాలా బాగా రాజీ పడవచ్చును.
uk: SELinux забороняє $SOURCE створювати mmap у початковому діапазоні адресного простору ядра. Така можливість налаштовується у /proc/sys/kernel/mmap_min_addr. Заборона mmap запобігає несанкційованому використанню помилок null deref у ядрі. Для всіх програм, яким потрібен такий доступ, мають існувати власні правила. Якщо скомпрометована програма намагається змінити ядро, буде згенеровано AVC. Це є серйозною проблемою та може бути ознакою компрометації, вашої системи.
zh_tw: SELinux 拒絕 $SOURCE mmap 內核定址空間 最開始的地方（low area）。mmap 定址空間的 low area 的功能 是以 /proc/sys/kernel/mmap_min_addr 來進行設定的。防止此映射 能幫助防禦內核中的 null deref 錯誤上的弱點。所有 需要此存取許可的應用程式都應該要有個對應它們所編寫 的方針。若有個受到入侵的應用程式嘗試修改內核的話，此 AVC 便會被產生。這是一項嚴重的問題。您的系統可能已遭受到 入侵。

source: you do not think $SOURCE_PATH should need to mmap low memory in the kernel.
as: আপুনি নাভাৱে যে $SOURCE_PATH এ কাৰনেলত নিম্ন মেমৰি mmap কৰিব লাগে
es: no cree que $SOURCE_PATH debería necesitar realizar un mmap sobre la baja memoria en el kernel.
gu: તમે એવુ ન વિચારો કે $SOURCE_PATH એ કર્નલમાં mmap નીચા સ્તરની મેમરીની જરૂર હોવી જોઇએ.
ja: $SOURCE_PATH は kernel で low メモリにmmapする必要はありません。
kn: $SOURCE_PATH ಕರ್ನಲ್‌ನಲ್ಲಿ ಕಡಿಮೆ ಮೆಮೊರಿಗೆ mmap ಮಾಡುವ ಅಗತ್ಯವಿರುವುದಿಲ್ಲ ಎಂದು ನೀವು ಭಾವಿಸುತ್ತೀರಿ.
or: ଆପଣ ଭାବୁନାହାନ୍ତି କି $SOURCE_PATH mmap ସ୍ୱଳ୍ପ ସ୍ମୃତିସ୍ଥାନକୁ କର୍ଣ୍ଣଲରେ ଆବଶ୍ୟକ କରିବା।
te: $SOURCE_PATH అనునది కెర్నల్ నందు తక్కువ మెమొరీను mmap చేయవలసివుంటుందని మీరు అనుకోవడంలేదు.
uk: вам здається, що $SOURCE_PATH не повинна відображати нижні області пам’яті у ядрі.
zh_tw: 您不認為 $SOURCE_PATH 應需要在 kernel 中 mmap low memory。

source: you may be under attack by a hacker, this is a very dangerous access.
as: আপুনি এজন হেকাৰ দ্বাৰা আক্ৰমণৰ সন্মুখিন হব পাৰে, ই এটা অতি বিপদজনক অভিগম।
es: podría estar siendo víctima de un ataque, este es un acceso muy peligroso.
gu: તમને હેકર દ્દારા હુમલો થઇ શકે છે, આ ખતરનાક પ્રવેશ છે.
ja: ハッカーから攻撃されている可能性があります。これは非常に危険なアクセスです。
kn: ನೀವು ಒಬ್ಬ ಹ್ಯಾಕರಿಂದ ದಾಳಿಗೆ ಒಳಗಾಗಿರಬಹುದು, ಇದು ಒಂದು ಅಪಾಯಕಾರಿಯಾದಂತಹ ನಿಲುಕಣೆಯಾಗಿದೆ.
or: ଆପଣ ହୁଏତଃ କୌଣସି ଅନାଧିକୃତ ଆକ୍ରମଣକାରୀଙ୍କ ଶିକାର ହୋଇଛନ୍ତି, ଏହା ଗୋଟିଏ ଗୁରୁତର ଆକ୍ରମଣ।
te: మీరు హాకర్ చేత దాడి చేయబడివుండవచ్చును, ఇది చాలా ప్రమాదకర యాక్సెస్.
uk: ймовірно, вас атакують зловмисники, оскільки такий доступ є дуже небезпечним.
zh_tw: 您可能遭受駭客攻擊，這是相當危險的存取動作。

source: SELinux prevented $SOURCE from mounting on the file or directory "$TARGET_PATH" (type "$TARGET_TYPE").
as: SELinux এ $SOURCE ক নথিপত্ৰ অথবা ডাইৰেকটৰিত মাউন্ট কৰাৰ পৰা প্ৰতিৰোধ কৰিছিল "$TARGET_PATH" (type "$TARGET_TYPE")।
es: SELinux previno acerca de la intención de $SOURCE de montar en el archivo o directorio "$TARGET_PATH" (tipo "$TARGET_TYPE").
gu: SELinux એ $SOURCE ને "$TARGET_PATH" ("$TARGET_TYPE" લખો) ફાઈલ અથવા ડિરેક્ટરી પર માઉન્ટ કરવાથી બચાવ્યું છે.
ja: SELinux は $SOURCE がファイル又はディレクトリー"$TARGET_PATH" (タイプ "$TARGET_TYPE") にマウントすることを阻止しました。
kn: SELinux ಕಡತವ್ಯವಸ್ಥೆಯನ್ನು "$TARGET_PATH" ("$TARGET_TYPE" ಬಗೆ) ಕಡತ ಅಥವ ಕಡತಕೋಶದ ಮೇಲೆ ಆರೋಹಿಸದಂತೆ $SOURCE ಅನ್ನು ತಡೆಯುತ್ತಿದೆ.
or: SELinux $SOURCE କୁ "$TARGET_PATH" (type "$TARGET_TYPE") ଫାଇଲ କିମ୍ବା ଡିରେକ୍ଟୋରିରେ ମାଉଣ୍ଟ କରିବାରୁ ଅଟକାଇଛି।
te: SELinux అనునది $SOURCE ను "$TARGET_PATH" (type "$TARGET_TYPE") దస్త్రము లేదా సంచయంనందు మౌంట్ అగుటనుండి నిరోదిస్తుంది.
uk: SELinux забороняє $SOURCE підключати файлову систему у файл чи каталог «$TARGET_PATH» (тип «$TARGET_TYPE»).
zh_tw: SELinux 防止 $SOURCE 在檔案或目錄 「$TARGET_PATH」（type「$TARGET_TYPE」）上進行掛載。

source: SELinux prevented $SOURCE from mounting a filesystem on the file or directory "$TARGET_PATH" of type "$TARGET_TYPE". By default SELinux limits the mounting of filesystems to only some files or directories (those with types that have the mountpoint attribute). The type "$TARGET_TYPE" does not have this attribute. You can change the label of the file or directory.
as: SELinux এ $SOURCE ক ধৰণ "$TARGET_TYPE" ৰ নথিপত্ৰ অথবা ডাইৰেকটৰি "$TARGET_PATH" ত এটা নথিপত্ৰপ্ৰণালী মাউন্ট কৰাৰ পৰা প্ৰতিৰোধ কৰিলে। অবিকল্পিতভাৱে SELinux এ নথিপত্ৰপ্ৰণালীসমূহৰ মাউন্টিংক কিছুমান নথিপত্ৰ অথবা ডাইৰেকটৰি (মাউন্টপোইন্ট বৈশিষ্ট থকা) লে সীমিত কৰে। ধৰণ "$TARGET_TYPE" ৰ এই বৈশিষ্ট নাই। আপুনি নথিপত্ৰ অথবা ডাইৰেকটৰিৰ লেবেল সলনি কৰিব পাৰিব।
es: SELinux previno acerca de la intención de $SOURCE de montar un sistema de archivo en el archivo o directorio "$TARGET_PATH" del tipo "$TARGET_TYPE". Por defecto, SELinux limita el montaje de sistemas de archivo sólo a algunos archivos o directorios (aquellos con los tipo con atributo de punto de montaje). El tipo "$TARGET_TYPE" no tiene este atributo. Puede cambiar la etiqueta del archivo o directorio.
gu: SELinux એ $SOURCE ને "$TARGET_TYPE" પ્રકારની "$TARGET_PATH" ફાઈલ અથવા ડિરેક્ટરી માઉન્ટ કરવાથી બચાવેલ છે. મૂળભૂત રીતે SELinux ફાઈલસિસ્ટમોના માઉન્ટિંગને અણુક ફાઈલો અથવા ડિરેક્ટરીઓ પૂરતું જ મર્યાદા મૂકે છે (માઉન્ટબિંદુ લક્ષણ હોય તે પ્રકારની માટે જ). પ્રકાર "$TARGET_TYPE" ને આ લક્ષણ નથી. તમે ફાઈલ અથવા ડિરેક્ટરીના લેબલને બદલી શકો છો.
ja: SELinux は $SOURCE がタイプ "$TARGET_TYPE"の "$TARGET_PATH" のファイル、又は ディレクトリー上にファイルシステムをマウントすることを阻止しました。デフォルトでは、 SELinux は、一部のファイルやディレクトリー(マウントポイント属性を持つタイプがあるもの)のみへ ファイルシステムのマウントを制限します。タイプ "$TARGET_TYPE" は、この属性を持ちません。 そのファイル又はディレクトリーのラベルは変更することができます。
kn: "$TARGET_TYPE" ಬಗೆಯ ಒಂದು ಕಡತ ಅಥವ ಕಡತಕೋಶ "$TARGET_PATH" ಅನ್ನು $SOURCEವು ಕಡತವ್ಯವಸ್ಥೆಯ ಮೇಲೆ ಆರೋಹಿಸದಂತೆ SELinux ತಡೆದಿದೆ.ಪೂರ್ವನಿಯೋಜಿತವಾಗಿ SELinux ಕಡತವ್ಯವಸ್ಥೆಯನ್ನು ಕೇವಲ ಕೆಲವು ಕಡತ ಅಥವ ಕಡತಕೋಶಗಳಿಗೆ (ಆರೋಹಣ ತಾಣದ ವೈಶಿಷ್ಟ್ಯವನ್ನು ಹೊಂದಿರುವ ಬಗೆಯವು) ಆರೋಹಿಸುವುದನ್ನು ಸೀಮಿತಗೊಳಿಸುತ್ತದೆ. "$TARGET_TYPE" ಯು ಈ ವೈಶಿಷ್ಟ್ಯವನ್ನು ಹೊಂದಿಲ್ಲ. ನೀವು ಒಂದು ಕಡತ ಅಥವ ಕಡತ ಕೋಶದ ಲೇಬಲ್ ಅನ್ನು ಬದಲಾಯಿಸಬಹುದು.
or: SELinux $SOURCE କୁ "$TARGET_TYPE" ପ୍ରକାରର "$TARGET_PATH" ଫାଇଲ କିମ୍ବା ଡିରେକ୍ଟୋରୀ ଉପରେ ଫାଇଲତନ୍ତ୍ରକୁ ସ୍ଥାପନ କରିବାରୁ ବାରଣ କରିଥାଏ। ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଭାବରେ SELinux ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକର ସ୍ଥାପନାକୁ କେବଳ କିଛି ଫାଇଲ କିମ୍ବା ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକ ମଧ୍ଯରେ ସୀମିତ କରିଥାଏ (ସ୍ଥାପନ ବିନ୍ଦୁ ଗୁଣଧର୍ମ ବିଶିଷ୍ଟ)। ପ୍ରକାର "$TARGET_TYPE" ରେ ଏହି ଗୁଣଧର୍ମ ନାହିଁ। ଆପଣ ସେହି ଫାଇଲ କିମ୍ବା ଡିରେକ୍ଟୋରୀର ନାମପଟିକୁ ପରିବର୍ତ୍ତନ କରିପାରିବେ।
te: SELinux అనునది $SOURCE ను దస్త్రము లేదా సంచయం "$TARGET_PATH" ఈ రకముది "$TARGET_TYPE" నందు దస్త్రవ్యవస్థ మౌంట్ అవుటనుండి నిరోధిస్తుంది. అప్రమేయంగా SELinux దస్త్రవ్యవస్థల యొక్క మౌంటిగ్‌ను పరిమితం చేస్తుంది కొన్ని దస్త్రములకు లేదా సంచయాలకు (ఏవేతా మౌంట్‌పాయింట్ యాట్రిబ్యూట్‌ను కలిగిఉన్నాయో). ఆ రకం "$TARGET_TYPE" ఈ యాట్రిబ్యూట్‌ను కలిగివుండదు. మీరు లేబుల్‌ను మార్చవచ్చు దస్త్రముది లేదా సంచయంది.
uk: SELinux заборонила $SOURCE підключати файлову систему у «$TARGET_PATH» з типом «$TARGET_TYPE». Типово SELinux обмежує монтування файлових систем деякими файлами чи каталогами (що мають атрибут mountpoint). Тип «$TARGET_TYPE» не має цього атрибуту. Ви можете змінити мітку файлу або каталогу.
zh_tw: SELinux 防止 $SOURCE 將檔案系統掛載至檔案 或目錄上「$TARGET_PATH」類型為「$TARGET_TYPE」。就預設值來講， SELinux 會將檔案系統的掛載限制為僅有某些檔案或 目錄（這些檔案或目錄的類型皆含有掛載點屬性）。 「$TARGET_TYPE」這個類型並沒有此屬性。您可更改檔案或目錄的 標籤。

source: Changing the file_context to mnt_t will allow mount to mount the file system: "chcon -t mnt_t '$TARGET_PATH'." You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
as: file_context ক mnt_t লে সলনি কৰিলে নথিপত্ৰ প্ৰণালী মাউন্ট কৰিবলে মাউন্টৰ অনুমতি দিব: "chcon -t mnt_t '$TARGET_PATH'।" আপুনি লগতে চিস্টেমত অবিকল্পিত নথিপত্ৰ পৰিপ্ৰেক্ষতিত নথিপত্ৰসমূহ সলনি কৰিব লাগিব যাতে সিহতক এটা সম্পূৰ্ণ পুনৰলেবেলত সংৰক্ষৰণ কৰিব পাৰি। "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
es: Modificar el contexto a mnt_t permitirá el montaje del sistema de archivo: "chcon -t mnt_t '$TARGET_PATH'." También debe cambiar el archivo predeterminado de contexto de archivos en el sistema, para preservarlos aún cuando realice un reetiquetado completo. "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
gu: file_context ને mnt_t માં બદલવાનું માઉન્ટને ફાઈલ સિસ્ટમ માઉન્ટ કરવા માટે પરવાનગી આપશે: "chcon -t mnt_t '$TARGET_PATH'." તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઈલોને પણ સંપૂર્ણ પુન:લેબલ પર તેઓને સાચવવા માટે ક્રમમાં સિસ્ટમ પર બદલવી જ પડશેજાળવવા માટે. "semanage fcontext -a -t mnt_t '$TARGET_PATH'"
ja: file_context を mnt_t に変更すると、mount によるファイルシステムのマウントが 許可されます: "chcon -t mnt_t '$TARGET_PATH'." また、完全な再ラベルの後でもそれらを保持できるように、システム上でデフォルトの ファイルコンテキストファイルの変更もしなければなりません。"semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
kn: file_context ಅನ್ನು mnt_t ಗೆ ಬದಲಾಯಿಸುವುದರಿಂದ ಕಡತವ್ಯವಸ್ಥೆಯನ್ನು ಆರೋಹಿಸಲು ಮೌಂಟ್‍ಗೆ ಅನುಮತಿ ಒದಗಿಸುತ್ತದೆ "chcon -t mnt_t '$TARGET_PATH'." ಒಂದು ಸಂಪೂರ್ಣ ಮರುಲೇಬಲ್ ನಂತರವೂ ಗಣಕಗಳ ಕಡತವನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವುಗಳ ಪೂರ್ವನಿಯೋಜಿತ ಸಂರಚನೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ. "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
or: ଆପଣ file_context କୁ mnt_t ରେ ବଦଳାଇବା ଫଳରେ ଫାଇଲ ତନ୍ତ୍ରକୁ ସ୍ଥାପନ କରିବା ପାଇଁ ଅନୁମତି ଦେଇପାରିବେ: "chcon -t mnt_t '$TARGET_PATH'." ସେମାନଙ୍କୁ ସମ୍ପୂର୍ଣ୍ଣ ପୁନଃ ନାମକରଣରେ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ଆପଣ ମଧ୍ଯ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଫାଇଲ ପ୍ରସଙ୍ଗ ଫାଇଲକୁ ତନ୍ତ୍ରରେ ପରିବର୍ତ୍ତନ କରିପାରିବେ। "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
te: file_context ను mnt_t కు మార్చుట అనునది దస్త్రవ్యవస్థను మౌంట్ నుండి మౌంట్‌కు అనుమతిస్తుంది: "chcon -t mnt_t '$TARGET_PATH'." మీరు అప్రమేయ దస్త్ర సందర్భ దస్త్రాలను సిస్టమ్ నందు పూర్తి చేరికగా వుంచుటకు మార్చాలి. "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
uk: Заміна file_context на mnt_t дозволить підключити файлову систему: «chcon -t mnt_t '$TARGET_PATH'.» Також треба змінити типові контексти файлів у системі, щоб вони збереглись навіть при повторній розмітці. «semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'»
zh_tw: 將 file_context 更改為 mnt_t 可允許 mount 掛載檔案系統： 「chcon -t mnt_t '$TARGET_PATH'」。 您也必須更改系統上的預設檔案情境檔，才能在完整重新標記的情況下將它們保留住。「semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'」

source: you want to allow $SOURCE_BASE_PATH to mount on $TARGET_BASE_PATH.
as: আপুনি $SOURCE_BASE_PATH ক $TARGET_BASE_PATH ত মাউন্ট কৰিবলে অনুমতি দিব বিচাৰে।
es: desea permitir que $SOURCE_BASE_PATH sea montado en $TARGET_BASE_PATH.
gu: તમે $TARGET_BASE_PATH પર માઉન્ટ કરવા માટે $SOURCE_BASE_PATH ને પરવાનગી આપવા માંગો છો.
ja: $SOURCE_BASE_PATH が、 $TARGET_BASE_PATH 上でマウントすることを、許可したい。
kn: $TARGET_BASE_PATH ನಲ್ಲಿ ಆರೋಹಿಸಲು ನೀವು $SOURCE_BASE_PATH ಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಿ.
or: $TARGET_BASE_PATH ଉପରେ ସ୍ଥାପନ କରିବା ପାଇଁ ଆପଣ $SOURCE_BASE_PATH କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି କି।
te: మీరు $SOURCE_BASE_PATH ను $TARGET_BASE_PATH పై మౌంట్ చేయుటకు అనుమతించాలని అనుకొనుచున్నారా.
uk: ви бажаєте надати доступ $SOURCE_BASE_PATH до монтування у $TARGET_BASE_PATH.
zh_tw: 您希望允許將 $SOURCE_BASE_PATH 掛載至 $TARGET_BASE_PATH 上。

source: you must change the labeling on $TARGET_PATH.
as: আপুনি $TARGET_PATH ত লেবেলিং সলনি কৰিব লাগিব।
es: debe modificar el etiquetado sobre $TARGET_PATH.
gu: તમારે $TARGET_PATH પર લેબલને બદલવુ જ જોઇએ.
ja: $TARGET_PATH のラベルを変更しなければいけません。
kn: $TARGET_PATH ನಲ್ಲಿ ನೀವು ಲೇಬಲ್ ಅನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ.
or: ଆପଣଙ୍କୁ ନିଶ୍ଚିତ ଭାବରେ $TARGET_PATH ଉପରେ ନାମପଟିକୁ ପରିବର୍ତ୍ତନ କରିବା ଉଚିତ।
te: $TARGET_PATH పైన మీరు లేబిలింగ్‌ను తప్పక మార్చాలి.
uk: вам слід змінити мітки на $TARGET_PATH.
zh_tw: 您必須更改 $TARGET_PATH 上的標簽。

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access to $TARGET_PATH.
as: SELinux এ $TARGET_PATH লে $SOURCE_PATH "$ACCESS" অভিগম প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a $SOURCE_PATH "$ACCESS" acceder a $TARGET_PATH.
gu: SELinux એ $SOURCE_PATH "$ACCESS" વપરાશને $TARGET_PATH થી અટકાવી રહ્યું છે.
ja: SELinux は $SOURCE_PATH による $TARGET_PATH への "$ACCESS" アクセスを阻止しています。
kn: ಸಾಧನ $TARGET_PATH ಕ್ಕೆ $SOURCE_PATH "$ACCESS" ನ ನಿಲುಕಣೆಯನ್ನು SELinux ತಡೆದಿದೆ.
or: SELinux $SOURCE_PATH କୁ $TARGET_PATH ଉପକରଣରେ "$ACCESS" କରିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH "$ACCESS" యాక్సెస్‌ను $TARGET_PATHకు నిరోధిస్తోంది.
uk: SELinux забороняє $SOURCE_PATH доступ "$ACCESS" до $TARGET_PATH.
zh_tw: SELinux 防止 $SOURCE_PATH「$ACCESS」存取 $TARGET_PATH。

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be a mislabeled. openvpn is allowed to read content in home directory if it is labeled correctly.
as: SELinux এ $SOURCE দ্বাৰা অনুৰোধ কৰা অভিগম নাকচ কৰিছে। $TARGET_PATH ভূলভাৱে লেবেল কৰা থাকিব পাৰে। openvpn ক ঘৰ ডাইৰেকটৰিত বিষয়বস্তু পঢ়াৰ অনুমতি দিয়া হয় যদিহে ই সঠিকভাৱে লেবেল কৰা থাকে।
es: SELinux ha negado el acceso solicitado por $SOURCE. $TARGET_PATH puede ser un error de etiqueta. openvpn tiene permitido leer contenidos del directorio personal si es que está correctamente etiquetado.
gu: SELinux એ $SOURCE દ્વારા અરજી થયેલ વપરાશની નામંજૂરી આપી. $TARGET_PATH એ ખોટી રીતે લેબલ થયેલ હોઈ શકે. openvpn ને ઘર ડિરેક્ટરીમાં સમાવિષ્ટને વાંચવા માટે પરવાનગી આપેલ છે જો તે યગ્ય રીતે લેબલ થયેલ છે.
ja: SELinux は $SOURCE から要求されたアクセスを拒否しました。$TARGET_PATH が 間違えたラベルを付けている可能性があります。正しいラベルがあれば openvpn はホームディレクトリの コンテンツを読み込むことができます。
kn: $SOURCE ಇಂದ ಮನವಿ ಸಲ್ಲಿಸಲಾದ ನಿಲುಕಣಾ ಮನವಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ $TARGET_PATH ಅನ್ನು ತಪ್ಪಾಗಿ ಲೇಬಲ್ ಮಾಡಿರಬಹುದು. openvpn ಅನ್ನು ಸರಿಯಾಗಿ ಲೇಬಲ್ ಮಾಡಲಾಗಿದ್ದಲ್ಲಿ, ನೆಲೆ ಕೋಶದಿಂದ ಓದಲು ಅನುಮತಿ ಇರುತ್ತದೆ.
or: SELinux $SOURCE ଦ୍ୱାରା ଅନୁରୋଧ କରାଯାଇଥିବା ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଅଛି। $TARGET_PATH ହୁଏତଃ ଭୁଲ ନାମକରଣ ହୋଇଥାଇପାରେ। openvpn କୁ home ଡିରେକ୍ଟୋରୀରେ ଥିବା ବିଷୟବସ୍ତୁଗୁଡ଼ିକୁ ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦିଆଯାଇଥାଏ ଯଦି ଏହା ସଠିକ ଭାବରେ ନାମକରଣ ହୋଇଥାଏ।
uk: SELinux запобігає доступу за запитом $SOURCE. Можливо, встановлена мітка $TARGET_PATH є некоректною. Якщо каталог /home позначено правильно, openvpn буде дозволено читати його вміст.
zh_tw: SELinux 拒絕 $SOURCE 的存取請求。$TARGET_PATH 可能標記 錯誤。如果 openvpn 標記正確的話，可以讀取家目錄內的 內容。

source: You can restore the default system context to this file by executing the restorecon command. restorecon restore using restorecon -R /root/.ssh.
as: আপুনি এই নথিপত্ৰলে অবিকল্পিত চিস্টেম পৰিপ্ৰেক্ষতিত restorecon কমান্ড ব্যৱহাৰ কৰি পুনৰুদ্ধাৰ কৰিব পাৰিব। restorecon পুনৰুদ্ধাৰ restorecon -R /root/.ssh ব্যৱহাৰ কৰি।
es: Puede restaurar el contexto predeterminado del sistema para este archivo ejecutando el comando restorecon. restorecon restaura utilizando restorecon -R /root/.ssh.
gu: તમે મૂળભૂત સિસ્ટમ સંદર્ભ આ ફાઈલમાં restorecon આદેશ ચલાવીને પુનઃસંગ્રહી શકો. restorecon ને , restorecon -R '$TARGET_PATH' ની મદદથી પુનઃસંગ્રહી શકો.
ja: restorecon コマンドを実行することにより、このファイルへデフォルトのシステムコンテキストを 復元することが出来ます。restorecon は restorecon -R /root/.ssh を使用して 復元します。
kn: ಈ ಕಡತಕ್ಕೆ ಗಣಕದ ಪೂರ್ವನಿಯೋಜಿತ ಸನ್ನಿವೇಶವನ್ನು ಮರುಸ್ಥಾಪಿಸಲು restorecon ಆಜ್ಞೆಯನ್ನು ನೀವುಬಳಸಬಹುದಾಗಿದೆ. restorecon -R /root/.ssh ಅನ್ನು ಬಳಸಿಕೊಂಡು ಮರುಸ್ಥಾಪಿಸಬಹುದಾಗಿದೆ.
or: ଆପଣ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ତନ୍ତ୍ର ପ୍ରସଙ୍ଗକୁ ଏହି ଫାଇଲରେ restorecon ନିର୍ଦ୍ଦେଶକୁ ନିଷ୍ପାଦନ କରି ପୁନଃସ୍ଥାପନ କରିପାରିବେ। restorecon -R /root/.ssh କୁ ବ୍ୟବହାର କରି restorecon ପୁନଃସ୍ଥାପନ କରିପାରିବ।
te: మీరు అప్రమేయ సిస్టమ్ సందర్భంను ఈ దస్త్రముకు restorecon ఆదేశమును నిర్వర్తించుట ద్వారా తిరిగివుంచగలరు. restorecon -R /root/.ssh వుపోయగించి restorecon తిరిగివుంచబడును.
uk: Первинний контекст можна відновити за допомогою команди restorecon Виконайте команду «restorecon -R /root/.ssh».
zh_tw: 您可透過執行 restorecon 指令來復原此檔案的 預設系統情境。restorecon 會透過使用 restorecon -R /root/.ssh 來進行復原。

source: you want to mv $TARGET_BASE_PATH to standard location so that $SOURCE_BASE_PATH can have $ACCESS access
as: আপুনি $TARGET_BASE_PATH ক প্ৰামাণিক অৱস্থানলে mv কৰিব বিচাৰে যাতে $SOURCE_BASE_PATH ৰ $ACCESS অভিগম থাকে
es: desea mover $TARGET_BASE_PATH a una ubicación estándar, de modo que $SOURCE_BASE_PATH pueda tener acceso $ACCESS
gu: તમે મૂળભૂત સ્થાનમાં mv $TARGET_BASE_PATH ને ઇચ્છો છો તેથી $SOURCE_BASE_PATH પાસે $ACCESS પ્રવેશ હોઇ શકે છે
ja: $SOURCE_BASE_PATH が $ACCESS へアクセスできるよう、 $TARGET_BASE_PATH を標準の場所に移動したい
kn: $SOURCE_BASE_PATH $ACCESS ನಿಲುಕಣೆಯನ್ನು ಹೊಂದಿರುವಂತೆ ನೀವು $TARGET_BASE_PATH ಅನ್ನು ಒಂದು ಶಿಷ್ಟವಾದ ಸ್ಥಳಕ್ಕೆ mv ಮಾಡಲು ಬಯಸುತ್ತೀರಿ
or: $TARGET_BASE_PATH mv କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି ଯାହା ଫଳରେ $SOURCE_BASE_PATH କୁ $ACCESS ଅଭିଗମ୍ୟ ଅନୁମତି ମିଳିପାରିବ
te: మీరు mv $TARGET_BASE_PATH అనునది ప్రామాణిక స్థానమునకు చేయాలని అనుకొంటున్నారా అలా $SOURCE_BASE_PATH అనునది $ACCESS యాక్సెస్‌ను కలిగివుండగలదు
uk: ви маєте намір пересунути $TARGET_BASE_PATH до стандартного розташування так, щоб $SOURCE_BASE_PATH могла мати доступ $ACCESS
zh_tw: 您希望將 $TARGET_BASE_PATH 移至標準的位置，如此一來 $SOURCE_BASE_PATH 將擁有 $ACCESS 存取權限

source: you want to modify the label on $TARGET_BASE_PATH so that $SOURCE_BASE_PATH can have $ACCESS access on it
as: আপুনি $TARGET_BASE_PATH ত লেবেল সলনি কৰিব বিচাৰে যাতে $SOURCE_BASE_PATH ৰ ইয়ালৈ $ACCESS অভিগম থাকে
es: desea modificar la etiqueta en $TARGET_BASE_PATH de modo que $SOURCE_BASE_PATH pueda tener acceso $ACCESS sobre él
gu: તમે $TARGET_BASE_PATH પર લેબલને બદલવા માંગો છો તેથી $SOURCE_BASE_PATH ને તેની પર $ACCESS પ્રવેશ હોઇ શકે છે
ja: $SOURCE_BASE_PATH が $ACCESS へアクセスできるよう、 $TARGET_BASE_PATH のラベルを編集したい
kn: $SOURCE_BASE_PATH $ACCESS ನಿಲುಕಣೆಯನ್ನು ಹೊಂದಿರುವಂತೆ ನೀವು $TARGET_BASE_PATH ನ ಲೇಬಲ್ ಅನ್ನು ಮಾರ್ಪಡಿಸಲು ಬಯಸುತ್ತೀರಿ
or: ଆପଣ $TARGET_BASE_PATH ଉପରେ ନାମପଟିକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ଚାହୁଁଛନ୍ତି ଯାହାଫଳରେ $SOURCE_BASE_PATH ରେ $ACCESS ଅଭିଗମ୍ୟତା ରହିପାରିବ
te: మీరు $TARGET_BASE_PATH పైని లేబుల్‌ను సవరించాలని అనుకొనుచున్నారా అలా $SOURCE_BASE_PATH దానిపై $ACCESS యాక్సెస్‌ను కలిగివుండగలదు
uk: ви бажаєте змінити мітку $TARGET_BASE_PATH так, щоб $SOURCE_BASE_PATH могла мати доступ $ACCESS до даних
zh_tw: 您需要更改 $TARGET_BASE_PATH 上的標籤，如此一來 $SOURCE_BASE_PATH 便能擁有 $ACCESS 存取權限

source: you must move the cert file to the ~/.cert directory
as: আপুনি cert নথিপত্ৰক ~/.cert ডাইৰেকটৰিলে স্থানান্তৰ কৰিব লাগিব
es: debe mover el archivo cert al directorio ~/.cert
gu: તમારે ~/.cert ડિરેક્ટરીમાં cert ફાઇલને ખસેડવુ જ જોઇએ
ja: cert ファイルを ~/.cert directory に移動しなければいけません
kn: ನೀವು cert ಕಡತವನ್ನು ~/.cert ಕೋಶಕ್ಕೆ ಜರುಗಿಸಬೇಕು
or: ଆପଣଙ୍କୁ ନିଶ୍ଚିତ ଭାବରେ ପ୍ରମାଣପତ୍ର ଫାଇଲକୁ ~/.cert ଡିରେକ୍ଟୋରୀ ମଧ୍ଯକୁ ପଠାଇବା ଉଚିତ
te: మీరు సర్ట్ ఫైలును ~/.cert డైరెక్టరీకు తప్పక కదల్చవలెను
uk: вам слід пересунути файл сертифіката до каталогу ~/.cert
zh_tw: 您必須將憑證檔案移至 ~/.cert 目錄

source: you must fix the labels.
as: আপুনি লেবেলসমূহ ঠিক কৰিব লাগিব।
es: debe arreglar las etiquetas.
gu: તમારે લેબલોને સુધારવુ જ જોઇએ.
ja: ラベルを修正しなければいけません。
kn: ನೀವು ಲೇಬಲ್‌ಗಳನ್ನು ಸರಿಪಡಿಸಬೇಕು.
or: ଆପଣଙ୍କୁ ନିଶ୍ଚିତ ଭାବରେ ନାମପଟିକୁ ସମାଧାନ କରିବାକୁ ହେବ।
te: మీరు తప్పక లేబుల్సును అమర్చాలి.
uk: вам слід виправити мітки.
zh_tw: 您必須修正標籤。
