Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: Changing the "allow_ftpd_use_nfs" and "$WRITE_BOOLEAN" booleans to true will allow this access: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". warning: setting the "$WRITE_BOOLEAN" boolean to true will allow the ftp daemon to write to all public content (files and directories with type public_content_t) in addition to writing to files and directories on NFS filesystems.
as: "allow_ftpd_use_nfs" আৰু "$WRITE_BOOLEAN" বুলিয়ানসমূহক true লে সলনি কৰিলে এই অভিগমৰ অনুমতি পোৱা যাব: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1"। সতৰ্কবাৰ্তা: "$WRITE_BOOLEAN" বুলিয়ানক true লে সংহতি কৰিলে ftp ডিমনক সকলো ৰাজহুৱা বিষয়বস্তুলে লিখাৰ অনুমতি দিয়া হব (ধৰণ public_content_t ৰ সৈতে নথিপত্ৰসমূহ আৰু ডাইৰেকটৰিসমূহ) NFS নথিপত্ৰপ্ৰণালীসমূহত নথিপত্ৰ আৰু ডাইৰেকটৰিসমূহলে লিখাৰ অতিৰিক্তে।
es: Cambiando los booleanos "allow_ftpd_use_nfs" and "$WRITE_BOOLEAN" a 1 permitirán este acceso: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". Advertencia: poner el booleano $WRITE_BOOLEAN a 1 permitirá al demonio ftp escribir a todo el contenido público (archivos y directorios con el tipo public_content_t) además de escribir a archivos y directorios en sistemas de archivos NFS.
gu: "allow_ftpd_use_nfs" અને "$WRITE_BOOLEAN" બુલિયનોને ખરામાં બદલવાનું આ વપરાશની પરવાનગી આપશે: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". ચેતવણી: "$WRITE_BOOLEAN" બુલિયનને ખરામાં સુયોજિત કરવાનું ftp ડિમનને બધા જાહેર સમાવિષ્ટો (public_content_t પ્રકાર સાથેની ફાઈલો અને ડિરેક્ટરીઓ) માં લખવાની પરવાનગી આપશે NFS ફાઈલસિસ્ટમો પર ફાઈલો અને ડિરેક્ટરીઓ પર લખવા સાથે વધુમાં.
ja: "allow_ftpd_use_nfs" ブーリアンと "$WRITE_BOOLEAN" ブーリアンを true に変更するとこのアクセスを許可します: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1"。 警告: "$WRITE_BOOLEAN" ブーリアンを true に設定すると、 NFS ファイルシステム上のファイルやディレクトリーへの書き込みに加えてすべて のパブリックコンテント(タイプ public_content_t のファイル及びディレクトリー) への書き込みを ftp デーモンに許可することになります。
kn: "allow_ftpd_use_nfs" ಹಾಗು "$WRITE_BOOLEAN" ಬೂಲಿಯನ್‍ಗಳನ್ನು ನಿಜಕ್ಕೆ ಬದಲಾಯಿಸುವುದರಿಂದ ಅದು ಈ ನಿಲುಕನ್ನು ಅನುಮತಿಸುತ್ತದೆ: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". ಎಚ್ಚರಿಕೆ: "$WRITE_BOOLEAN" ಬೂಲಿಯನ್‍ಗಳನ್ನು ನಿಜಕ್ಕೆ ಹೊಂದಿಸುವುದರಿಂದ ftp ಡೆಮನ್‍ಗೆ NFS ಕಡತ ವ್ಯವಸ್ಥೆಗಳಲ್ಲಿನ ಕಡತಗಳು ಹಾಗು ಕಡತಕೋಶಗಳ ಜೊತೆಗೆ ಎಲ್ಲಾ ಸಾರ್ವಜನಿಕ ವಿಷಯಗಳನ್ನು (public_content_t ಬಗೆಯ ಕಡತಗಳು ಹಾಗು ಕಡತಕೋಶಗಳು) ಬರೆಯಲು ಅನುಮತಿಯನ್ನು ಒದಗಿಸುತ್ತದೆ.
or: "allow_ftpd_use_nfs" ଏବଂ "$WRITE_BOOLEAN" ବୁଲିଆନଗୁଡ଼ିକୁ true ରେ ପରିବର୍ତ୍ତନ କରିବା ଦ୍ୱାରା ଏହି ଅଭିଗମ୍ୟକୁ ଅନୁମତି ମିଳିଥାଏ: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". ଚେତାବନୀ: "$WRITE_BOOLEAN" ବୁଲିଆନକୁ true କରିବା ଦ୍ୱାରା ଏହା ftp ଡେମନକୁ ସମସ୍ତ ସାର୍ବଜନୀନ ସୂଚୀକୁ (public_content_t ପ୍ରକାର ବିଶିଷ୍ଟ ଫାଇଲ ଏବଂ ଡ଼ିରେକ୍ଟୋରୀ) ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବା ସହିତ NFS ଫାଇଲ ତନ୍ତ୍ରଗୁଡ଼ିକରେ ଫାଇଲ ଏବଂ ଡ଼ିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ଲେଖିବାକୁ ଅନୁମତି ଦେଇଥାଏ.
te: "allow_ftpd_use_nfs" మరియు "$WRITE_BOOLEAN" బూలియన్స్‍‌ను సత్యంకు మార్చుట అనునది ఈ వాడుకను అనుమతిస్తుంది: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". హెచ్చరిక: "$WRITE_BOOLEAN" బూలీయన్‌ను సత్యంకు అమర్చుట ftp డెమోన్‌ను అన్ని పబ్లిక్ సారాలను (దస్త్రములు మరియు సంచయాలు public_content_t రకమువి) వ్రాయుటకు అనుమతిస్తుంది దస్త్రాలను మరియు సంచయాలను NFS దస్త్రవ్యవస్థ పై వ్రాయుటకన్నా.
uk: Встановлення ознак «allow_ftpd_use_nfs» та «$WRITE_BOOLEAN» дозволить такий доступ: «setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1». увага: встановлення ознаки «$WRITE_BOOLEAN» у TRUE дозволяє службі ftp писати у спільні області (файли та каталоги с типом public_content_t) окрім запису у файли та каталоги на NFS розділах.
zh_tw: 若將「allow_ftpd_use_nfs」和 「$WRITE_BOOLEAN」布林值更改為 true 的話將可允許此存取： 「setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1」。 警告：若將「$WRITE_BOOLEAN」布林值設為 true 的話將會 允許 ftp 幕後程式除寫入 NFS 檔案系統上的檔案與目錄之外，還可對所有的公用內容進行寫入 (類型為 public_content_t 的檔案 和目錄)。

source: you want to allow ftpd to write to nfs file systems
as: আপুনি ftpd ক nfs নথিপত্ৰপ্ৰণালীসমূহলে লিখাৰ অনুমতি দিব বিচাৰে
es: desea permitir que ftpd escriba sobre sistemas de archivos nfs
gu: તમે nfs ફાઇલ સિસ્ટમોને લખવા માટે ftpd ને પરવાનગી આપવા માંગો છો
ja: ftpd が、nfs ファイルシステムに書込むことを、許可したい
kn: nfs ಕಡತ ವ್ಯವಸ್ಥೆಗಳಿಗೆ ಬರೆಯುವಂತೆ ನೀವು ftpd ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಿ
or: ଆପଣ ftpd କୁ nfs ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు ftpd ను nfs ఫైల్ సిస్టమ్సుకు వ్రాయుటకు అనుమతించాలి అనుకొనుచున్నారా
uk: ви маєте намір дозволити ftpd виконувати запис до файлових систем nfs
zh_tw: 您需要允許 ftpd 寫入 nfs 檔案系統

source: SELinux is preventing the $SOURCE_PATH from executing potentially mislabeled files $TARGET_PATH.
as: SELinux এ $SOURCE_PATH ক বিভৱীয়ভাৱে ভুললেবেল নথিপত্ৰ $TARGET_PATH এক্সিকিউট কৰাৰ পৰা প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a $SOURCE el uso de archivos que estén potencialmente mal etiquetados $TARGET_PATH.
gu: SELinux એ $SOURCE ને સંભવિતપણે ખોટી રીતે લેબલ થયેલ ફાઈલો $TARGET_PATH ચલાવવાથી બચાવી રહ્યું છે.
ja: SELinux は $SOURCE_PATH による、誤ったラベル付けの可能性のあるファイル $TARGET_PATH の使用を阻止しています。
kn: ಸಮರ್ಥವಾಗಿ ತಪ್ಪಾಗಿ ಲೇಬಲ್ ಮಾಡಲ್ಪಟ್ಟ ಕಡತಗಳ $TARGET_PATH ಅನ್ನು $SOURCE_PATHಬಳಸಿಕೊಳ್ಳದಂತೆ SELinux ತಡೆದಿದೆ.
or: SELinux $SOURCE_PATH କୁ ଭୁଲ ବନାନ ହୋଇଥିବା $TARGET_PATH ସାମର୍ଥ୍ଯ ଫାଇଲ ମାନଙ୍କୁ ବ୍ୟବହାର କରିବାରୁ ଅଟକାଇଛି।
te: SELinux అనునది సామర్ద్యపు తప్పులేబుల్‌గల దస్త్రాలు $TARGET_PATH ను నిర్వర్తించుటనుండి $SOURCE_PATH ను నిరోధిస్తోంది.
uk: SELinux забороняє $SOURCE_PATH використовувати потенційно неправильно розмічених файлів $TARGET_PATH.
zh_tw: SELinux 防止 $SOURCE_PATH 使用可能錯誤標記的檔案 $TARGET_PATH。

source: SELinux has denied the $SOURCE_PATH from executing potentially mislabeled files $TARGET_PATH. Automounter can be setup to execute configuration files. If $TARGET_PATH is an automount executable configuration file it needs to have a file label of bin_t. If automounter is trying to execute something that it is not supposed to, this could indicate an intrusion attempt.
as: SELinux এ $SOURCE_PATH ক বিভৱীয়ভাৱে ভুল ধৰণে লেবেল কৰা নথিপত্ৰসমূহ $TARGET_PATH এক্সিকিউট কৰা নাকচ কৰিছে। স্বমাউন্টাৰক সংৰূপ নথিপত্ৰসমূহ এক্সিকিউট কৰিবলে সংস্থাপন কৰিব পাৰি। যদি $TARGET_PATH এটা স্বমাউন্ট এক্সিকিউটেবুল সংৰূপ নথিপত্ৰ ইয়াৰ bin_t লেবেল থাকিব লাগিব। যদি স্বমাউন্টাৰে এক্সিকিউট কৰিব নলগা কিবাক এক্সিকিউট কৰাৰ চেষ্টা কৰি আছে, ই এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে।
es: SELinux le ha negado a $SOURCE_PATH la ejecución de archivos potencialmente mal etiquetados $TARGET_PATH. El automontador se puede configurar para ejecutar archivos de configuración, si $TARGET_PATH es un archivo de configuración ejecutable de automount, necesita tener la etiqueta bin_t. Si el automontador está intentando ejecutar algo que no se suponía que debía ejecutar, esto puede estar indicando un ataque.
gu: SELinux એ $SOURCE_PATH ને સંભવિતપણે ખોટી રીતે લેબલ થયેલ ફાઈલો $TARGET_PATH ચલાવવાથી નામંજૂર કર્યું. રૂપરેખાંકન ફાઈલો ચલાવવા માટે ઓટોમાઉન્ટ કરનાર સુયોજિત કરી શકાય છે, જો $TARGET_PATH એ ઓટોમાઉન્ટ ચલાવી શકાય તેવી રૂપરેખાંકન ફાઈલ હોય તો તેને bin_t નું લેબલ હોવું જોઈએ. જો ઓટોમાઉન્ટ કરનાર કંઈક ચલાવવાનો પ્રયાર કરી રહ્યું હોય કે જે થવું જોઈએ નહિં, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.
ja: SELinux は $SOURCE_PATH が間違ったラベルを持つ可能性のあるファイル $TARGET_PATH を実行するのを拒否しました。自動マウンタは設定ファイルを 実行するようにセット出来ます。 $TARGET_PATH が自動マウント実行可能な 設定ファイルである場合、bin_t のファイルラベルを持つ必要があります。 自動マウンタが想定されていない何かを実行しようとしている場合、 これは不正侵入をを示唆している可能性があります。
kn: ಸಮರ್ಥವಾಗಿ ತಪ್ಪುಲೇಬಲ್ ಮಾಡಲಾದ $TARGET_PATH ಕಡತಗಳನ್ನು $SOURCE_PATH ಕಾರ್ಯಗತಗೊಳಿಸುವುದನ್ನು SELinux ತಡೆಯುತ್ತಿದೆ. ಸಂರಚನಾ ಕಡತಗಳನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಲು ಆಟೋಕೌಂಟರನ್ನು ಸಜ್ಜುಗೊಳಿಸಬಹುದು. $TARGET_PATH ವು ಸ್ವಯಂಆರೋಹಣಾ(ಆಟೋಮೌಂಟ್) ಕಾರ್ಯಗತಗೊಳಿಸಬಲ್ಲ ಸಂರಚನಾ ಕಡತವಾಗಿದ್ದರೆ ಅದಕ್ಕೆ ಒಂದು bin_t ಕಡತ ಲೇಬಲ್‍ನ ಅಗತ್ಯವಿರುತ್ತದೆ. ಎಲ್ಲಿಯಾದರೂ ಆಟೋಕೌಂಟರ್ ತಾನು ಕಾರ್ಯಗತಗೊಳಿಸಬಾರದುದನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಲು ಪ್ರಯತ್ನಿಸಿದರೆ, ಇದು ಒಂದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ದಾಳಿ ಎಂದು ಸೂಚಿಸಲ್ಪಡುತ್ತದೆ.
or: SELinux $SOURCE_PATH କୁ ଶକ୍ତିଶାଳୀ ଭୁଲନାମକରଣ ହୋଇଥିବା ଫାଇଲଗୁଡ଼ିକୁ $TARGET_PATH ନିଷ୍ପାଦନ କରିବା ପାଇଁ ବାରଣ କରିଥାଏ। ସ୍ୱୟଂସ୍ଥାପକ ବିନ୍ୟାସ ଫାଇଲଗୁଡ଼ିକୁ ନିଷ୍ପାଦନ କରିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରିପାରେ। ଯଦି $TARGET_PATH ଟି ଗୋଟିଏ ସ୍ୱୟଂସ୍ଥାପକ ନିଷ୍ପାଦନଯୋଗ୍ୟ ଫାଇଲ ହୋଇଥାଏ ତେବେ ଏହା bin_t ନାମକ ଫାଇଲ ଆବଶ୍ୟକ କରିଥାଏ। ଯଦି ସ୍ୱୟଂସ୍ଥାପକ କିଛି ନିଷ୍ପାଦନ କରିବା ପାଇଁ ଚେଷ୍ଟାକରୁଥାଏ ଯାହାକି କରିବା ଉଚିତ ନୁହଁ, ତେବେ ଏହା କୌଣସି ବିନାଅନୁମତିରେ ପ୍ରବେଶକୁ ସୂଚାଇଥାଏ।
te: SELinux అనునది $SOURCE_PATHను సామర్ద్యంగా తప్పులేబుల్ చేసిన దస్త్రములు $TARGET_PATH నిర్వర్తించుటనుండి తిరస్కరించబడింది. స్వయంచాలకమౌంటర్ ను ఆకృతీకరించిన దస్త్రములను నిర్వర్తించుటకు అమర్చవచ్చు. ఒకవేళ $TARGET_PATH అనునది ఒక స్వయంచాలక నిర్వర్తని దస్త్రము అయితే అది bin_t యొక్క దస్త్రములేబుల్ కలిగివుండాలి. ఒకవేళ స్వయంచాలకమౌంటర్ చేయకూడని దానిని నిర్వర్తించుటకు ప్రయత్నిస్తుంటే, అది అమర్యాద యత్నమును సూచిస్తుంది.
uk: SELinux заборонила $SOURCE_PATH виконувати потенційно неправильно розмічені файли $TARGET_PATH. Automounter може бути налаштований на виконання конфігураційних файлів, якщо $TARGET_PATH є виконуваним конфігураційним файлом automount, він повинен мати позначку bin_t. Якщо automounter намагається виконати щось, що він не повинен виконувати, це може означати спробу вторгнення.
zh_tw: SELinux 已拒絕 $SOURCE_PATH 執行潛在的 錯誤標記的檔案 $TARGET_PATH。您可設定 Automounter 來執行 設定檔，若 $TARGET_PATH 是個 automount 可執行的 設定檔的話，它需要有個 bin_t 的檔案標籤。 若 automounter 嘗試執行它所不該執行的檔案，這代表系統可能已遭到嘗試入侵的警訊。

source: If you want to change the file context of $TARGET_PATH so that the automounter can execute it you can execute "chcon -t bin_t $TARGET_PATH". If you want this to survive a relabel, you need to permanently change the file context: execute "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'".
as: যদি আপুনি $TARGET_PATH ৰ নথিপত্ৰ পৰিপ্ৰেক্ষতিত সলনি কৰিব বিচাৰে যাতে স্বমাউন্টাৰে ইয়াক এক্সিকিউট কৰিব পাৰে আপুনি "chcon -t bin_t $TARGET_PATH" এক্সিকিউট কৰিব পাৰিব। যদি আপুনি ইয়াক এটা পুনৰলেবেল পৰা বচাব বিচাৰিছে, আপুনি স্থায়ীভাৱে নথিপত্ৰ পৰিপ্ৰেক্ষতিত: execute "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'" সলনি কৰিব লাগিব।
es: Si quiere modificar el contexto de archivo de $TARGET_PATH para que el automontador pueda ejecutarlo, puede ejecutar "chcon -t bin_t $TARGET_PATH". Si quiere que esto continúe luego de re etiquetado, necesitará modificar permanentemente el contexto de archivo: ejecute "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'".
gu: જો તમે $TARGET_PATH નો ફાઈલ સંદર્ભ બદલવા માંગો કે જેથી ઓટોમાઉન્ટ કરનાર તેને ચલાવી શકે તો તમે "chcon -t bin_t.$TARGET_PATH" ચલાવી શકો. જો તમે આને પુનઃલેબલ સાથે જીવવા માંગતા હોય તો, તમારે ફાઈલ સંદર્ભ કાયમ માટે બદલવાની જરૂર પડશે: "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'" ને ચલાવો.
ja: $TARGET_PATH のファイルコンテキストを変更し、自動マウンタが実行できるようにするは、 "chcon -t bin_t $TARGET_PATH" を実行します。これが 最ラベルの後でも残るようにしたい場合、ファイルコンテキストを永久に変更する必要があります。 "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'" を実行します。
kn: ಸ್ವಯಂಆರೋಹಕ $TARGET_PATH ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವಂತೆ ಕಡತದ ಸನ್ನಿವೇಶವನ್ನು ನೀವು ಬದಲಾಯಿಸಬೇಕೆಂದರೆ "chcon -t bin_t $TARGET_PATH'" ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಬಹುದಾಗಿದೆ.ಇದನ್ನು ಒಂದು ಮರುಲೇಬಲ್ ನಂತರವೂ ಉಳಿಯುವಂತೆ ನೀವು ಬಯಸಿದರೆ, ಶಾಶ್ವತವಾಗಿ ಕಡತ ಸನ್ನಿವೇಶವನ್ನು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ: ಇದಕ್ಕಾಗಿ "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'"ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಿ.
or: ଯଦି ଆପଣ $TARGET_PATH ର ସଠିକ ଚାଳନ ଉପରେ ବିଶ୍ବାସ ରଖିଥିଲେ, ଆପଣ ଫାଇଲ ବିଷୟବସ୍ତୁକୁବଦଳାଇ ପାରିବେ। "chcon -t bin_t $TARGET_PATH"।ଆପଣଙ୍କୁ ସବୁଦିନ ପାଇଁ ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ହେବ: "semanage fcontext -a -t bin_t '$TARGET_PATH'" କୁ ନିଷ୍ପାଦନ କରନ୍ତୁ।
uk: Якщо ви бажаєте змінити контекст файла $TARGET_PATH з метою дозволу його виконання за допомогою automounter, використовуйте команду c«chcon -t bin_t $TARGET_PATH». Також треба змінити первинний контекст файлів, щоб зберегти його при повторній розмітці. «semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'»
zh_tw: 如果您想變更 $TARGET_PATH 的檔案情境來讓自動掛載器可以執行它，您可以執行「chcon -t bin_t $TARGET_PATH」。如果您想讓它在重新標記後仍可使用，您需要永久性更動檔案情境：執行「semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'」。

source: SELinux is preventing $SOURCE_PATH from binding to port $PORT_NUMBER.
as: SELinux এ $SOURCE_PATH ক পোৰ্ট $PORT_NUMBER লগত সংযোগ কৰাৰ পৰা প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a $SOURCE_PATH engancharse al puerto $PORT_NUMBER.
gu: SELinux એ $SOURCE_PATH ને પોર્ટ $PORT_NUMBER સાથે બાંધવાથી અટકાવી રહ્યું છે.
ja: SELinux は $SOURCE_PATH によるポート $PORT_NUMBER へのバインドを阻止しています。
kn: $SOURCE_PATH ಅನ್ನು ಸಂಪರ್ಕಸ್ಥಾನ $PORT_NUMBER ಕ್ಕೆ ಬೈಂಡ್ ಮಾಡದಂತೆ SELinux ತಡೆಯುತ್ತಿದೆ.
or: SELinux $SOURCE_PATH କୁ $PORT_NUMBER ସଂଯୋଗିକୀ ସହିତ ବାନ୍ଧିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH ను పోర్ట్‍ $PORT_NUMBER కు బందనం అగుటనుండి నిరోధిస్తుంది.
uk: SELinux запобігає співставленню $SOURCE_PATH порту $PORT_NUMBER.
zh_tw: SELinux 防止 $SOURCE_PATH 綁定至通訊埠 $PORT_NUMBER。

source: SELinux has denied the $SOURCE from binding to a network port $PORT_NUMBER which does not have an SELinux type associated with it. If $SOURCE should be allowed to listen on $PORT_NUMBER, use the <i>semanage</i> command to assign $PORT_NUMBER to a port type that $SOURCE_TYPE can bind to (%s). If $SOURCE is not supposed to bind to $PORT_NUMBER, this could signal an intrusion attempt.
as: SELinux এ $SOURCE ক এটা নেটৱাৰ্ক পোৰ্ট $PORT_NUMBER যাৰ সৈতে এটা SELinux ধৰণ সংযুক্ত নাই তাৰ সৈতে সংযোগ নাকচ কৰিছে। যদি $SOURCE ক $PORT_NUMBER শুনাৰ অনুমতি দিয়া হব লাগে, <i>semanage</i> কমান্ডক $PORT_NUMBER ক এটা পোৰ্ট ধৰণ যাৰ সৈতে $SOURCE_TYPE (%s) সংযোগ কৰিব পাৰিব ধাৰ্য্য কৰিবলে ব্যৱহাৰ কৰক। যদি $SOURCE এ $PORT_NUMBER ৰ সৈতে সংযোগ কৰাৰ কথা নহয় , ই এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে।
es: SELinux ha negado que $SOURCE se asocie al puerto de red $PORT_NUMBER que no tiene un tipo SELinux asociado a él. Si a $SOURCE debería permitírsele escuchar en $PORT_NUMBER, utilice el comando <i>semanage</i> para asignar $PORT_NUMBER a un tipo de puerto al que $SOURCE_TYPE pueda asociarse con (%s). Si $SOURCE no debería poder engancharse al puerto $PORT_NUMBER, esto podría ser señal de un intento de intrusión.
gu: SELinux એ નેટવર્ક પોર્ટ $PORT_NUMBER ને બાંધવાથી $SOURCE નામંજૂર થયેલ છે કે જે તેની સાથે સંકળાયેલ SELinux પ્રકાર નથી. જો $SOURCE એ $PORT_NUMBER પર સાંભળવા માટે પરવાનગી આપેલ હોવી જોઇએ તો, પોર્ટ પ્રકારમાં $PORT_NUMBER ને સોંપવા માટે <i>semanage</i> આદેશને વાપરો કે જે $SOURCE_TYPE (%s) માં બાંધી શકે છે. જો $SOURCE એ $PORT_NUMBER માં બાંધવું ન હોય તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શકે છે.
ja: $SOURCE が、ポートに関連付けられた SELinux タイプを持たないネットワークポート $PORT_NUMBER へのバインドすることを、SELinux は拒否しました。 $SOURCE の $PORT_NUMBER でのリッスンが許可されるべきである場合、 <i>semanage</i> コマンドを使用して $PORT_NUMBER を $SOURCE_TYPE が バインドできるポートタイプへ割り当てます (%s) 。 $SOURCE による $PORT_NUMBER へのバインドが想定されていない場合、 不正侵入の試行を示唆している可能性があります。
kn: $SOURCE ಅನ್ನು ಜಾಲಬಂಧ ಸಂಪರ್ಕಸ್ಥಾನ $PORT_NUMBER ಕ್ಕೆ ಬೈಂಡ್‌ ಆಗುವುದನ್ನು SELinux ನಿರ್ಬಂಧಿಸಿದೆ,ಆದರೆ ಇದಕ್ಕೆ ಹೊಂದಿಕೊಂಡಿರುವ ಒಂದು SELinux ಬಗೆ ಇಲ್ಲ. $PORT_NUMBER ಸಂಪರ್ಕಸ್ಥಾನಕ್ಕೆ ಆಲಿಸಲು $SOURCE ಗೆ ಅನುಮತಿಸಬೇಕೆಂದಿದ್ದರೆ, $PORT_NUMBER ಅನ್ನು $SOURCE_TYPE ಯು ಬೈಂಡ್ ಆಗುವಂತಹ ಒಂದು ಸಂಪರ್ಕಸ್ಥಾನದ ಬಗೆಗೆ ಸೇರಿಸಲು <i>semanage</i> ಆಜ್ಞೆಯನ್ನು ಬಳಸಬಹುದು (%s). ಎಲ್ಲಿಯಾದರೂ $SOURCE ಈ ಸಂಪರ್ಕಸ್ಥಾನಕ್ಕೆ ಬೈಂಡ್ ಆಗಬಾರದಂತಿದ್ದಲ್ಲಿ, ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲ್ಪಡುತ್ತದೆ.
or: SELinux $SOURCE କୁ ନେଟୱର୍କ ସଂଯୋଗିକୀରେ ବାନ୍ଧିବା ପାଇଁ ବାରଣ କରିଥାଏ $PORT_NUMBER ଯେଉଁଥିରେ SELinux ପ୍ରକାର ସନ୍ନିହିତ ନାହିଁ। ଯଦି $SOURCE ଟି $PORT_NUMBER ରେ ଶୁଣିବା ପାଇଁ ଅନୁମତି ପ୍ରାପ୍ତ ହୋଇଥାଏ,<i>semanage</i> ନିର୍ଦ୍ଦେଶକୁ ନ୍ୟସ୍ତ $PORT_NUMBER ରେ ବ୍ୟବହାର କରନ୍ତୁ ଯାହାକି $SOURCE_TYPE କୁ (%s) ରେ ବାନ୍ଧିରଖିଥାଏ। ଯଦି $SOURCE ଟି $PORT_NUMBER ସହିତ ବାନ୍ଧିରଖିନଥାଏ, ତେବେ ତାହା କୌଣସି ବିନାନୁମତି ପ୍ରବେଶ ପାଇଁ ଚେଷ୍ଟାକରିଥାଏ।
uk: SELinux заборонила $SOURCE приєднуватись до мережного порту $PORT_NUMBER, якому не заданий тип SELinux. Якщо $SOURCE повинен мати можливість підключатися до цього порту, можете використовувати команду <i>semanage</i> для додавання цього порту до типу, до якого $SOURCE_TYPE може підключатися (%s). Якщо $SOURCE не має прив'язуватись до цього порту, можливо має місце спроба вторгнення.
zh_tw: SELinux 已拒絕 $SOURCE 綁定至沒有 SELinux 類型關聯的 $PORT_NUMBER 網路連接埠。 如果應該允許 $SOURCE 聽取 $PORT_NUMBER，請使用 <i>semanage</i> 指令來指派 $PORT_NUMBER 為 $SOURCE_TYPE 可以綁定至的連接埠類型 (%s)。 如果 $SOURCE 不應該 綁定至 $PORT_NUMBER，這可能是有人企圖入侵的訊號。

source: If you want to allow $SOURCE to bind to port $PORT_NUMBER, you can execute # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER where PORT_TYPE is one of the following: %s. If this system is running as an NIS Client, turning on the allow_ypbind boolean may fix the problem. setsebool -P allow_ypbind=1.
as: যদি আপুনি $SOURCE ক পোৰ্ট $PORT_NUMBER লে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে, আপুনি # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER এক্সিকিউট কৰিব পাৰিব যত PORT_TYPE হল নিম্নলিখিতৰ এটা: %s. যদি এই চিস্টেম এটা NIS ক্লাএন্ট হিচাপে চলি আছে, allow_ypbind বুলিয়ানক অন কৰিলে সমস্যা ঠিক হব পাৰে। setsebool -P allow_ypbind=1।
es: Si quiere permitir que $SOURCE se asocie con el puerto $PORT_NUMBER, puede ejecutar # semanage port -a -t TIPO_DE_PUERTO -p %s $PORT_NUMBER donde TIPO_DE_PUERTO es uno de los siguientes: %s. Si este sistema se está ejecutando como un cliente NIS, activar el booleano allow_ypbind puede corregir este problema. setsebool -P allow_ypbind=1.
gu: જો પોર્ટ $PORT_NUMBER માં બાંધવા માટે $SOURCE ને પરવાનગી આપવા માટે તમે ઇચ્છતા હોય તો, તમે # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ચલાવી શકો છો જ્યાં PORT_TYPE નીચેનાં માંથી એક છે: %s. જો આ સિસ્ટમ NIS ક્લાઇન્ટ તરીકે ચાલી રહ્યુ છે, _ypbind બુલિયન ને ચાલુ કરવાથી સમસ્યા સુધારી શકાય છે. setsebool -P allow_ypbind=1.
ja: $SOURCE がポート $PORT_NUMBER にバインドできるようにしたい場合、以下コマンドを実行します。 # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ここで PORT_TYPE は下のいずれかです: %s. 使用システムが NIS クライアントとして稼働している場合、 allow_ypbind boolean をオンにすると問題を解決するかも知れません。setsebool -P allow_ypbind=1
kn: $SOURCE ಗೆ ಸಂಪರ್ಕಸ್ಥಾನ $PORT_NUMBER ಬೈಂಡ್ ಆಗಿರಬೇಕೆಂದು ನೀವು ಬಯಸಿದಲ್ಲಿ, # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ಅನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಬಹುದು ಇಲ್ಲಿ PORT_TYPE ಎನ್ನುವುದು ಈ ಕೆಳಗಿನವುಗಳಲ್ಲಿ ಒಂದಾಗಿರುತ್ತದೆ: %s. ಈ ಗಣಕವು ಒಂದು NIS ಕ್ಲೈಂಟ್ ಆಗಿ ಚಲಾಯಿತಗೊಳ್ಳುತ್ತಿದ್ದಲ್ಲಿ, allow_ypbind ಬೂಲಿಯನ್ ಅನ್ನು ಆನ್ ಮಾಡುವುದರಿಂದ, ಈ ತೊಂದರೆಯನ್ನು ಪರಿಹರಿಸಬಹುದಾಗಿದೆ. setsebool -P allow_ypbind=1.
or: ଯଦି ଆପଣ $SOURCE କୁ ସଂଯୋଗିକୀ $PORT_NUMBER ସହିତ ବାନ୍ଧିରଖିନଥାନ୍ତି, ତେବେ ଆପଣ ନିମ୍ନଲିଖିତକୁ ନିଷ୍ପାଦନ କରିପାରିବେ # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ଯେଉଁଠି PORT_TYPE ଟି ନିମ୍ନଲିଖିତ ମଧ୍ଯରୁ ଗୋଟିଏ: %s. ଯଦି ସେହି ତନ୍ତ୍ରଟି ଗୋଟିଏ NIS କ୍ଲାଏଣ୍ଟ ଭାବରେ ଚାଲୁଥାଏ, ତେବେallow_ypbind ବୁଲିଆନକୁ ଅନ କରିବା ଫଳରେ ସେହି ସମସ୍ୟାର ସମାଧାନ ହୋଇପାରିବ। setsebool -P allow_ypbind=1.
uk: Якщо треба дозволити $SOURCE прив'язуватись до порту $PORT_NUMBER, виконайте команду # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER де PORT_TYPE може приймати значення: %s. Якщо система виконує роль клієнта NIS, можна спробувати встановити логічне значення allow_ypbind: «setsebool -P allow_ypbind=1».
zh_tw: 如果您想允許 $SOURCE 綁定至連接埠 $PORT_NUMBER，您可以執行 # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER PORT_TYPE 為後述之一：%s。 如果此系統正以 NIS Client 執行，開啟 allow_ypbind 布林值可能修正這個問題。setsebool -P allow_ypbind=1。

source: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER where PORT_TYPE is one of the following: %s.
as: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER যত PORT_TYPE নিম্নলিখিতৰ এটা: %s।
es: # semanage port -a -t TIPO_DE_PUERTO -p %s $PORT_NUMBER</b> donde TIPO_DE_PUERTO es uno de los siguientes: %s.
gu: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER જ્યાં PORT_TYPE એ નીચેનામાંથી એક છે: %s.
ja: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ここで、PORT_TYPE は 以下の１つとなります: %s
kn: #semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ಇಲ್ಲಿ PORT_TYPE ಎನ್ನುವುದ ಈ ಕೆಳಗಿನವುಗಳಲ್ಲಿ ಒಂದಾಗಿರುತ್ತದೆ: %s.
or: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER ଯେଉଁଠି PORT_TYPE ଟି ନିମ୍ନଲିଖିତ ମଧ୍ଯରୁ ଗୋଟିଏ: %s.
uk: semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER де PORT_TYPE може приймати значення: %s.
zh_tw: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER PORT_TYPE 為後述之一：%s。

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access on $TARGET_PATH.
as: SELinux এ $TARGET_PATH ত $SOURCE_PATH "$ACCESS" অভিগম প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a $SOURCE_PATH el acceso "$ACCESS" sobre $TARGET_PATH.
gu: SELinux એ $SOURCE_PATH "$ACCESS" વપરાશને ઉપકરણ $TARGET_PATH પર અટકાવી રહ્યું છે.
ja: SELinux は $TARGET_PATH への $SOURCE_PATH による "$ACCESS" アクセスを阻止しています。
kn: ಸಾಧನ $TARGET_PATH ಗೆ $SOURCE_PATH "$ACCESS" ನ ನಿಲುಕಣೆಯನ್ನು SELinux ತಡೆದಿದೆ.
or: SELinux $SOURCE_PATH କୁ $TARGET_PATH ଉପକରଣରେ "$ACCESS" କରିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH "$ACCESS" వాడుక పరికరం $TARGET_PATHకు.
uk: SELinux забороняє $SOURCE_PATH доступ «$ACCESS» до пристрою $TARGET_PATH.
zh_tw: SELinux 防止 $SOURCE_PATH「$ACCESS」存取 $TARGET_PATH。

source: SELinux denied access requested by $SOURCE. The current boolean settings do not allow this access. If you have not setup $SOURCE to require this access this may signal an intrusion attempt. If you do intend this access you need to change the booleans on this system to allow the access.
as: SELinux এ $SOURCE দ্বাৰা অনুৰোধ কৰা অভিগম নাকচ কৰিলে। বৰ্তমান বুলিয়ান সংহতিসমূহে এই অভিগমৰ অনুমতি নিদিয়ে। যদি আপুনি $SOURCE ক এই অভিগমৰ প্ৰয়োজনৰ বাবে সংস্থাপন কৰা নাই ই এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে। যদি আপুনি এই অভিগম নিবিচাৰে আপুনি এই অভিগমৰ অনুমতি দিবলে এই চিস্টেমত বুলিয়ানসমূহ সলনি কৰিব লাগিব।
es: SELinux negó el acceso requerido por $SOURCE. El booleano actual no está permitiendo este acceso. Si no configuró a $SOURCE para que este acceso fuera necesario, puede ser indicio de un intento de ataque. Si realmente lo que quiere es este acceso, necesita cambiar los booleanos para permitirlo.
gu: SELinux એ $SOURCE દ્વારા અરજી કરાયેલ વપરાશ નામંજૂર કર્યો છે. તે ઈચ્છિત હતો નહિં કે આ વપરાશ $SOURCE દ્વારા જરૂરી છે અને આ વપરાશ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત કરી શકશે. એ પણ શક્ય છે કે ચોક્કસ આવૃત્તિ અથવા કાર્યક્રમનું રૂપરેખાંકન એ તેને વધારાના વપરાશની અરજી કરવા માટે કારણ આપી રહ્યું હોય.
ja: SELinux は $SOURCE により要求されたアクセスを拒否しました。 現在のブーリアン設定はこのアクセスを許可しません。このアクセスを 要求するように $SOURCE を設定していない場合、不正侵入の試行を示している 可能性があります。 アクセスの意志があれば、このシステム上でブーリアン値を 変更してアクセスを許可するようにしなければなりません。
kn: $SOURCE ನಿಂದ ಸಲ್ಲಿಸಲಾದ ಮನವಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ಈಗಿನ ಬೂಲಿಯನ್ ಸಿದ್ಧತೆಗಳು ಈ ಅನುಮತಿಯನ್ನು ಒಪ್ಪುವುದಿಲ್ಲ ನೀವು $SOURCE ಅನ್ನು ಈ ಅನುಮತಿಯನ್ನು ಕೇಳುವಂತೆ ಸಜ್ಜುಗೊಳಿಸದೆ ಹೋಗಿದ್ದಲ್ಲಿ ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲ್ಪಡುತ್ತದೆ ನೀವು ಈ ಅನುಮತಿಯನ್ನು ಬಯಸಿದ್ದಾಗಿದ್ದಲ್ಲಿ, ಈ ಅನುಮತಿಯನ್ನು ಅಂಗೀಕರಿಸುವಂತೆ ಈ ಗಣಕದಲ್ಲಿನ ಬೂಲಿಯನ್ ಅನ್ನು ನೀವು ಬದಲಾಯಿಸಬೇಕಾಗುತ್ತದೆ
or: SELinux $SOURCE ଦ୍ୱାରା ଅନୁରୋଧ କରାଯାଇଥିବା ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଥାଏ। ସାମ୍ପ୍ରତିକ ବୁଲିଆନ ବିନ୍ୟାସଗୁଡ଼ିକ ଏହି ଅଭିଗମ୍ୟତାକୁ ଅନୁମତି ଦେଇନଥାଏ। ଯଦି ଆପଣ $SOURCE କୁ ଏଥିରେ ଅଭିଗମ୍ୟ କରିବା ପାଇଁ ବିନ୍ୟାସ କରିନଥାନ୍ତି ତେବେ ଏହା ଗୋଟିଏ ବିନାଅନୁମତି ପ୍ରବେଶ ପ୍ରଚେଷ୍ଟାକୁ ସୂଚାଇଥାଏ। ଯଦି ଆପଣ ଏହି ଅଭିଗମ୍ୟତାକୁ ଆଶାକରୁଥାନ୍ତି ତେବେ ଆପଣଙ୍କୁ ସେହି ବୁଲିଆନଗୁଡ଼ିକୁ ଏହି ତନ୍ତ୍ରରେ ଅଭିଗମ୍ୟତା ପାଇଁ ପରିବର୍ତ୍ତନ କରିବା ଆବଶ୍ୟକ।
te: SELinux అనునది $SOURCE చేత అభ్యర్దించబడిన వాడుకను తిరస్కరించింది. ప్రస్తుత బూలియన్ అమరికలు ఈ వాడుకను అనుమతించదు. మీరు $SOURCE ను ఈ వాడుకను కలిగివుండుటకు అమర్చివుండకపోతే ఇది అమర్యాద యత్నమును సూచిస్తుంది. మీరు అనుకోకపోతే ఈ వాడుకను మీరు ఈ సిస్టమ్ నందలి బూలియన్స్‍‌ను మర్చవలసి వుంటుంది వాడుకను అనుమతించుటకు.
uk: SELinux відхилила запит на доступ від $SOURCE. Поточні параметри логічних змінних не дозволяють доступ. Такий запит не очікується від $SOURCE, що може свідчити про спробу вторгнення. Якщо ж ви дійсно хочете дозволити доступ, треба змінити відповідні логічні змінні.
zh_tw: SELinux 拒絕來自 $SOURCE 的存取請求。目前的布林值 設定並不允許此存取。若您並未將 $SOURCE 設為 需要此存取的話，這代表系統可能已遭到嘗試入侵的警訊。若您打算進行 此存取，您需要將此系統上的布林值更改為允許 此存取。
