Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: If you want to allow qemu to use serial/parallel communication ports
as: যদি আপুনি qemu ক ক্ৰমিক/সমান্তৰাল সংযোগ পোৰ্টসমূহ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitirle a qemu utilizar puertos de comunicación seriales/paralelos
gu: જો તમે ક્રમશ:/સમાંતર વાર્તાલાપ પોર્ટોને વાપરવા માટે qemu ને પરવાનગી આપવા માંગો છો
ja: qemu が、 シリアル/パラレル通信 port を使用することを、もし許可したい場合
kn: ಅನುಕ್ರಮಿತ/ಸಮಾನಾಂತರದ ಸಂಪರ್ಕಸ್ಥಾನಗಳನ್ನು ಬಳಸಲು ನೀವು qemu ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ qemu କୁ କ୍ରମିକ/ସମାନ୍ତରାଳ ଯୋଗାଯୋଗ ପୋର୍ଟଗୁଡ଼ିକୁ ବ୍ୟବହାର କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
uk: Якщо ви бажаєте дозволити qemu використовувати послідовні або паралельні порти обміну даними
zh_tw: 如果您想要允許 qemu 使用序列 / 平行連接埠

source: If you want to allow Apache to communicate with avahi service via dbus
as: যদি আপুনি Apache ক dbus ৰে avahi সেৱাৰ সৈতে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que Apache se comunique con el servicio avahi mediante dbus
gu: જો તમે dbus મારફતે avahi સેવા સાથે વાતચીત કરવા માટે Apache ને પરવાનગી આપવા માંગો છો
ja: Apache が、 avahi サービスと dbus 経由で通信することを、もし許可したい場合
kn: Apache ಯು dbus ಮೂಲಕ avahi ಯೊಂದಿಗೆ ವ್ಯವಹರಿಸುವಿಕೆಯನ್ನು ಅನುಮತಿಸಲು ನೀವು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ Apache କୁ dbus ମାଧ୍ଯମରେ avahi ସର୍ଭିସ ସହିତ ଯୋଗାଯୋଗ ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
te: dbus ద్వారా avahi సేవతో సంప్రదించుటకు మీరు అపాచీను అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити Apache здійснювати обмін даним зі службою avahi за допомогою dbus
zh_tw: 如果您想要允許 Apache 透過 dbus 與 avahi 服務通訊

source: If you want to allow all daemons to use tcp wrappers.
as: যদি আপুনি সকলো ডিমনক tcp ৰেপাৰসমূহ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে।

source: If you want to allow samba to share users home directories.
as: যদি আপুনি samba ক ব্যৱহাৰকাৰী ঘৰ ডাইৰেকটৰিসমূহ অংশীদাৰী কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que samba pueda compartir directorios personales del usuario.
gu: જો તમે વપરાશકર્તા ઘર ડિરેક્ટરીઓને વહેંચવા માટે samba ને પરવાનગી આપવા માંગો છો.
ja: samba が、ユーザのホームディレクトリを共有することを、もし許可したい場合。
kn: ಬಳಕೆದಾರರ ನೆಲೆ ಕೋಶಗಳನ್ನು samba ವು ಹಂಚಿಕೊಳ್ಳಲು ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ ଚାଳକର ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ସହଭାଗ କରିବା ପାଇଁ samba କୁ ଅନୁମତି ଦିଅନ୍ତି।
te: వాడుకరుల నివాస సంచయాలను samba భాగస్వామ్యపరచుకొనుటకు మీరు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити samba надавати у спільне використання домашні каталоги користувачів
zh_tw: 如果您想要允許 samba 共享使用者的家目錄。

source: If you want to enable reading of urandom for all domains.
as: যদি আপুনি সকলো ডমেইনৰ বাবে urandom পঢ়াটো সামৰ্থবান কৰিব বিচাৰে।
es: Si quiere habilitar la lectura de urandom para todos los dominios.
gu: જો તમે બધા ડોમેઇનો માટે urandom ને વાંચવાનું સક્રિય કરવા માંગો છો.
ja: 全てのドメインで urandom を可読にすることを、もし許可したい場合。
kn: ಎಲ್ಲಾ ಡೊಮೈನ್‌ಗಳಿಗಾಗಿ urandom ಅನ್ನು ಓದುವುದನ್ನು ಶಕ್ತಗೊಳಿಸಲು ನೀವು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ urandom ର ପଠନକୁ ସମସ୍ତ ଡେମନ ପାଇଁ ସକ୍ରିୟ କରିବାକୁ ଚାହାନ୍ତି।
te: అన్ని డొమైన్ల కొరకు urandom చదువుటను చేతనపరచవలెనని కోరితే.
uk: Якщо ви бажаєте надати доступ до читання urandom для всіх доменів
zh_tw: 如果您想要允許讀取所有網域的 urandom。

source: If you want to allow racoon to read shadow
as: যদি আপুনি racoon ক ছায়া পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que racoon pueda leer sobre shadow
gu: જો તમે શૅડોને વાંચવા માટે racoon ને પરવાનગી આપવા માંગો છો
ja: racoon が、 shadow を読むことを、もし許可したい場合
kn: ಛಾಯೆಯನ್ನು racoon ಓದಲು ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ racoon କୁ shadow ପଢ଼ିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
te: షాడోను చదువుటకు మీరు racoon అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ racoon до читання файла shadow
zh_tw: 如果您想要允許 racoon 讀取 shadow

source: If you want to allow Cobbler to connect to the network using TCP.
as: যদি আপুনি Cobbler ক TCP ব্যৱহাৰ কৰি নেটৱাৰ্কলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que Cobbler se conecte a la red utilizando TCP.
gu: જો તમે TCP ની મદદથી નેટવર્ક સાથે જોડાવા માટે Cobbler ને પરવાનગી આપવા માંગો છો.
ja: Cobbler が、 TCPを使ってネットワークに接続することを、もし許可したい場合。
kn: TCP ಅನ್ನು ಬಳಸಿಕೊಂಡು Cobbler ಜಾಲಬಂಧದೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ Cobbler କୁ TCP ବ୍ୟବହାର କରି ନେଟୱର୍କ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: TCP వుపయోగించి నెట్వర్కుకు అనుసంధానమగుటకు కోబ్లర్‌ను మీరు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити Cobbler встановлювати з’єднання з мережею за допомогою TCP.
zh_tw: 如果您想要允許 Cobbler 透過 TCP 連接網路。

source: If you want to allow squid to run as a transparent proxy (TPROXY)
as: যদি আপুনি squid ক এটা পাৰদৰ্শী প্ৰক্সি (TPROXY) হিচাপে চলাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que squid se ejecute como un proxy transparente (TPROXY)
gu: જો તમે પારદર્શક પ્રોક્સી (TPROXY) તરીકે ચલાવવા માટે squid ને પરવાનગી આપવા માંગો છો
ja: squid が、 transparent プロキシ (TPROXY) として動作することを、もし許可したい場合
kn: squid ಅನ್ನು ಪಾರದರ್ಶಕ ಪ್ರಾಕ್ಸಿ (TPROXY) ಆಗಿ ಚಲಾಯಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ squid କୁ ସ୍ୱଚ୍ଛ ପ୍ରକ୍ସି ଭାବରେ ଚଲାଇବାକୁ ଚାହୁଁଛନ୍ତି (TPROXY)
te: పారదర్శక ప్రోక్సీ (TPROXY) వలె squid నడుచుటకు మీరు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити запуск squid у режимі прозорого проксі-сервера (TPROXY)
zh_tw: 如果您想要允許 squid 以通透型代理伺服器方式（TPROXY）運行

source: If you want to prevent all confined domains from loading policy, setting enforcing mode, and changing boolean values. Set this to true and you have to reboot to set it back
as: যদি আপুনি সকলো গোপণ ডমেইনক নীতি, সংহতি বলৱৎকৰণ অৱস্থা, আৰু বুলিয়ান মানসমূহ পৰিৱৰ্তন কৰাৰ পৰা প্ৰতিৰোধ কৰিব বিচাৰে। ইয়াক true লে সংহতি কৰক আৰু ইয়াৰ পুনৰ সংহতি কৰিবলে আপুনিপুনৰাম্ভ কৰিব লাগিব
es: Si desea evitar que todos los servicios confinados puedan cargar políticas, definir modo obligatorio y modificar valores de los booleanos. Defina esto con el valor 'true' y deberá reiniciar el equipo para restaurar su configuración previa.
gu: જો તમે લોડિંગ પોલિસીમાંથી બધા મર્યાદિત ડોમેઇનને અટકાવવા માંગો છો, enforcing સ્થિતિને સુયોજિત કરી રહ્યા છો, અને બુલિયન કિંમતોને બદલી રહ્યા છે. true તરીકે આને સુયોજિત કરો અને તેને પાછુ સુયોજિત કરવા માટે તમારે રિબુટ કરવુ જ પડશે
ja: 全ての特定のドメインが、ポリシーをロードしたり、強制モードに設定したり、 boolean 値を変更することを、もし避けたい場合。これを true に設定すると、戻すには再起動が必要です。
kn: ಎಲ್ಲಾ ನಿರ್ಬಂಧಿತವಲ್ಲದ ಡೊಮೈನ್‌ಗಳು ಪಾಲಿಸಿಯನ್ನು ಲೋಡ್ ಮಾಡುವುದು, ಒತ್ತಾಯಪೂರ್ವಕ ಕ್ರಮಕ್ಕೆ ಹೊಂದಿಸುವುದು, ಹಾಗು ಬೂಲಿಯನ್ ಮೌಲ್ಯಗಳನ್ನು ಬದಲಾಯಿಸುವುದನ್ನು ತಡೆಯಲು ಬಯಸುವಿರಾದರೆ. ಇದನ್ನು true ಗೆ ಬದಲಾಯಿಸಿ ಹಾಗು ಇದನ್ನು ಇದರ ಹಿಂದಿನ ಸ್ಥಿತಿಗೆ ಮರಳಲು ಗಣಕವನ್ನು ಮರಳಿ ಬೂಟ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ
or: ଯଦି ଆପଣ ସମସ୍ତ ବନ୍ଧିତ ଡମେନଗୁଡ଼ିକୁ ଧାରଣ ନିୟମାବଳୀରୁ ବାରଣ କରିବା ପାଇଁ ଚାହାନ୍ତି, ତେବେ enforcing ଧାରାକୁ ସେଟ କରନ୍ତୁ, ଏବଂ ବୁଲିଆନ ମୂଲ୍ୟକୁ ପରିବର୍ତ୍ତନ କରନ୍ତୁ। ଏହାକୁ true ଭାବରେ ସେଟ କରନ୍ତୁ ଏବଂ ଏହାକୁ ଫେରିପାଇବା ପାଇଁ ଆପଣଙ୍କୁ ପୁନଃଚାଳନ କରିବାକୁ ହେବ
te: లోడింగ్ పాలసీనుండి, బలవంతపురీతికి అమర్చుటనుండి, మరియు బూలియన్ విలువలను మార్చుటనుండి మీరు అన్ని లోబడిన డొమైన్లను నిరోధించగోరితే. దీనిని trueకు అమర్చుము మరియు మీరు దానిని వెనుకకు అమర్చుటకు పునఃప్రారంభించవలసి వుంటుంది
uk: Якщо ви бажаєте заборонити всім обмеженим доменам завантаження правил, встановлення примусового режиму та зміну логічних значень. Встановіть значення true. Для повернення попереднього значення систему доведеться перезавантажити
zh_tw: 如果您想要避免所有已受限的網域載入政策、設定強制模式、以及改變布林值。 將這設為真，您必須重新開機再重設之

source: If you want to allow unconfined executables to make their heap memory executable. Doing this is a really bad idea. Probably indicates a badly coded executable, but could indicate an attack. This executable should be reported in bugzilla
as: যদি আপুনি উন্মুক্ত এক্সিকিউটেবুল সমূহক সিহতৰ হিপ মেমৰি প্ৰেৰণ কৰা পৰাৰ অনুমতি দিব বিচাৰে। এনে কৰাটো এটা অত্যন্ত বেয়া পৰিকল্পনা। সম্ভবত এটা বেয়া ধৰণে ক'ড কৰা এক্সিকিউটেবুল বুজায়, কিন্তু এটা আক্ৰমণৰ ইংগিত দিব পাৰে। এই এক্সিকিউটেবুলক bugzilla ত সংবাদিত কৰিব লাগিব
es: Si desea permitir que ejecutables no confinados conviertan a su porción de memoria ejecutable. Hacer esto realmente es una mala idea. Probablemente indique un ejecutable mal codificado, pero también podría indicar que está siendo víctima de un ataque. Este ejecutable debería ser reportado en bugzilla
gu: જો તમે તેની હીપ મેમરી એક્સક્યૂટેબલ બનાવવા માટે બંધનમુક્ત એક્સક્યૂટેબલને પરવાનગી આપવા માંગો તો. આવુ કરવાનું ખરેખર ખોટો વિચાર છે. કદાચ તે ખોટી રીતે કોડ થયેલ એક્સક્યૂટેબલ છે તે નક્કી થાય છે, પરંતુ હુમલો થઇ શકવાનું નક્કી થાય છે. આ એક્સક્યૂટેબલ એ બગઝીલામાં અહેવાલ કરવો જોઇએ
ja: 不特定の実行ファイルが、その heap メモリを実行可能にすることを、もし許可したい場合。これは悪い設定です。もし悪意をもって実行にコーディングされている場合、攻撃を起こすかもしれません。この実行ファイルは bugzilla に報告するべきです。
kn: ನಿರ್ಬಂಧಿತವಲ್ಲದ ಎಗ್ಸಿಗ್ಯೂಟೆಬಲ್‌ಗಳು ತಮ್ಮ ಬೃಹತ್ ಮೆಮೊರಿ ಅನ್ನು ಎಗ್ಸಿಗ್ಯೂಟೆಬಲ್‌ ಆಗಿ ಮಾಡಲು ಅನುಮತಿಸುತ್ತೀರಾದರೆ. ಹೀಗೆ ಮಾಡುವುದು ನಿಜಕ್ಕೂ ಒಳ್ಳೆಯದಲ್ಲ. ಬಹುಷಃ ಇದು ತಪ್ಪಾಗಿ ಕೋಡ್ ಮಾಡಲಾದ ಎಗ್ಸಿಗ್ಯೂಟೆಬಲ್ ಆಗಿರಬಹುದು, ಆದರೆ ಒಂದು ದಾಳಿಯನ್ನೂ ಸಹ ಸೂಚಿಸಬಹುದು. ಈ ಎಕ್ಸಿಗ್ಯೂಟೆಬಲ್ ಅನ್ನು ಬಗ್‌ಝಿಲ್ಲಾದಲ್ಲಿ ವರದಿ ಮಾಡಬೇಕು
or: ଯଦି ଆପଣ ଅବନ୍ଧିତ ହିପ ସ୍ମୃତିସ୍ଥାନ ନିଷ୍ପାଦନଗୁଡ଼ିକୁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି। ଏହା କରିବା ଖରାପ ଅଟେ। ସମ୍ଭବତଃ ଏହା ଭୁଲ ଭାବରେ ଲିଖିତ ନିଷ୍ପାଦନକୁ ସୂଚାଇଥାଏ, କିନ୍ତୁ କୌଣସି ଆକ୍ରମଣକୁ ସୂଚାଇଥାଏ। ଏହି ନିଷ୍ପାଦନଗୁଡ଼ିକୁ bugzilla ରେ ଖବର କରାଯାଇଥାଏ
te: లోబడని యెగ్జిక్యూటబుల్సును మీరు వాటి హీప్ మెమొరీను యెగ్జిక్యూటబుల్ చేయుటకు అనుమతించవలెనని కోరుకుంటే. అలా చేయుట నిజంగా చెడ్డ ఆలోచన. బహుశా సరిగా కోడ్ చేయని యెగ్జిక్యూటబుల్ సూచించవచ్చును, అయితే దాడిని సూచించగలదు. ఈ యెగ్జిక్యూటబుల్ బగ్‌జిల్లానందు నివేదించవలెను
uk: Якщо ви бажаєте дозволити виконуваним файлам без обмежень робити області власної резервної пам’яті виконуваними. Використання цієї можливості є дуже небезпечним. Потреба у ньому свідчить про помилки у коді програми, але може також бути ознакою нападу на систему. Про цей виконуваний файл слід повідомити у системі стеження за вадами
zh_tw: 如果您想要允許未受限的執行檔使其堆積記憶體成為可執行模式。 這樣做並不是好主意。這可能表示執行檔撰寫不良，但也可能表示是攻擊行為。這個可執行檔應該回報至 bugzilla

source: If you want to allow dbadm to manage files in users home directories
as: যদি আপুনি dbadm ক ব্যৱহাৰকাৰী ঘৰ ডাইৰেকটৰিসমূহত নথিপত্ৰসমূহ ব্যৱস্থাপনা কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que dbadm administre archivos en los directorios personales de los usuarios.
gu: જો તમે વપરાશકર્તા ઘર ડિરેક્ટરીઓમાં ફાઇલોને સંચાલિત કરવા માટે dbadm ને પરવાનગી આપવા માંગો છો
ja: dbadm が、ユーザのホームディレクトリを管理することを、もし許可したい場合
kn: ಬಳಕೆದಾರರ ನೆಲೆ ಕೋಶಗಳಲ್ಲಿನ ಕಡತಗಳನ್ನು ನಿರ್ವಹಿಸಲು dbadm ಗೆ ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ଚାଳକର ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକରେ ଫାଇଲ ପରିଚାଳନା କରିବା ପାଇଁ dbadm କୁ ଅନୁମତି ଦିଅନ୍ତି
te: మీరు dbadmను వాడుకరుల నివాస సంచయములనందు ఫైళ్ళను నిర్వహించుటకు అనుమతించవలెనంటే
uk: Якщо ви бажаєте надати dbadm доступ до керування файлами у домашніх каталогах користувачів
zh_tw: 如果您想要允許 dbadm 管理使用者家目錄的檔案

source: If you want to allow confined virtual guests to interact with the xserver
as: যদি আপুনি গোপণ ভাৰছুৱেল অতিথিসমূহক xserver ৰ সৈতে ভাৱবিনিময় কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que los huéspedes virtuales confinados interactúen con el servidor x
gu: જો તમે xserver સાથે સંપર્ક કરવા માટે મર્યાદિત વર્ચ્યુઅલ મહેમાનોને પરવાનગી આપવા માંગો છો
ja: 特定の仮想ゲストが、 xserver と交信することを、もし許可したい場合
kn: xserver ನೊಂದಿಗೆ ವ್ಯವಹರಿಸಲು ನೀವು ನಿರ್ಬಂಧಿತ ವರ್ಚುವಲ್ ಅತಿಥಿಗಳಿಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ବନ୍ଧିତ ଆଭାସୀ ଅତିଥିମାନଙ୍କୁ xserver ସର୍ଭର ସହିତ ପାରସ୍ପରିକ କାର୍ଯ୍ୟ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు లోబడిన వర్చ్యువల్ గెస్టులను xserverతో సంప్రదించుటకు అనుమతించవలెనని కోరుకుంటే
uk: Якщо ви бажаєте дозволити обмеженим віртуальним гостьовим системам взаємодіяти з графічним сервером
zh_tw: 如果您想要允許受限的虛擬客座端與 xserver 互動

source: If you want to allow Git daemon system to access nfs file systems.
as: যদি আপুনি Git ডিমন চিস্টেমক nfs নথিপত্ৰ প্ৰণালীসমূহ অভিগম কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el demonio del sistema Git acceda a sistemas de archivos nfs.
gu: જો તમે nfs ફાઇલ સિસ્ટમોને પ્રવેશવા માટે Git ડિમન સિસ્ટમને પરવાનગી આપવા માંગો છો.
ja: Git デーモンシステムが、 nfs ファイルシステムにアクセスすることを、もし許可したい場合
kn: nfs ಕಡತ ವ್ಯವಸ್ಥೆಗಳಿಗೆ ನಿಲುಕಿಸಿಕೊಳ್ಳುವಂತೆ ನೀವು Git ಡೀಮನ್ ವ್ಯವಸ್ಥೆಯನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଆପଣ Git ଡେମନ ତନ୍ତ୍ରକୁ nfs ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ଅଭିଗମ୍ୟତା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు Git డెమోన్ సిస్టమ్‌ను nfs ఫైల్ సిస్టమ్ యాక్సెస్ చేయుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ системі фонової служби Git до файлових систем nfs
zh_tw: 如果您想要允許 Git daemon 系統存取 nfs 檔案系統。

source: If you want to unify HTTPD handling of all content files.
as: যদি আপুনি সকলো বিষয়বস্তু নথিপত্ৰসমূহৰ HTTPD ব্যৱস্থাপনা সংযুক্ত কৰিব বিচাৰে।
es: Si desea unificar de modo que todos los archivos de contenidos sean manipulados por HTTPD.
gu: જો તમે બધી સમાવિષ્ટ ફાઇલોનું HTTPD સંભાળવાને એકરૂપ કરવા માંગો છો.
ja: HTTPD の全てのコンテンツファイル管理を、もし集約したい場合
kn: HTTPD ಎಲ್ಲಾ ವಿಷಯಗಳನ್ನು ನಿಭಾಯಿಸುವಿಕೆಯನ್ನು ಒಗ್ಗೂಡಿಸಲು ನೀವು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ ସମସ୍ତ ବିଷୟବସ୍ତୁ ଫାଇଲଗୁଡ଼ିକର HTTPD ନିୟନ୍ତ୍ରଣକୁ ଏକତ୍ର କରିବାକୁ ଚାହାନ୍ତି।
te: అన్ని సారపు ఫైళ్ళ యొక్క HTTPD హాండ్లింగ్‌ను యేకీకరించగోరితే.
uk: Якщо ви бажаєте уніфікувати обробку HTTPD всіх файлів даних.
zh_tw: 如果您想要統一所有內容檔案的 HTTPD 處理方式。

source: If you want to allow nsplugin code to connect to unreserved ports
as: যদি আপুনি nsplugin ক'ডক অসংৰক্ষিত পোৰ্টসমূহলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que código nsplugin pueda conectarse con puertos no reservados
gu: જો તમે અનારક્ષિત પોર્ટો સાથે જોડાવા માટે nsplugin કોડને પરવાનગી આપવા માંગો છો
ja: nsplugin コードが、 予約されていない port に接続することを、もし許可したい場合
kn: nsplugin ಸಂಕೇತವು ಕಾದಿರಿಸದೆ ಇರುವ ಸಂಪರ್ಕಸ್ಥಾನದೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ
or: ଯଦି ଆପଣ nsplugin ସଙ୍କେତକୁ ଅସଂରକ୍ଷିତ ପୋର୍ଟଗୁଡ଼ିକ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు nsplugin కోడ్‌ను రిజర్వుకాని పోర్టులకు అనుసంధారించగోరితే
uk: Якщо ви бажаєте надати доступ коду nsplugin встановлювати з’єднання з незарезервованими портами
zh_tw: 如果您想要允許 nsplugin 程式碼連接未保留的連接埠

source: If you want to allow rsync to modify public files used for public file transfer services. Files/Directories must be labeled public_content_rw_t.
as: যদি আপুনি rsync ক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত ৰাজহুৱা নথিপত্ৰসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে। নথিপত্ৰসমূহ/ডাইৰেকটৰিসমূহ public_content_rw_t লেবেল কৰা থাকিব লাগিব।
es: Si desea permitir que rsync modifique archivos públicos utilizados por servicios de transferencia de archivos públicos. Los archivos o los directorios deben ser etiquetados como public_content_rw_t.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરેલ સાર્વજનિક ફાઇલને બદલવા માટે rsync ને પરવાનગી આપવા માંગો છો. ફાઇલો/ડિરેક્ટરીઓ લેબલ public_content_rw_t થયેલ હોવી જ જોઇએ.
ja: rsync が、 共有ファイルを編集し、共通ファイル転送サービスを使用することを、もし許可したい場合。ファイルやディレクトリは、 public_contnt_rw_t にラベルされていなければいけません。
kn: rsync ವು ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಮಾರ್ಪಡಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ. ಕಡತಗಳು/ಕೋಶಗಳನ್ನು public_content_rw_t ಎಂದು ಲೇಬಲ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ.
or: ଯଦି ଆପଣ rsync କୁ ସର୍ବସାଧାରଣ ଫାଇଲ ସ୍ଥାନାନ୍ତରଣ ସର୍ଭିସଗୁଡ଼ିକରେ ବ୍ୟବହୃତ ଫାଇଲଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି। ତେବେ ଫାଇଲ/ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକ ନିଶ୍ଚିତ ଭାବରେ public_content_rw_t ରେ ନାମକରଣ ହୋଇଥିବ।
te: పబ్లిక్ ఫైల్ బదిలీకరణ సేవలకు వుపయోగించు పబ్లిక్ ఫైళ్ళను సవరించుటకు మీరు rsyncను అనుమతించగోరితే. ఫైళ్ళు/డైరెక్టరీలు తప్పక public_content_rw_t గా లేబుల్ చేయబడివుండాలి.
uk: Якщо ви бажаєте надати доступ rsync до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами. Файли і каталоги має бути позначено міткою public_content_rw_t.
zh_tw: 如果您想要允許 rsync 修改用以公開檔案傳輸服務的公開檔案。 檔案 / 目錄必須標示為 public_content_rw_t。

source: If you want to allow qemu to use nfs file systems
as: যদি আপুনি qemu ক nfs নথিপত্ৰ প্ৰণালীসমূহ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir a qemu que utilice sistemas de arvhiso nfs.
gu: જો તમે nfs ફાઇલ સિસ્ટમોને વાપરવા માટે qemu ને પરવાનગી આપવા માંગો છો
ja: qemu が、 nfs ファイルシステムを使用することを、もし許可したい場合
kn: nfs ಕಡತ ವ್ಯವಸ್ಥೆಗಳು ಬಳಸುವಂತೆ ನೀವು qemu ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ qemu କୁ nfs ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు qemuను nfs ఫైల్ సిస్టమ్సు వుపయోగించుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити qemu використовувати файлові системи nfs
zh_tw: 如果您想要允許 qumu 使用 nfs 檔案系統

source: If you want to allow HTTPD scripts and modules to connect to the network using any TCP port.
as: যদি আপুনি HTTPD লিপিসমূহ আৰু মডিউলসমূহক যিকোনো TCP পোৰ্ট ব্যৱহাৰ কৰি নেটৱাৰ্কলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que scripts y módulos HTTPD se conecten a la red utilizando cualquier puerto TCP.
gu: જો તમે કોઇપણ TCP પોર્ટની મદદથી નેટવર્ક સાથે જોડાવા માટે HTTPD સ્ક્રિપ્ટો અને મોડ્યુલોને પરવાનગી આપવા માંગો છો.
ja: HTTPD スクリプトとモジュールが、 全ての TCP port を使用してネットワークに接続することを、もし許可したい場合。
kn: ಯಾವುದೆ TCP ಸಂಪರ್ಕಸ್ಥಾನಗಳನ್ನು ಬಳಸಿಕೊಂಡು HTTPD ಸ್ಕ್ರಿಪ್ಟುಗಳು ಹಾಗು ಘಟಕಗಳು ಜಾಲಬಂಧದೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ HTTPD ସ୍କ୍ରିପ୍ଟ ଏବଂ ଏକକାଂଶଗୁଡ଼ିକୁ TCP ବ୍ୟବହାର କରି ନେଟୱର୍କ ସହିତ ସଂଯୁକ୍ତ ହେବା ପାଇଁ ଅନୁମତି ଦେଇଥାଏ।
te: ఏ TCP పోర్టునైనా వుపయోగించి HTTPD స్క్రిప్ట్సు మరియు మాడ్యూళ్ళను నెట్వర్కు అనుసంధానమునకు మీరు అనుమతించ గోరితే.
uk: Якщо ви бажаєте надати доступ скриптам і модулям HTTPD на встановлення з’єднання з мережею за допомогою довільного порту TCP.
zh_tw: 如果您想要允許 HTTPD script 與模組透過 TCP 連接埠連接至網路。

source: If you want to allow qemu to use usb devices
as: যদি আপুনি qemu ক usb যন্ত্ৰসমূহ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que qemu utilice dispositivos usb
gu: જો તમે usb ઉપકરણોને વાપરવા માટે qemu ને પરવાનગી આપવા માંગો છો
ja: qemu が、 usb デバイスを使用することを、もし許可したい場合
kn: usb ಸಾಧನಗಳಿಗೆ ಬಳಸುವಂತೆ ನೀವು qemu ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ qemu କୁ usb ଉପକରଣଗୁଡ଼ିକୁ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు qemu ను usb పరికరములను వుపయోగించుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити qemu використовувати пристрої usb
zh_tw: 如果您想要允許 qemu 使用 USB 裝置

source: If you want to allow exim to connect to databases (PostgreSQL, MySQL)
as: যদি আপুনি exim ক ডাটাবেইচসমূহলে (PostgreSQL, MySQL) সংযোগ কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow varnishd to connect to all ports, not just HTTP.
as: যদি আপুনি varnishd ক HTTP ৰ বাহিৰেও অন্য পোৰ্টসমূহলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que varnishd se conecte con todos los puertos, no solo con HTTP.
gu: જો તમે બધા પોર્ટો સાથે જોડાવા માટે varnishd ને પરવાનગી આપવા માંગો છો, HTTP ફક્ત નહિં.
ja: varnishd が、 HTTP だけでなく、全てのポートに接続することを、もし許可したい場合。
kn: varnishd ಕೇವಲ HTTP ಸಂಪರ್ಕಸ್ಥಾನಗಳಲ್ಲದೆ ಎಲ್ಲಾ ಸಂಪರ್ಕಸ್ಥಾನಗಳಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ varnishd କୁ କେବଳ HTTP ବ୍ୟତୀତ ବାକି ସମସ୍ତ ପୋର୍ଟଗୁଡ଼ିକ ସହିତ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు varnishd ను HTTP కేకాక, అన్ని పోర్టులకు అనుసంధానమగుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити varnishd встановлювати з’єднання на всіх портах, а не лише на портах HTTP.
zh_tw: 如果您想要允許 varnishd 連接所有連接埠，而不僅是 HTTP。

source: If you want to allow mplayer executable stack
as: যদি আপুনি mplayer এক্সিকিউটেবুল স্টেকৰ অনুমতি দিব বিচাৰে
es: Si desea permitir porciones ejecutables de mplayer
gu: જો તમે mplayer એક્સિક્યૂટેબલ સ્ટેકને પરવાનગી આપવા માંગો છો
ja: mplayer に、 実行可能なスタックを、もし許可したい場合
kn: mplayer ಕಾರ್ಯಗತಗೊಳಿಸುವ ಸ್ಟ್ಯಾಕ್ ಅನ್ನು ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ mplayer ନିଷ୍ପାଦନଯୋଗ୍ୟ କାର୍ଯ୍ୟକୁ ଅନୁମତି ଦେବା ପାଇଁ ଛାହୁଁଛନ୍ତି
te: మీరు mplayer యెగ్జిక్యూటబుల్ స్టాక్‌ను అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити стос виконання mplayer
zh_tw: 如果您想要允許 mplayer 可執行堆疊

source: If you want to allow httpd scripts and modules execmem/execstack
as: যদি আপুনি httpd লিপিসমূহ আৰু execmem/execstack মডিউলসমূহৰ অনুমতি দিব বিচাৰে
es: Si desea permitir módulos execmem/execstack o scripts httpd
gu: જો તમે httpd સ્ક્રિપ્ટો અને મોડ્યુલો execmem/execstack ને પરવાનગી આપવા માંગતા હોય તો
ja: httpd スクリプトとモジュールに、 execmem/execstack を、もし許可したい場合
kn: httpd ಸ್ಕ್ರಿಪ್ಟುಗಳ ಹಾಗು ಘಟಕಗಳ execmem/execstack ಮಾಡಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ
or: ଯଦି ଆପଣ httpd ସ୍କ୍ରିପ୍ଟ ଏବଂ execmem/execstack ଏକକାଂଶଗୁଡ଼ିକୁ ଅନୁମତି ଦେବାପାଇଁ ଚାହାନ୍ତି
te: మీరు httpd స్క్రిప్ట్సు మరియు మాడ్యూళ్ళు execmem/execstack ను అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ скриптам і модулям httpd до execmem/execstack
zh_tw: 如果您想要允許 httpd script 與模組 execmem/execstack

source: If you want to allow all daemons to write corefiles to /
as: যদি আপুন৯ি সকলো ডিমনক কেন্দ্ৰীয়নথিপত্ৰসমূহ / লে লিখাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que todos los demonios puedan modificar o agregar archivos principales en /
gu: જો તમે / માં કૉરફાઇલોને લખવા માટે બધા ડિમનને પરવાનગી આપવા માંગો તો
ja: 全てのデーモンが、 / に corefile を書き込むことを、もし許可したい場合
kn: ಎಲ್ಲಾ ಡೆಮನ್‌ಗಳು ಕೋರ್ ಕಡತಗಳನ್ನು / ಗೆ ಬರೆಯಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ
or: ଯଦି ଆପଣ ସମସ୍ତ ଡେମନମାନଙ୍କୁ / ରେ ମୂଖ୍ୟ ଫାଇଲଗୁଡ଼ିକୁ ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు అన్ని డెమోన్సును కోర్‌ఫైళ్ళనుండి / కు వ్రాయుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити всім службам здійснювати запис до /
zh_tw: 如果您想要允許所有 daemon 將 corefiles 寫入 /

source: If you want to allow httpd to connect to the ldap port
as: যদি আপুনি httpd ক ldap পোৰ্টলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow confined virtual guests to manage device configuration, (pci)
as: যদি আপুনি গোপন ভাৰছুৱল অতিথিসমূহক যন্ত্ৰ সংৰূপ ব্যৱস্থাপনা কৰাৰ অনুমতি দিব বিচাৰে, (pci)
es: Si desea permitir que huéspedes virtuales confinados sean capaces de administrar configuración de dispositivos, (pci)
gu: જો તમે ઉપકરણ રૂપરેખાંકનને સંચાલિત કરવા માટે મર્યાદિત વર્ચ્યુઅલ મહેમાનોને પરવાનગી આપવા માંગો છો, (pci)
ja: 特定の仮想ゲストが、 pci などデバイス設定を管理することを、もし許可したい場合
kn: ಸಾಧನ ಸಂರಚನೆ, (pci) ಅನ್ನು ನಿರ್ವಹಿಸಲು ನೀವು ನಿರ್ಬಂಧಿತ ವರ್ಚುವಲ್ ಅತಿಥಿಗಳಿಗೆ ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ବନ୍ଧିତ ଆଭାସୀ ଅତିଥିମାନଙ୍କୁ ଉପକରଣ ବିନ୍ୟାସ ଫାଇଲଗୁଡ଼ିକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି, (pci)
uk: Якщо ви бажаєте дозволити обмеженим віртуальним гостьовим системам керувати налаштуванням пристроїв (pci)
zh_tw: 如果您想要允許受限的虛擬客座端管理裝置配置（pci）

source: If you want to allow spamd to read/write user home directories.
as: যদি আপুনি spamd ক ব্যৱহাৰকাৰী ঘৰ ডাইৰেকটৰিসমূহ পঢ়া/লিখাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que spamd lea/modifique directorios personales de usuario.
gu: જો તમે વપરાશકર્તા ઘર ડિરેક્ટરીઓને વાંચવા/લખવા માટે spamd ને પરવાનગી આપવા માંગો છો.
ja: spamd が、ユーザのホームディレクトリを読み書きすることを、もし許可したい場合。
kn: spamd ಯು ಬಳಕೆದಾರ ನೆಲೆ ಕೋಶಗಳನ್ನು ಓದಲು/ಬರೆಯಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ ଚାଳକ ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକରେ ଫାଇଲଗୁଡ଼ିକୁ ପଢ଼ିବା/ଲେଖିବା ପାଇଁ spamd କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି.
te: మీరు spamd ను వాడుకరి నివాస సంచయాలను చదువుట/వ్రాయుట కు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ spamd до читання або запису до домашніх каталогів користувачів.
zh_tw: 如果您想要允許 spamd 讀寫使用者家目錄。

source: If you want to allow Apache to use mod_auth_ntlm_winbind
as: যদি আপুনি Apache ক mod_auth_ntlm_winbind ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que Apache utilice mod_auth_ntlm_winbind
gu: જો તમે mod_auth_ntlm_winbind ને વાપરવા માટે Apache ને પરવાનગી આપવા માંગો છો
ja: Apache が、 mod_auth_ntlm_winbind を使用することを、もし許可したい場合
kn: Apache ಯು mod_auth_ntlm_winbind ಅನ್ನು ಬಳಸುವುದನ್ನು ಅನುಮತಿಸಲು ನೀವು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ mod_auth_ntlm_winbind କୁ ବ୍ୟବହାର କରିବା ପାଇଁ Apache କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు Apache ను mod_auth_ntlm_winbind వుపయోగించుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити Apache використовувати mod_auth_ntlm_winbind
zh_tw: 如果您想要允許 Apache 使用

source: If you want to allow the graphical login program to execute bootloader
as: যদি আপুনি গ্ৰাফীয় প্ৰৱেশ প্ৰগ্ৰামক বুটল'ডাৰ এক্সিকিউট কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que el programa de registro gráfico ejecute el gestor de arranque
gu: જો તમે બુટલોડરને ચલાવવા માટે ગ્રાફિકલ લૉગિન કાર્યક્રમને પરવાનગી આપવા માંગો છો
ja: グラフィカルログインプログラムが、 bootloader を実行することを、もし許可したい場合
kn: ಬೂಟ್ ಲೋಡರ್ ಅನ್ನು ಚಿತ್ರಾತ್ಮಕ ಪ್ರೊಗ್ರಾಮ್ ಕಾರ್ಯಗತಗೊಳಿಸುವುದನ್ನು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ଆଲେଖିକ ଲଗଇନ ପ୍ରଗ୍ରାମକୁ ବୁଟ ଧାରଣକାରୀକୁ ନିଷ୍ପାଦନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଇଚ୍ଛା କରୁଛନ୍ତି
te: మీరు గ్రాఫికల్ లాగిన్ ప్రోగ్రామ్‌ను బుట్‌లోడర్‌ను నిర్వర్తించుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити програмі графічного входу до системи виконувати програму завантаження
zh_tw: 如果您想要允許圖形化登入程式執行開機載入程式

source: If you want to allow system to run with NIS
as: যদি আপুনি চিস্টেমক NIS চলোৱাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que el sistema se ejecute con NIS
gu: જો તમે NIS સાથે ચલાવવા માટે સિસ્ટમને પરવાનગી આપવા માંગો છો
ja: システムが、 NIS を実行することを、もし許可したい場合
kn: ವ್ಯವಸ್ಥೆಯನ್ನು NIS ನೊಂದಿಗೆ ಚಲಾಯಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ତନ୍ତ୍ରକୁ NIS ସହିତ ଚଲାଇବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు సిస్టమ్‌ను NISతో నడుపుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити системі запускатися з NIS
zh_tw: 如果您想要允許系統與 NIS 搭配使用
