Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: If you want to allow qemu to connect fully to the network
as: যদি আপুনি qemu ক সম্পূৰ্ণভাৱে নেটৱাৰ্কলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitirle a quemu conectarse completamente a la red
gu: જો તમે નેટવર્ક સાથે સંપૂર્ણપણે જોડાવા માટે qemu ને પરવાનગી આપવા માંગો છો
ja: qemu が、ネットワークに完全に接続することを、もし許可したい場合
kn: ಜಾಲಬಂಧದೊಂದಿಗೆ qemu ಸಂಪೂರ್ಣವಾಗಿ ಸಂಪರ್ಕಸಾಧಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ qemu କୁ ନେଟୱର୍କ ସହିତ ସମ୍ପୂର୍ଣ୍ଣ ଭାବରେ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు qemu ను పూర్తిగా నెట్వర్కునకు అనుసంధానమగుటను అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити qemu встановлювати повноцінне з’єднання з мережею
zh_tw: 如果您想要允許 qemu 完整連接至網路

source: If you want to allow nfs servers to modify public files used for public file transfer services. Files/Directories must be labeled public_content_rw_t.
as: যদি আপুনি nfs চাৰ্ভাৰসমূহক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত ৰাজহুৱা নথিপত্ৰসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে। নথিপত্ৰসমূহ/ডাইৰেকটৰিসমূহ public_content_rw_t লেবেল কৰা থাকিব লাগিব।
es: Si desea permitir que servidores nfs modifiquen archivos públicos utilizados por servicios de transferencia de archivos públicos. Los archivos y los directorios deben estar etiquetados como public_content_rw_t.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહન સેવાઓ માટે વાપરેલ સાર્વજનિક ફાઇલોને બદલવા માટે nfs સર્વરોને પરવાનગી આપવા માંગો છો. ફાઇલો/ડિરેક્ટરીઓ public_content_rw_t લેબલ થયેલ હોવુ જ જોઇએ.
ja: nfs サーバが、共有コンテンツを編集し、共有コンテンツ転送サービスを使用することを、もし許可したい場合。ファイルやディレクトリは public_content_rw_t にラベルされていなければいけません。
kn: nfs ಪರಿಚಾರಕವು ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಮಾರ್ಪಡಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ. ಕಡತಗಳು/ಕೋಶಗಳನ್ನು public_content_rw_t ಎಂದು ಲೇಬಲ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ.
or: ଯଦି ଆପଣ nfs ସର୍ଭରକୁ ସର୍ବସାଧାରଣ ଫାଇଲ ସ୍ଥାନାନ୍ତରଣ ସର୍ଭିସଗୁଡ଼ିକରେ ବ୍ୟବହୃତ ଫାଇଲଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି। ତେବେ ଫାଇଲ/ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକ ନିଶ୍ଚିତ ଭାବରେ public_content_rw_t ରେ ନାମକରଣ ହୋଇଥିବ।
uk: Якщо ви бажаєте надати доступ серверам nfs до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами. Файли і каталоги має бути позначено міткою public_content_rw_t.

source: If you want to allow ABRT to run in abrt_handle_event_t domain to handle ABRT event scripts
as: যদি আপুনি ABRT ক ABRT ঘটনা লিপিসমূহ ব্যৱস্থাপনা কৰিবলে abrt_handle_event_t ডমেইনত চলাৰ অনুমতি দিব বিচাৰে

source: If you want to unify HTTPD to communicate with the terminal. Needed for entering the passphrase for certificates at the terminal.
as: যদি আপুনি টাৰ্মিনেললে সংযোগ কৰিবলে HTTPD ক সংযুক্ত কৰিব বিচাৰে। টাৰ্মিনেলত প্ৰমাণপত্ৰসমূহৰ বাবে পাছফ্ৰেইচ সুমুওৱাৰ বাবে প্ৰয়োজনীয়।
es: Si desea unificar HTTPD para comunicarse con la terminal. Esto es necesario para ingresar la frase de acceso para certificados en la terminal.
gu: જો તમે ટર્મિનલ સાથે વાર્તાલાપ કરવા માટે HTTPD ને એકરૂપ કરવા માંગો તો. ટર્મિનલ પર પ્રમાણપત્રો માટે પાસફ્રેજને દાખલ કરવા માટેની જરૂર છે.
ja: HTTPD が、 terminal と交信することを、もし許可したい場合。terminal の認証には、パスフレーズの入力が必要です。
kn: HTTPD ಯನ್ನು ಟರ್ಮಿನಲ್‌ನೊಂದಿಗೆ ವ್ಯವಹರಿಸಲು ನೀವು ಒಗ್ಗೂಡಿಸಲು ಅನುಮತಿಸುವುದಾದರೆ. ಟರ್ಮಿನಲ್‌ನಲ್ಲಿನ ಪ್ರಮಾಣಪತ್ರಗಳಿಗಾಗಿ ಗುಪ್ತವಾಕ್ಯಗಳನ್ನು ನಮೂದಿಸಲು ಅಗತ್ಯ ಬೀಳುತ್ತದೆ.
or: ଯଦି ଆପଣ ଟର୍ମିନାଲ ସହିତ ଯୋଗାଯୋଗ କରିବା ପାଇଁ HTTPD କୁ ଏକତ୍ର କରିବା ପାଇଁ ଚାହାନ୍ତି। ଟର୍ମିନାଲରେ ପ୍ରମାଣପତ୍ରଗୁଡ଼ିକ ପାଇଁ ପ୍ରବେଶ ସଂକେତ ବାକ୍ୟାଂଶକୁ ଭରଣ କରିବା ପାଇଁ ଆବଶ୍ୟକ।
te: టెర్మినల్‌తో సంప్రదించుటకు మీరు HTTPDను యెకీకృతం చేయవలెనంటే. టెర్మినల్ వద్ద దృవీకరణపత్రముల కొరకు సంకేతపదమును ప్రవేశపెట్టుటకు అవసరం.
uk: Якщо ви бажаєте уніфікувати обмін даними між HTTPD та терміналом. Потрібне для введення паролів до сертифікатів з термінала.
zh_tw: 如果您想要統一 HTTPD 與終端機的通訊。需要在終端機中輸入密碼以進行認證。

source: If you want to allow xend to run qemu-dm. Not required if using paravirt and no vfb.
as: যদি আপুনি xend ক qemu-dm চলোৱাৰ অনুমতি দিব বিচাৰে। প্ৰয়োজনীয় নহয় যদি paravirt ব্যৱহাৰ কৰা হৈ আছে আৰু vfb নাই।

source: If you want to allow sftp-internal to read and write files in the user home directories
as: যদি আপুনি sftp-internal ক ব্যৱহাৰকাৰী ঘৰ ডাইৰেকটৰসমূহত নথিপত্ৰসমূহ পঢ়া আৰু লিখাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que sftp-internal lea y ejecute archivos en los directorios personales del usuario
gu: જો તમે વપરાશકર્તા ઘર ડિરેક્ટરીઓમાં ફાઇલોને લખવા અને વાંચવા માટે sftp-internal ને પરવાનગી આપવા માંગો છો
ja: sftp-internal が、ユーザのホームディレクトリを読み書きすることを、もし許可したい場合。
kn: sftp-internal ಯು ಬಳಕೆದಾರ ನೆಲೆ ಕೋಶಗಳನ್ನು ಓದಲು ಹಾಗು ಬರೆಯಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸಿದಲ್ಲಿ
or: ଯଦି ଆପଣ ଚାଳକ ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକରେ ଫାଇଲଗୁଡ଼ିକୁ ପଢ଼ିବା ଏବଂ ଲେଖିବା ପାଇଁ sftp-ଆଭ୍ୟନ୍ତରୀଣକୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు sftp-internal ను వాడుకరి నివాస సంచయములనందలి ఫైళ్ళను చదువుటకు మరియు వ్రాయుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ вбудованому sftp до читання і запису файлів до домашніх каталогів користувачів
zh_tw: 如果您想要允許 sftp-internal 讀寫使用者家目錄的檔案

source: If you want to support fusefs home directories
as: যদি আপুনি fusefs ঘৰ ডাইৰেকটৰিসমূহ সমৰ্থন কৰিব বিচাৰে
es: Si desea tener soporte fusefs en los directorios personales
gu: જો તમે fusefs ઘર ડિરેક્ટરીઓને આધાર આપવા માંગો છો
ja: fusefs ホームディレクトリを、もしサポートしたい場合。
kn: NFS ನೆಲೆ ಕೋಶಗಳಿಗೆ ಬೆಂಬಲಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದರೆ
or: ଯଦି ଆପଣ fusefs ମୂଳ ସ୍ଥାନ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ ସମର୍ଥିନ କରିବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు fusefs నివాస సంచయములను మద్దతించగోరితే
uk: Якщо ви бажаєте увімкнути підтримку домашніх каталогів у fusefs
zh_tw: 如果您想要支援 fusefs 家目錄

source: If you want to allow the Telepathy connection managers to connect to any network port.
as: যদি আপুনি টেলিপেথী সংযোগ ব্যৱস্থাপকসমূহক যিকোনো নেটৱাৰ্ক পোৰ্টলে সংযোগ কৰাৰ অনুমতি দিব বিচাৰে।

source: If you want to determine whether calling user domains can execute Polipo daemon in the polipo_session_t domain.
as: যদি আপুনি নিৰ্ধাৰণ কৰিব বিচাৰে কল কৰি থকা ব্যৱহাৰকাৰী ডমেইনসমূহে polipo_session_t domain ত Polipo ডিমন এক্সিকিউট কৰিব পাৰে নে।

source: If you want to allow confined applications to use nscd shared memory.
as: যদি আপুনি গোপন অনুপ্ৰয়োগসমূহক nscd অংশীদাৰী মেমৰি ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que las aplicaciones confinadas utilicen memoria compartida nscd.
gu: જો તમે nscd વહેંચાયેલ મેમરીને વાપરવા માટે મર્યાદિત કાર્યક્રમોને પરવાનગી આપવા માંગો છો.
ja: 特定のアプリケーションが、 nscd shared メモリを使用することを、もし許可したい場合。
kn: ನಿರ್ಬಂಧಿತ ಅನ್ವಯಗಳು nscd ಹಂಚಲಾದ ಮೆಮೊರಿಯನ್ನು ಬಳಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ବନ୍ଧିତ ପ୍ରୟୋଗମାନଙ୍କୁ usb ଉପକରଣଗୁଡ଼ିକୁ nscd ସହଭାଗୀ ସ୍ମୃତିସ୍ଥାନ ବ୍ୟବହାର କରି ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు లోబడిన అనువర్తనములను nscd భాగస్వామ్య మెమొరీను వుపయోగించుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити обмеженим програмам використовувати область пам’яті спільного використання nscd.
zh_tw: 如果您想要允許受限的應用程式使用 nscd 共享記憶體。

source: If you want to allow w to display everyone
as: যদি আপুনি সকলোকে প্ৰদৰ্শন কৰিবলে w ক অনুমতি দিব বিচাৰে
es: Si desea permitir que w muestre a todos
gu: જો તમે દરેકને દેખાડવા માટે w ને પરવાનગી આપવા માંગો છો
ja: w が、全員を表示することを、もし許可したい場合。
kn: w ವು ಎಲ್ಲರಿಗೂ ಕಾಣಿಸಿಕೊಳ್ಳಲು ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ w କୁ ସମସ୍ତଙ୍କୁ ଦର୍ଶାଇବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
te: మీరు w ను ప్రతివొక్కరికి కనిపించుటకు అనుమతించవలెనంటే
uk: Якщо ви бажаєте надати доступ w на показ даних всім
zh_tw: 如果您想要允許 w 顯示每個人

source: If you want to allow fenced domain to execute ssh.
as: যদি আপুনি ফেনস্ড ডমেইনক ssh এক্সিকিউট কৰাৰ অনুমতি দিব বিচাৰে।

source: If you want to allow Apache to modify public files used for public file transfer services. Directories/Files must be labeled public_content_rw_t.
as: যদি আপুনি Apache ক ৰাজহুৱা নথিপত্ৰ স্থানান্তৰ সেৱাসমূহৰ বাবে ব্যৱহৃত ৰাজহুৱা নথিপত্ৰসমূহ সলনি কৰাৰ অনুমতি দিব বিচাৰে। ডাইৰেকটৰিসমূহ/নথিপত্ৰসমূহ public_content_rw_t লেবেল কৰা থাকিব লাগিব।
es: Si desea permitir que Apache modifique archivos públicos utilizados por servicios de transferencia de archivos públicos. Los directorios o archivos deber ser etiquetados como public_content_rw_t.
gu: જો તમે સાર્વજનિક ફાઇલ પરિવહન સેવોઓ માટે વાપરેલ સાર્વજનિક ફાઇલોને બદલવા માટે Apache ને પરવાનગી આપવા માંગો છો. ડિરેક્ટરીઓ/ફાઇલોનું લેબલ public_content_rw_t થયેલ હોવુ જ જોઇએ.
ja: Apache が、共有ファイルを編集し、共有ファイル転送サービスを使用することを、もし許可したい場合。ディレクトリやフォルダは public_content_rw_t にラベルされていなければいけません。
kn: Apache ಸಾರ್ವಜನಿಕ ಕಡತ ವರ್ಗಾವಣೆ ಸೇವೆಗಳಲ್ಲಿ ಬಳಸಲಾಗುವ ಸಾರ್ವಜನಿಕ ಕಡತಗಳನ್ನು ಮಾರ್ಪಡಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುವುದಾದರೆ. ಕೋಶಗಳನ್ನು/ಕಡತಗಳನ್ನು public_content_rw_t ಎಂದು ಲೇಬಲ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ.
or: ଯଦି ଆପଣ Apache କୁ ସର୍ବସାଧାରଣ ଫାଇଲ ସ୍ଥାନାନ୍ତରଣ ସର୍ଭିସଗୁଡ଼ିକରେ ବ୍ୟବହୃତ ଫାଇଲଗୁଡ଼ିକୁ ପରିବର୍ତ୍ତନ କରିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି। ତେବେ ଡିରେକ୍ଟୋରୀ/ଫାଇଲଗୁଡ଼ିକ ନିଶ୍ଚିତ ଭାବରେ public_content_rw_t ରେ ନାମକରଣ ହୋଇଥିବ।
te: పబ్లిక్ ఫైల్ బదిలీకరణ సేవల కొరకు పబ్లిక్ ఫైల్సును సవరించుటకు మీరు అపాచీను అనుమతించగోరితే. డైరెక్టరీలు/ఫైళ్ళు తప్పక public_content_rw_t గా లేబుల్ చేయబడాలి.
uk: Якщо ви бажаєте надати доступ Apache до внесення змін до відкритих файлів, використаних для служб відкритого обміну файлами. Файли і каталоги має бути позначено міткою public_content_rw_t.
zh_tw: 如果您想要允許 Apache 修改用以公開傳輸服務的公開檔案。目錄 / 檔案必須標示為 public_content_rw_t。

source: If you want to allow user music sharing
as: যদি আপুনি ব্যৱহাৰকাৰী সংগীত অংশীদাৰীৰ অনুমতি দিব বিচাৰে

source: If you want to allow dbadm to read files in users home directories
as: যদি আপুনি dbadm ক ব্যৱহাৰকাৰীসমূহৰ ঘৰ ডাইৰেকটৰিসমূহত নথিপত্ৰসমূহ পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que dbadm lea archivos de los directorios personales de los usuarios
gu: જો તમે વપરાશકર્તા ઘર ડિરેક્ટરીમાં ફાઇલોને વાંચવા માટે dbadm ને પરવાનગી આપવા માંગો છો
ja: dbadm が、ユーザのホームディレクトリを読むことを、もし許可したい場合。
kn: ಬಳಕೆದಾರರ ನೆಲೆ ಕೋಶಗಳಲ್ಲಿನ ಕಡತಗಳನ್ನು ಓದಲು dbadm ಗೆ ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ଚାଳକର ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକରେ ଫାଇଲ ପଢ଼ିବା ପାଇଁ dbadm କୁ ଅନୁମତି ଦିଅନ୍ତି
te: మీరు dbadm ను వాడుకరుల నివాస సంచయాల నందలి ఫైళ్ళను చదువుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати dbadm доступ до домашніх каталогів користувачів
zh_tw: 如果您想要允許 dbadm 讀寫使用者家目錄中的檔案

source: If you want to allow regular users direct dri device access
as: যদি আপুনি সাধাৰণ ব্যৱহাৰকাৰীসমূহক প্ৰত্যক্ষ যন্ত্ৰ অভিগমৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que los usuarios regulares tengan acceso directo a dispositivos dri
gu: જો તમે સીધો જ dri ઉપકરણ પ્રવેશ માટે નિયમિત વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો
ja: 通常ユーザが、 dri デバイスに直接アクセスすることを、もし許可したい場合
kn: ಸಾಮಾನ್ಯವಾದ ಬಳಕೆದಾರರು ನೇರವಾದ dri ಸಾಧನ ನಿಲುಕಿಸಿಕೊಳ್ಳುವುದನ್ನು ಅನುಮತಿಸಲು ನೀವು ಅನುಮತಿಸಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ ସାଧାରଣ ଚାଳକକୁ dri ଉପକରଣ ଚଲାଇବାକୁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି
te: మీరు రోజువారి వాడుకరుల సూటి dri పరికర యాక్సెస్‌ను అనుమతించగోరితే
uk: Якщо ви бажаєте надати звичайним користувачам безпосередній доступ до пристроїв dri
zh_tw: 如果您想要允許一般使用者引導 dri 裝置的存取

source: If you want to allow the mount command to mount any directory or file.
as: যদি আপুনি যিকোনো ডাইৰেকটৰি অথবা নথিপত্ৰ মাউন্ট কৰিবলে mount কমান্ডৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que el comando montar pueda montar cualquier archivo o directorio.
gu: જો તમે કોઇપણ ફાઇલ અથવા ડિરેક્ટરીને માઉન્ટ કરવા માટે mount આદેશને પરવાનગી આપવા માંગો છો.
ja: mount コマンドが、全てのディレクトリやファイルを mount することを、もし許可したい場合。
kn: mount ಆಜ್ಞೆಯು ಯಾವುದೆ ಕೋಶ ಅಥವ ಕಡತವನ್ನು ಆರೋಹಿಸಲು ನೀವು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ ସ୍ଥାପନ ନିର୍ଦ୍ଦେଶ କୌଣସି ଡିରେକ୍ଟୋରୀ କିମ୍ବା ଫାଇଲକୁ ସ୍ଥାପନ କରିବା ପାଇଁ ଅନୁମତି ଦିଅନ୍ତି।
te: మీరు యేదేని డెరెక్టరీ లేదా ఫైలును మౌంట్ చేయుటకు మౌంట్ ఆదేశమును అనుమతించగోరితే.
uk: Якщо ви бажаєте дозволити монтування за допомогою команди mount довільного каталогу або файла.
zh_tw: 如果您想要允許 mount 指令掛載任何目錄或檔案。

source: If you want to allow a user to login as an unconfined domain
as: যদি আপুনি এজন ব্যৱহাৰকাৰীক এটা উন্মুক্ত ডমেইন হিচাপে প্ৰৱেশ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que un usuario se registre como un dominio no confinado
gu: જો તમે બંધનમુક્ત ડોમેઇન તરીકે પ્રવેશવા માટે વપરાશકર્તાને પરવાનગી આપવા માંગો છો
ja: ユーザが、不特定のドメインとしてログインすることを、もし許可したい場合。
kn: ಒಬ್ಬ ಬಳಕೆದಾರನು ನಿರ್ಬಂಧಿತವಲ್ಲದ ಡೊಮೈನ್ ಆಗಿ ಪ್ರವೇಶಿಸಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ଅବନ୍ଧିତ ଡମେନଗୁଡ଼ିକରେ ଲଗଇନ ପାଇଁ ଗୋଟିଏ ଚାଳକକୁ ଅନୁମତି ଦିଅନ୍ତି
te: మీరు వాడుకరిని లోబడని డొమైన్ వలె లాగిన్ అగుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити користувачеві входити до системи режимі домену без обмежень
zh_tw: 如果您想要允許使用者登入為不受限的區域

source: If you want to disallow programs and users from transitioning to insmod domain.
as: যদি আপুনি প্ৰগ্ৰামসমূহ আৰু ব্যৱহাৰকাৰীসমূহক insmod ডমেইনলে স্থানান্তৰ কৰাৰ অনুমতি নাকচ কৰিব বিচাৰে।
es: Si desea evitar que programas o usuarios se trasladen al dominio insmod.
gu: જો તમે insmod ડોમેઇન માટે પરિવર્તનામાંથી કાર્યક્રમો અને વપરાશકર્તાઓને પરવાનગી આપવા માંગતા ન હોય .
ja: プログラムとユーザが、 insmod ドメインに移行することを、もし許可したくない場合。
kn: ಪ್ರೊಗ್ರಾಮ್‌ಗಳು ಹಾಗು ಬಳಕೆದಾರರು insmod ಡೊಮೈನ್‌ಗಳಾಗಿ ಮಾರ್ಪಾಡು ಹೊಂದುವುದನ್ನು ಅನುಮತಿಸದೆ ಇರಲು ನೀವು ಬಯಸಿದಲ್ಲಿ.
or: ଯଦି ଆପଣ ପ୍ରଗ୍ରାମ, ଏବଂ ଚାଳକମାନଙ୍କୁ ଅନୁମତି ନଦେବା ପାଇଁ ଚାହାନ୍ତି, ସ୍ଥାନାନ୍ତରଣରୁ insmod ଡମେନଗୁଡ଼ିକୁ।
te: మీరు ప్రోగ్రామ్సు మరియు వాడుకరులు insmod డొమైన్‌కు బదిలీఅగుటనుండి నిరాకరించగోరితే.
uk: Якщо ви бажаєте заборонити програмам і користувачам переходити у домен insmod.
zh_tw: 如果您不想允許程式與使用者傳送至 insmod 區域。

source: If you want to allow httpd to act as a FTP client connecting to the ftp port and ephemeral ports
as: যদি আপুনি httpd ক ftp পোৰ্ট আৰু এফিমেৰেল পোৰ্টসমূহলে সংযোগ কৰা এটা FTP ক্লাএন্ট হিচাপে কাৰ্য্য কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow Cobbler to access nfs file systems.
as: যদি আপুনি Cobbler ক nfs নথিপত্ৰ প্ৰণালীসমূহ অভিগম কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que Cobbler tenga acceso a sistemas de arvhivos nfs.
gu: જો તમે nfs ફાઇલ સિસ્ટમોને પ્રવેશવા માટે Cobbler ને પરવાનગી આપવા માંગો છો.
ja: Cobber が、 nfs ファイルシステムにアクセスすることを、もし許可したい場合。
kn: nfs ಕಡತ ವ್ಯವಸ್ಥೆಗಳಿಗೆ ನಿಲುಕಿಸಿಕೊಳ್ಳುವಂತೆ ನೀವು Cobbler ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଆପଣ Cobbler କୁ nfs ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ଅଭିଗମ୍ୟତା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు కోబ్లర్‌ను nfs ఫైల్ సిస్టమ్సును యాక్సెస్ చేయుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ Cobbler до файлових систем nfs.

source: If you want to allow nsplugin code to execmem/execstack
as: যদি আপুনি nsplugin ক'ডক execmem/execstack ৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que código nsplugin realice execmem/execstack
gu: જો તમે execmem/execstack માટે nsplugin કોડને પરવાનગી આપવા માંગો છો
ja: nsplugin コードに、 execmem/execstack を、もし許可したい場合。
kn: nsplugin ಸಂಕೇತವು execmem/execstack ಮಾಡಲು ನೀವು ಅನುಮತಿಸುವುದಾದಲ್ಲಿ
or: ଯଦି ଆପଣ nsplugin ସଙ୍କେତକୁ execmem/execstack ପାଇଁ ଅନୁମତି ଦେବାପାଇଁ ଚାହାନ୍ତି
te: మీరు nsplugin కోడ్‌ను execmem/execstack కు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ коду nsplugin до execmem/execstack

source: If you want to allows clients to write to the X server shared memory segments.
as: যদি আপুনি ক্লাএন্টসমূহক X চাৰ্ভাৰ অংশীদাৰী মেমৰি অংশবোৰলে লিখাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que clientes modifiquen segmentos de memoria compartidos en el servidor X.
gu: જો તમે X સર્વર વહેંચાયેલ મેમરી સેગમેંટમાં લખવા માટે ક્લાયન્ટોને પરવાનગી આપવા માંગો છો.
ja: クライアントが、 X server 共有メモリセグメントに書き込むことを、もし許可したい場合。
kn: X ಪರಿಚಾರಕಕ್ಕಾಗಿ ಹಂಚಲಾದ ಮೆಮೊರಿ ವಿಭಾಗಗಳಿಗೆ ಕ್ಲೈಂಟ್‌ಗಳು ಬರೆಯಲು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ.
or: ଯଦି ଆପଣ କ୍ଲାଏଣ୍ଟମାନଙ୍କୁ X ସର୍ଭର ସହଭାଗୀ ସ୍ମୃତିସ୍ଥାନରେ ଲେଖିବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି।
te: మీరు క్లైంట్లను X సర్వర్ భాగస్వామ్య మెమొరీ సెగ్మెంట్లకు వ్రాయుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ клієнтським програмам на запис до сегментів пам’яті графічного сервера зі спільним використанням.

source: If you want to allow confined virtual guests to use executable memory and executable stack
as: যদি আপুনি গোপন ভাৰছুৱেল অতিথিসমূহক এক্সিকিউটেবুল মেমৰি আৰু এক্সিকিউটেবুল স্টেক ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে

source: If you want to allow webadm to read files in users home directories
as: যদি আপুনি webadm ক ব্যৱহাৰকাৰীসমূহ ঘৰ ডাইৰেকটৰিসমূহত নথিপত্ৰসমূহ পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que webadm lea y ejecute archivos en los directorios personales de los usuarios
gu: જો તમે વપરાશકર્તા ઘર ડિરેક્ટરીઓમાં ફાઇલોને વાંચવા માટે webadm ને પરવાનગી આપવા માંગો છો
ja: webadm が、 ユーザのホームディレクトリのファイルを読むことを、もし許可したい場合。
kn: ಬಳಕೆದಾರರ ನೆಲೆ ಕೋಶಗಳಲ್ಲಿನ ಕಡತಗಳನ್ನು ಓದಲು wedbadm ಗೆ ನೀವು ಅನುಮತಿಸಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ ଚାଳକର ମୂଖ୍ୟ ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକରେ ଫାଇଲ ପଢ଼ିବା ପାଇଁ webadm କୁ ଅନୁମତି ଦିଅନ୍ତି
te: మీరు webadmను వాడుకరి నివాస సంచయాలనందలి ఫైళ్ళను చదువుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати webadm доступ до домашніх каталогів користувачів

source: If you want to enable polyinstantiated directory support.
as: যদি আপুনি polyinstantiated ডাইৰেকটৰি সমৰ্থন সামৰ্থবান কৰিব বিচাৰে।
es: Si desea habilitar soporte polyinstantiated para directorios.
gu: જો તમે polyinstantiated ડિરેક્ટરી આધારને સક્રિય કરવા માંગો છો.
ja: polyinstantiated directory サポートを、もし有効にしたい場合。
kn: polyinstantiated ಕೋಶ ಬೆಂಬಲಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ polyinstantiated ଡିରେକ୍ଟୋରୀ ସହାୟତାକୁ ସକ୍ରିୟ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
te: మీరు polyinstantiated సంచయ తోడ్పాటును చేతనపరచగోరితే.
uk: Якщо ви бажаєте увімкнути підтримку багатоекземплярних каталогів.

source: If you want to support X userspace object manager
as: যদি আপুনি X ব্যৱহাৰকাৰীস্থান অবজেক্ট ব্যৱস্থাপক সমৰ্থন কৰিব বিচাৰে
es: Si desea tener soporte para el administrador de objetos en el espacio de usuario de X
gu: જો તમે X વપરાશકર્તાજગ્યા ઑબ્જેક્ટ સંચાલક ને આધાર આપવા માંગો છો
ja: X userspace object manager を、もしサポートしたい場合。
kn: X ಬಳಕೆದಾರ ಸ್ಥಳ ವ್ಯವಸ್ಥಾಪಕವನ್ನು ಬೆಂಬಲಿಸಲು ನೀವು ಅನುಮತಿಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ X userspace ବସ୍ତୁ ପରିଚାଳକ ସମର୍ଥିନ କରିବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు X యూజర్‌స్పేస్ ఆబ్జక్ట్ నిర్వాహకికి తోడ్పాటునివ్వగోరితే
uk: Якщо ви бажаєте увімкнути підтримку керування об’єктами X у просторі користувача

source: If you want to ignore vbetool mmap_zero errors.
as: যদি আপুনি vbetool mmap_zero ত্ৰুটিসমূহ উপেক্ষা কৰিব বিচাৰে।
es: Si desea ignorar errores vbetool mmap_zero
gu: જો તમે vbetool mmap_zero ભૂલોને અવગણવા માંગો છો.
ja: vbetool mmap_zero エラーを、もし無視したい場合。
kn: vbetool mmap_zero ದೋಷಗಳನ್ನು ಕಡೆಗಣಿಸಲು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ vbetool mmap_zero ତ୍ରୁଟିଗୁଡ଼ିକୁ ଅଗ୍ରାହ୍ୟ କରିବା ପାଇଁ ଚାହୁଁଛନ୍ତି।
te: మీరు vbetool mmap_zero దోషములను విస్మరించగోరితే.
uk: Якщо ви бажаєте ігнорувати помилки vbetool mmap_zero.

source: If you want to allow httpd to read user content
as: যদি আপুনি httpd ক ব্যৱহাৰকাৰী বিষয়বস্তু পঢ়াৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que httpd lea contenidos de usuario
gu: જો તમે વપરાશકર્તા સમાવિષ્ટને વાંચવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: httpd が、ユーザコンテンツを読むことを、もし許可したい場合。
kn: ಬಳಕೆದಾರ ವಿಷಯಗಳನ್ನು httpd ಓದಲು ನೀವು ಅನುಮತಿಸಬೇಕಿದ್ದಲ್ಲಿ
or: ଯଦି ଆପଣ ବିଷୟବସ୍ତୁକୁ ପଢ଼ିବା ପାଇଁ httpd କୁ ଅନୁମତି ଦିଅନ୍ତି
te: మీరు httpdను వాడుకరి సారమును చదువుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ httpd до читання даних користувача

source: If you want to allow httpd to access nfs file systems
as: যদি আপুনি httpd ক nfs নথিপত্ৰ প্ৰণালীসমূহ অভিগম কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que httpd tenga acceso a sistemas de archivos nfs
gu: જો તમે nfs ફાઇલ સિસ્ટમોને પ્રવેશવા માટે httpd ને પરવાનગી આપવા માંગો છો
ja: httpd が、 nfs ファイルシステムにアクセスすることを、もし許可したい場合。
kn: nfs ಕಡತ ವ್ಯವಸ್ಥೆಗಳಿಗೆ ನಿಲುಕಿಸಿಕೊಳ್ಳುವಂತೆ ನೀವು httpd ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଆପଣ httpd କୁ nfs ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ଅଭିଗମ୍ୟତା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు httpdను nfs ఫైల్ సిస్టమ్స్ యాక్సెస్ చేయుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ httpd до файлових систем nfs

source: If you want to allow unconfined users to transition to the chrome sandbox domains when running chrome-sandbox
as: যদি আপুনি উন্মুক্ত ব্যৱহাৰকাৰীসমূহক chrome-sandbox চলাই থাকোতে chrome sandbox ডমেইনসমূহলে স্থানান্তৰৰ অনুমতি দিব বিচাৰে

source: If you want to allow postfix_local domain full write access to mail_spool directories
as: যদি আপুনি postfix_local ডমেইনক mail_spool ডাইৰেকটৰিসমূহলে সম্পূৰ্ণ লিখা অভিগমৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que el dominio postfix_local tenga acceso completo y pueda modificar directorios mail_spool
gu: જો તમે mail_spool ડિરેક્ટરીઓ માટે postfix_local ડોમેઇનને સંપૂર્ણ લખવા માટે પ્રવેશ આપવાની પરવાનગી આપો છો
ja: postfix_local domain に、 mail_spool ディレクトリへの書込みフルアクセスを、もし許可したい場合。
kn: postfix_local ಡೊಮೈನ್ mail_spool ಕೋಶಗಳಿಗೆ ಸಂಪೂರ್ಣವಾಗಿ ಬರೆಯುವುದನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ postfix_local ଡମେନକୁ mail_spool ଡିରେକ୍ଟୋରୀରେ ସମ୍ପୂର୍ଣ୍ଣ ଲିଖନ ଅଧିକାର ଦେବାକୁ ଚାହାନ୍ତି
te: మీరు postfix_local డొమైన్ పూర్తి వ్రాయగలగు యాక్సెస్‌ను mail_spool డైరెక్టరీలకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати домену postfix_local повний доступ до каталогів mail_spool

source: If you want to allow sge to access nfs file systems.
as: যদি আপুনি sge ক nfs নথিপত্ৰ প্ৰণালীসমূহ অভিগম কৰাৰ অনুমতি দিব বিচাৰে।

source: If you want to allow xguest users to use blue tooth devices
as: যদি আপুনি xguest ব্যৱহাৰকাৰীসমূহক ব্লুটুথ যন্ত্ৰসমূহ ব্যৱহাৰ কৰাৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que usuarios xguest utilicen dispositivos blue tooth
gu: જો તમે બ્લુ ટુથ ઉપકરણોને વાપરવા માટે xguest વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો
ja: xguest ユーザが、 blue tooth デバイスを使用することを、もし許可したい場合。
kn: ಬ್ಲೂಟೂತ್ ಸಾಧನಗಳನ್ನು ಬಳಸುವಂತೆ ನೀವು xguest ಬಳಕೆದಾರರನ್ನು ಅನ್ನು ಅನುಮತಿಸಲು ಬಯಸುತ್ತೀರಾದರೆ
or: ଯଦି ଆପଣ xguest ଚାଳକମାନଙ୍କୁ ବ୍ଲୁଟୁଥ ଉପକରଣଗୁଡ଼ିକୁ ବ୍ୟବହାର ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି
te: మీరు xguest వాడుకరులను బ్లూటూత్ పరికరములను వుపయోగించుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте надати доступ користувачам xguest до використання пристроїв bluetooth

source: If you want to use lpd server instead of cups
as: যদি আপুনি cups ৰ পৰিৱৰ্তে lpd চাৰ্ভাৰ ব্যৱহাৰ কৰিব বিচাৰে
es: Si desea utilizar el servidor lpd en lugar de cups
gu: જો તમે cups ને બદલે lpd સર્વર વાપરવા માંગો છો
ja: cups の代わりに lpd サーバを、もし使用したい場合。
kn: cups ಬದಲಿಗೆ lpd ಪರಿಚಾರಕವನ್ನು ಬಳಸಲು ನೀವು ಬಯಸುವುದಾದರೆ
or: ଯଦି ଆପଣ lpd ସର୍ଭରକୁ cups ପରିବର୍ତ୍ତେ ବ୍ୟବହାର କରିବାକୁ ଚାହାନ୍ତି
te: మీరు lpd సేవికను cups బదులుగా వుపయోగించగోరితే
uk: Якщо ви бажаєте використовувати сервер lpd замість cups

source: If you want to allow any files/directories to be exported read/write via NFS.
as: যদি আপুনি যিকোনো নথিপত্ৰ/ডাইৰেকটৰিক NFS ৰে পঢ়া/লিখা হিচাপে এক্সপোৰ্ট কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que cualquier archivo/directorio sea exportado como de lectura/escritura mediante NFS.
gu: જો તમે NFS મારફતે વાંચવા/લખવા નું નિકાસ કરવા માટે કોઇપણ ફાઇલો/ડિરેક્ટરીઓને પરવાનગી આપવા માંગો છો.
ja: 全てのファイルやディレクトリが、 NFS 経由で読み書き可能にされることを、もし許可したい場合。
kn: ಯಾವುದೆ ಕಡತಗಳನ್ನು/ಕೋಶಗಳನ್ನು NFS ಮೂಲಕ ಓದಲು/ಬರೆಯಲು ಮಾತ್ರವಾಗಿ ರವಾನಿಸಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ ଯେକୌଣସି ପଠନୀୟ/ଲିଖନୀୟ ଫାଇଲ/ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକୁ NFS ମାଧ୍ଯମରେ ପଠାଇବା ପାଇଁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
uk: Якщо ви бажаєте дозволити експорт будь-яких файлів або каталогів у режимі читання або запису за допомогою NFS.

source: If you want to allow Apache to execute tmp content.
as: যদি আপুনি Apache ক tmp বিষয়বস্তু এক্সিকিউট কৰাৰ অনুমতি দিব বিচাৰে।
es: Si desea permitir que Apache ejecute contenido tmp.
gu: જો તમે tmp સમાવિષ્ટને ચલાવવા માટે Apache ને પરવાનગી આપવા માંગો છો.
ja: Apache が、 tmp コンテンツを実行することを、もし許可したい場合。
kn: Apache ಯು tmp ಯಲ್ಲಿನ ವಿಷಯವನ್ನು ಅನುಮತಿಸಲು ನೀವು ಬಯಸುವುದಾದರೆ.
or: ଯଦି ଆପଣ tmp ବିଷୟବସ୍ତୁକୁ ନିଷ୍ପାଦନ କରିବା ପାଇଁ Apache କୁ ଅନୁମତି ଦେବାକୁ ଚାହୁଁଛନ୍ତି।
te: మీరు అపాచీను tmp సారమును నిర్వర్తించుటకు అనుమతించగోరితే.
uk: Якщо ви бажаєте надати доступ Apache до виконання коду з tmp.

source: If you want to allow user to r/w files on filesystems that do not have extended attributes (FAT, CDROM, FLOPPY)
as: যদি আপুনি ব্যৱহাৰকাৰীক নথিপত্ৰপ্ৰণালী যাৰ প্ৰসাৰিত বৈশিষ্টসমূহ (FAT, CDROM, FLOPPY) নাই তালৈ নথিপত্ৰসমূহ r/w ৰ অনুমতি দিব বিচাৰে
es: Si desea permitir que los usuarios lean o modiquen archivos en sistemas que no poseen atributos extendidos (FAT, CDROM, FLOPPY)
gu: જો તમે ફાઇલસિસ્ટમો પર r/w ફાઇલો માટે વપરાશકર્તાઓને પરવાનગી આપવા માંગો છો કે જેની પાસે વિસ્તરેલ ગુણધર્મો નથી (FAT, CDROM, FLOPPY)
ja: ユーザが、ファイルシステムにファイルを読み書きすることを、もし許可したい場合。これは拡張した属性 (FAT, CDROM, FLOPPY) を含みません。
kn: ವಿಸ್ತರಿಸಲಾದ ಗುಣವಿಶೇಷಣಗಳನ್ನು (FAT, CDROM, FLOPPY) ಹೊಂದಿರದ ಕಡತವ್ಯವಸ್ಥೆಗಳಲ್ಲಿನ ಕಡತಗಳಿಗೆ ಬಳಕೆದಾರರು r/w ಮಾಡಲು ನೀವು ಅನುಮತಿಸ ಬಯಸುವುದಾದಲ್ಲಿ
or: ଯଦି ଆପଣ ଚାଳକମାନଙ୍କୁ r/w ଫାଇଲଗୁଡ଼ିକୁ ଫାଇଲତନ୍ତ୍ରଗୁଡ଼ିକରେ ଅନୁମତି ଦେବାକୁ ଚାହାନ୍ତି ଯେଉଁଥିରେ ଅନୁଲମ୍ବିତ ଗୁଣଧର୍ମ ନଥାଏ (FAT, CDROM, FLOPPY)
te: మీరు వాడుకరిని విస్తరిత యాట్రిబ్యూట్లు (FAT, CDROM, FLOPPY) లేని ఫైల్‌సిస్టమ్సుపైన ఫైళ్ళను r/w చేయుటకు అనుమతించగోరితే
uk: Якщо ви бажаєте дозволити користувачеві читати і записувати файли на файлові системі без розширених атрибутів (FAT, CDROM, FLOPPY)
