Repository: eurolinux-enterprise-linux-sources/setroubleshoot-plugins
Catalog: src/po/*.po
Languages: as, es, gu, ja, kn, or, te, uk, zh_tw

source: Confined processes can be configured to run requiring different access, SELinux provides booleans to allow you to turn on/off access as needed.
as: গোপণ প্ৰক্ৰিয়াসমূহক বিভিন্ন অভিগমৰ প্ৰয়োজন হোৱাকৈ চলিবলে সংৰূপণ কৰিব পাৰি, SELinux এ আপোনাক অভিগম প্ৰয়োজন সাপেক্ষে অন/অফ কৰাৰ অনুমতি দিবলে বুলিয়ানসমূহ প্ৰদান কৰে।
es: Los procesos confinados se pueden configurar para correr con distintos requerimientos de acceso, SELinux provee booleanos para permitir habilitar/deshabilitar esos accesos a medida que sea necesario.
gu: શુદ્ધિ થયેલ પ્રક્રિયાઓ જરૂરી અલગ વપરાશ મેળવવા માટે ચલાવીને રૂપરેખાંકિત કરી શકાય છે, SELInux એ તમને જરૂરીયાત પ્રમાણે વપરાશ ચાલુ/બંધ કરવા માટે તમને પરવાનગી આપવા માટે બુલિયનો પૂરા પાડે છે.
ja: 別のアクセスを必要とする、限定されたプロセスを実行するように設定できます。 SELInux は必要に応じて、ユーザーがアクセスをオン/オフに切り替えできる ブーリアン値を提供します。
kn: ಮಿತಿಗೊಳಪಡಿಸಲಾದ ಪ್ರಕ್ರಿಯೆಗಳನ್ನು ವಿವಿಧ ನಿಲುಕಣೆಗಳ ಅಗತ್ಯವಿರುವಂತೆ ಚಲಾಯಿತಗೊಳ್ಳಲು ಸಂರಚಿಸಬಹುದು, ಹಾಗು, SELinux ಈ ಅಗತ್ಯಗಳನ್ನು ಪೂರೈಸಲು ನಿಮಗೆ ಬೂಲಿಯನ್‍ಗಳನ್ನು ಆನ್/ಆಫ್ ಮಾಡಲು ಅವಕಾಶ ಒದಗಿಸುತ್ತದೆ
or: ସୀମିତ ପ୍ରକ୍ରିୟାଗୁଡ଼ିକୁ ବିଭିନ୍ନ ଅଭିଗମ୍ୟତାକୁ ଆବଶ୍ୟକ କରି ଚଲାଇବା ପାଇଁ ବିନ୍ୟାସ କରିହେବ, SELinux ଆବଶ୍ୟକତା ଅନୁସାରେ ଅନ/ଅଫ କରିବା ପାଇଁ ବୁଲିଆନ ପ୍ରଦାନ କରିଥାଏ।
te: కూర్చిన కార్యక్రమము అనునది అవసరమైన విభిన్న వాడుకలను నడుపుటకు ఆకృతీకరింగలము, SELinux అనునది బూలియన్స్‍‌ను ఇస్తుంది మిమ్ముల్ని వాడుకను అన్/ఆఫ్ చేయుటకు అనుమతిస్తుంది.
uk: Процеси, щоб обмежуються можна налаштувати так, щоб вони виконувались з різними рівнями доступу. При цьому доступ можна дозволити та забороняти за допомогою логічних змінних SELinux.
zh_tw: 使用者可設定受限的程序，以執行所需的各種存取，SELinux 提供允許您視需求將存取許可開啟/關閉 的布林值。

source: you want to %s
as: আপুনি %s কৰিব বিচাৰে
es: desea %s
gu: તમે %s ને ઇચ્છો છો
ja: %s がしたい
kn: ನೀವು %s ಮಾಡಲು ಬಯಸುತ್ತೀರಿ
or: ଆପଣ %s କରିବାକୁ ଚାହୁଁଛନ୍ତି କି
te: %s కోరుకొనుచున్నారా
uk: ви бажаєте %s
zh_tw: 您想要%s

source: You must tell SELinux about this by enabling the '%s' boolean. You can read '%s' man page for more details.
as: আপুনি SELinux ক ইয়াৰ বিষয়ে '%s' সামৰ্থবান কৰি কব লাগিব। আপুনি অধিক বিৱৰণৰ বাবে '%s' man পৃষ্ঠা পঢ়িব পাৰিব।

source: You must tell SELinux about this by enabling the '%s'boolean.
as: আপুনি '%s' বুলিয়ান সামৰ্থবান কৰি SELinux ক ইয়াৰ বিষয়ে কব লাগিব।

source: SELinux has denied the $SOURCE access to potentially mislabeled files $TARGET_PATH. This means that SELinux will not allow httpd to use these files. If httpd should be allowed this access to these files you should change the file context to one of the following types, %s. Many third party apps install html files in directories that SELinux policy cannot predict. These directories have to be labeled with a file context which httpd can access.
as: SELinux এ বিভৱীয়ভাৱে ভুল লেবেল কৰা নথিপত্ৰসমূহ $TARGET_PATH লে $SOURCE অভিগম নাকচ কৰিছে। ই বুজায় যে SELinux এ httpd ক এই নথিপত্ৰসমূহ ব্যৱহাৰ কৰাৰ অনুমতি নিদিব। যদি httpd ক এই নথিপত্ৰসমূহলে অভিগম দিব লাগে আপুনি নথিপত্ৰ পৰিপ্ৰেক্ষতিতক নিম্নলিখিত ধৰণসমূহৰ এটালে, %s সলনি কৰিব লাগিব। বহুতো তৃতিয় দল অনুপ্ৰয়োগসমূহে ডাইৰেকটৰিসমূহত html নথিপত্ৰসমূহ ইনস্টল কৰে যাক SELinux নিতিয়ে আগতিয়াকৈ কব নোৱাৰে। এই ডাইৰেকটৰিসমূহক এটা নথিপত্ৰ পৰিপ্ৰেতিতৰ সহায়ত লেবেল কৰিব লাগিব যাক httpd এ অভিগম কৰিব পাৰে।
es: SELinux le ha negado a $SOURCE el acceso a archivos potencialmente mal etiquetados $TARGET_PATH. Esto significa que SELinux no permitirá que httpd use estos archivos. Si httpd debe tener permitido acceder a estos archivo puede cambiar el contexto de archivo a uno de los siguientes tipos, %s. Muchas aplicaciones de terceros instalan archivos html en directorios que la política de SELinux no puede predecir. Estos directorios deben ser etiquetados con el contexto de archivo que le permita a httpd accederlos.
gu: SELinux એ $SOURCE વપરાશને સંભવિત ખોટી રીતે લેબલ થયેલ ફાઈલોનો $TARGET_PATH માટે નામંજૂર કર્યો છે. આનો અર્થ એ થાય કે SELinux એ http ને આ ફાઈલો વાપરવા માટે પરવાનગી આપશે નહિં. જો httpd ને આ ફાઇલોનાં પ્રવેશ માટે પરવાનગી આપે તો તમારે નીચેનાં પ્રકારો નાં એક ફાઇલ સંદર્ભ ને બદલવો જોઇએ, %s. ણણીા ત્રીજી વ્યક્તિ કાર્યક્રમો html ફાઈલોને ડિરેક્ટરીઓમાં સ્થાપિત કરે છે કે જેની SELinux પોલિસી ધારણા કરી શકે નહિં. આ ડિરેક્ટરીઓ ફાઈલ સંદર્ભ સાથે લેબલ થયેલ હોવી જોઈએ કે જેને httpd વાપરી શકે.
ja: SELinux は $SOURCE よる誤ったラベル付けの可能性のあるファイル $TARGET_PATH へのアクセスを拒否しました。 SELinux は httpd による これらのファイルの使用を許可しないという意味です。httpd がこれらのファイルに アクセスを許可されるべきである場合は、ファイルコンテキストを次のタイプに 変更する必要があります。%s ’ 多くのサード パーティーのアプリケーションは SELinux ポリシーが予期できない ディレクトリーに html ファイルをインストールします。これらのディレクトリーは httpd がアクセスができるファイルコンテキストでラベル付けされなければなりません。
kn: ಸಮರ್ಥವಾಗಿ ತಪ್ಪಾಗಿ ಲೇಬಲ್ ಮಾಡಲ್ಪಟ್ಟ ಕಡತಗಳು ($TARGET_PATH) ಅನ್ನು $SOURCE ನಿಲುಕಿಸಿಕೊಳ್ಳದಂತೆ SELinux ತಡೆದಿದೆ. ಇದರರ್ಥ httpd ಯು ಈ ಕಡತಗಳನ್ನು ಬಳಸುವುದನ್ನು SELinux ಅನುಮತಿಸುವುದಿಲ್ಲ ಎಂದಾಗುತ್ತದೆ. ಎಲ್ಲಿಯಾದರೂ ಈ ಕಡತಗಳಿಗೆ httpd ಯು ಈ ನಿಲುಕಣೆಯನ್ನು ಒದಗಿಸಲು ಬಯಸಿದಲ್ಲಿ ಕಡತದ ಸನ್ನಿವೇಶವನ್ನು ಈ ಕೆಳಗಿನವುಗಳಲ್ಲಿ ಒಂದಕ್ಕೆ ಬದಲಾಯಿಸಬೇಕು, %s. ಹಲವಾರು ಥರ್ಡ್ ಪಾರ್ಟಿ ಅನ್ವಯಗಳು SELinux ಊಹಿಸಲು ಸಾಧ್ಯವಾಗದ ಕಡತಕೋಶಗಳಲ್ಲಿ html ಕಡತಗಳನ್ನು ಅನುಸ್ಥಾಪಿಸುತ್ತವೆ. ಈ ಕಡತಕೋಶಗಳನ್ನು httpd ಯು ನಿಲುಕಿಸಿಕೊಳ್ಳುವಂತಹ ಒಂದು ಕಡತ ಸನ್ನಿವೇಶಗಳೊಂದಿಗೆ ಲೇಬಲ್ ಮಾಡಬೇಕಾಗುತ್ತದೆ
or: SELinux $SOURCE ଅଭିଗମ୍ୟତାକୁ ସାମର୍ଥ୍ୟ ଭୁଲ ନାମକରଣ ହୋଇଥିବା ଫାଇଲ $TARGET_PATH ମଧ୍ଯରେ ଅଭିଗମ୍ୟ ପାଇଁ ବାରଣ କରିଥାଏ। ଏହା ମାନେ ହେଉଛି SELinux ଏହି ଫାଇଲଗୁଡ଼ିକୁ ବ୍ୟବହାର କରିବା ପାଇଁ httpd କୁ ଅନୁମତି ଦେଇଥାଏ। ଯଦି httpd ଏହି ଫାଇଲଗୁଡ଼ିକରେ ଅଭିଗମ୍ୟତାକୁ ଅନୁମତି ଦେଇଥାଏ ତେବେ ଆପଣ ଫାଇଲ ପ୍ରସଙ୍ଗକୁ ନିମ୍ନଲିଖିତ ପ୍ରକାରରେ ପରିବର୍ତ୍ତନ କରିବା ଉଚିତ, %s. ଅନେକ ତୃତୀୟ ପକ୍ଷ apps html ଫାଇଲଗୁଡ଼ିକୁ SELinux ନିତୀ ଅନୁମାନ କରିପାରୁନଥିବା ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକରେ ସ୍ଥାପନ କରିଥାଏ। ଏହି ଡିରେକ୍ଟୋରୀଗୁଡ଼ିକ ଫାଇଲ ପ୍ରସଙ୍ଗ ସହିତ ନାମକରଣ ହେବା ଉଚିତ ଯାହାକୁକି httpd ଅଭିଗମ୍ୟ କରିପାରିବ।
te: SELinux అనునది $SOURCE యాక్సిస్‌ను పొటెన్షియల్‌గా మిస్‌లెబుల్ చేసిన ఫైళ్ళ $TARGET_PATHకు తిరస్కరిస్తుంది. దీనర్ధం SELinux అనునది httpdను ఈ ఫైళ్ళను వుపయోగించుటకు అనుమతించదు. ఒక వేళ httpd అనునది ఈ యాక్సెస్‌ను ఈ దస్త్రములకు అనుమతించాలంటే మీరు దస్త్రము సందర్భమును ఈక్రింది రకములలో వొకదానికి మార్చాలి, %s. చాలా థర్డ్‍ పార్టీ apps html పైళ్ళను సంస్థాపిస్తున్నాయి. ఈ డైరెక్టరీలను httpd యాక్సిస్ చేయగల ఫైలు సందర్భముతో లేబుల్ చేయాలి.
uk: SELinux закрила $SOURCE доступ до потенційно неправильно позначених файлів $TARGET_PATH. Це означає, що SELinux не дасть http використовувати ці файли. Щоб дозволити доступ httpd до цих файлів, змініть контекст на один з типів: %s. Багато програм третіх сторін встановлюють файли html у каталоги, що не передбачені правилами SELinux. Ці каталоги має бути позначено контекстом, до якого у httpd є доступ.
zh_tw: SELinux 拒絕 $SOURCE 存取潛在的 錯誤標記的檔案 $TARGET_PATH。這代表 SELinux 不會 允許 httpd 使用這些檔案。若是 httpd 應被允許存取這些檔案的話，您應將檔案 context 更改為下列其中一個類型，%s。 許多第三方應用程式會將 html 檔案 安裝在 SELinux 方針無法預測的目錄中。這些目錄 必須被一個 httpd 可存取的檔案情境所標記。

source: You need to change the label on $FIX_TARGET_PATH
as: আপুনি $FIX_TARGET_PATH ত লেবেল সলনি কৰিব লাগিব
es: Necesita modificar la etiqueta en $FIX_TARGET_PATH
gu: તમારે $FIX_TARGET_PATH પર લેબલને બદલવાની જરૂર છે
ja: $FIX_TARGET_PATH のラベルを変更する必要があります
kn: $FIX_TARGET_PATH ನಲ್ಲಿ ಲೇಬಲ್ ಅನ್ನು ಬದಲಾಯಿಸುವ ಅಗತ್ಯವಿದೆ
or: ଆପଣଙ୍କୁ $FIX_TARGET_PATH ଉପରେ ନାମପଟିକୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ହେବ
te: మీరు $FIX_TARGET_PATH పైని లేబుల్‌ను మార్చాలి
uk: Вам слід змінити мітку на $FIX_TARGET_PATH
zh_tw: 您需要更改 $FIX_TARGET_PATH 上的標籤

source: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' where FILE_TYPE is one of the following: %s. Then execute: restorecon -v '$FIX_TARGET_PATH'
as: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' যত FILE_TYPE নিম্নলিখিতৰ এটা: %s. তাৰ পিছত এক্সিকিউট কৰক: restorecon -v '$FIX_TARGET_PATH'
es: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' donde FILE_TYPE es uno de los siguientes: %s. Luego ejecute: restorecon -v '$FIX_TARGET_PATH'
gu: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' જ્યાં FILE_TYPE એ નીચેનામાંથી એક છે: %s. પછી ચલાવો: restorecon -v '$FIX_TARGET_PATH'
ja: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' この FILE_TYPE 以下のどれかです: %s. 次にこれを実行してください: restorecon -v '$FIX_TARGET_PATH'
kn: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' ಇಲ್ಲಿ FILE_TYPE ಎನ್ನುವುದು ಈ ಕೆಳಗಿನವುಗಳಲ್ಲಿ ಒಂದು ಆಗಿದೆ: %s. ನಂತರ ಇದನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸಿ: restorecon -v '$FIX_TARGET_PATH'
or: # semanage fcontext -a -t FILE_TYPE '$ '$FIX_TARGET_PATH' ଯେଉଁଠି FILE_TYPE ଟି ନିମ୍ନଲିଖିତ ମଧ୍ଯରୁ ଗୋଟିଏ: %s. ତାପରେ ନିଷ୍ପାଦନ କରନ୍ତୁ: # restorecon -v '$FIX_TARGET_PATH'
te: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' ఇచట FILE_TYPE కింది వాటిలో వొకటి: %s. అప్పుడు యిది నిర్వర్తించు: restorecon -v '$FIX_TARGET_PATH'
uk: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' де FILE_TYPE може приймати одне з таких значень: %s. Потім віддайте команду: restorecon -v '$FIX_TARGET_PATH'
zh_tw: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' FILE_TYPE 為後述之一：%s。 接著執行： restorecon -v '$FIX_TARGET_PATH'

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access.
as: SELinux এ $SOURCE_PATH "$ACCESS" অভিগম প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a $SOURCE_PATH el acceso "$ACCESS".
gu: SELinux એ $SOURCE_PATH "$ACCESS" વપરાશને અટકાવી રહ્યુ છે.
ja: SELinux は $SOURCE_PATH による "$ACCESS" アクセスを阻止しています。
kn: $SOURCE_PATH "$ACCESS" ನ ನಿಲುಕಣೆಯನ್ನು SELinux ತಡೆಯುತ್ತಿದೆ.
or: SELinux $SOURCE_PATH "$ACCESS" କୁ ପ୍ରତିରୋଧକରୁଅଛି।
uk: SELinux запобігає спробі доступу $SOURCE_PATH "$ACCESS".
zh_tw: SELinux 防止 $SOURCE_PATH 「$ACCESS」存取。

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access.
as: SELinux এ $SOURCE দ্বাৰা অনুৰোধ কৰা অভিগম নাকচ কৰিলে। এই অভিগম $SOURCE দ্বাৰা প্ৰয়োজন হব বুলি আশা কৰা হোৱা নাই আৰু এই সংকেতে এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে। সম্ভব হব পাৰে যে অনুপ্ৰয়োগৰ বিশেষ সংস্কৰণ অথবা সংৰূপে ইয়াৰ অতিৰিক্ত অভিগমৰ প্ৰয়োজনীয়তা দেখাই আছে।
es: SELinux negó el acceso requerido por $SOURCE. No se esperaba que este acceso fuera requerido por $SOURCE, y puede ser indicio de un intento de ataque. También es posible que la versión específica o la configuración de la aplicación esté provocando esta necesidad de acceso adicional.
gu: SELinux એ $SOURCE દ્વારા અરજી કરાયેલ વપરાશ નામંજૂર કર્યો છે. તે ઈચ્છિત હતો નહિં કે આ વપરાશ $SOURCE દ્વારા જરૂરી છે અને આ વપરાશ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત કરી શકશે. એ પણ શક્ય છે કે ચોક્કસ આવૃત્તિ અથવા કાર્યક્રમનું રૂપરેખાંકન એ તેને વધારાના વપરાશની અરજી કરવા માટે કારણ આપી રહ્યું હોય.
ja: SELinux は $SOURCE により要求されたアクセスを拒否しました。 このアクセスは $SOURCE に必要であると想定されないため不正侵入 の試行を示している可能性があります。 また、 アプリケーションの特定 バージョンまたは設定が追加アクセス要求の原因となっている可能性 もあります。
kn: $SOURCE ನಿಂದ ಸಲ್ಲಿಸಲಾದ ಮನವಿಯನ್ನು SELinux ನಿರಾಕರಿಸಿದೆ. ಈ ಅನುಮತಿಯು $SOURCE ಗೆ ಅಗತ್ಯವಿದೆ ಎಂದು ನಿರೀಕ್ಷಿಸಿರಲಿಲ್ಲ ಹಾಗು ಇದನ್ನು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲ್ಪಡುತ್ತದೆ. ಅನ್ವಯದ ನಿಶ್ಚಿತ ಆವೃತ್ತಿ ಅಥವ ಸಂರಚನೆಗಾಗಿ ಈ ಹೆಚ್ಚುವರಿ ಅನುಮತಿಯ ಅಗತ್ಯವಿರುವ ಸಾಧ್ಯತೆ ಇದೆ.
or: SELinux $SOURCE ଦ୍ୱାରା ଅନୁରୋଧ କରାଯାଇଥିବା ଅଭିଗମ୍ୟତାକୁ ବାରଣ କରିଥିଲା। ଏହା ଆଶାକରାଯାଇନଥିଲା ଯେ ଏହି ଅଭିଗମ୍ୟତାଟି $SOURCE ଦ୍ୱାରା ଆବଶ୍ୟକ ହେବ ଏବଂ ଏହି ଅଭିଗମ୍ୟତା ଗୋଟିଏ ବିନା ଅନୁମତିରେ ପ୍ରବେଶକୁ ସୂଚାଇଥାଏ। ଏହା ମଧ୍ଯ ସମ୍ଭବ ଯେ ନିର୍ଦ୍ଦିଷ୍ଟ ସଂସ୍କରଣ ଅଥବା ପ୍ରୟୋଗର ବିନ୍ୟାସ ପାଇଁ ଅତିରିକ୍ତ ଅଭିଗମ୍ୟତା ଆବଶ୍ୟକ ହୋଇଥାଏ।
te: SELinux అనునది $SOURCE ద్వారా అభ్యర్దించబడిన వాడుకను తిరస్కరిస్తుంది. ఇది ఈ చర్య $SOURCE ద్వారా అభ్యర్దించ బడిందని అనుకోలేదు మరియు ఈ వాడుక అమర్యాద యత్నమును సూచిస్తుంది. ఆ తెలుపబడిన వర్షన్ లేదా అనువర్తనం యొక్క ఆకృతీకరణ అదనపు వాడుకును అవసరపడితే ఇది సంభవించుటకు ఆస్కారం గలదు.
uk: SELinux відхилила запит на доступ від $SOURCE. Такий запит не очікується від $SOURCE, що може свідчити про спробу вторгнення. Також можливо, що специфічна версія конфігурації програми вимагає додаткового доступу.
zh_tw: SELinux 拒絕來自 $SOURCE 的存取請求。$SOURCE 並不需要此存取因此此存取 可能可能代表系統已遭到嘗試入侵的警訊。應用程式的特定版本或設定 可能是造成它需要額外存取 的原因。

source: You can generate a local policy module to allow this access - see <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> Please file a bug report.
as: আপুনি এই অভিগমৰ অনুমতি দিবলে এটা স্থানীয় নীতি মডিউল সৃজন কৰিব পাৰে - <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> চাওক অনুগ্ৰহ কৰি এটা বাগ সংবাদ জমা দিয়ক।
es: Puede generar un módulo de política local para permitir este acceso. Vea <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> Por favor, informe este error.
gu: તમે આ વપરાશને પરવાનગી આપવા માટે સ્થાનિક પોલિસી મોડ્યુલને બનાવી શકો છો - જુઓ <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> મહેરબાની કરીને ભૂલ અહેવાલ જમા કરો.
ja: ローカルポリシーモジュールを生成して、このアクセスを許可するように できます：<a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> をご覧下さい。 バグレポートを提出してください。
kn: ಈ ನಿಲುಕಣೆಯನ್ನು ಅನುಮತಿಸಲು ನೀವು ಒಂದು ಸ್ಥಳೀಯ ಪಾಲಿಸಿಯನ್ನು ಉತ್ಪಾದಿಸಬಹುದು - <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> ಅನ್ನು ನೋಡಿ ದಯವಿಟ್ಟು ಒಂದು ದೋಷ ವರದಿಯನ್ನು ಸಲ್ಲಿಸಿ.
or: ଏହି ଅଭିଗମ୍ୟତା ପାଇଁ ଆପଣ ଗୋଟିଏ ସ୍ଥାନୀୟ ନିତୀ ଏକକାଂଶ ନିର୍ମାଣ କରିପାରିବେ - <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> କୁ ଦେଖନ୍ତୁ ଦୟାକରି ଗୋଟିଏ ତ୍ରୁଟି ବିବରଣୀ ଖବର କରନ୍ତୁ।
te: ఈ యాక్సెస్‌ను అనుమతించుటకు మీరు స్థానిక విధాన మాడ్యూల్‌ను వుద్బవింపజేయవచ్చు - <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> చూడండి దయచేసి బగ్ నివేదికను నమోదు చేయండి.
uk: Щоб дозволити доступ, можна згенерувати модуль локальних правил (див. <a href="http://docs.fedoraproject.org/uk-UA/Fedora/13/html/SELinux_FAQ/index.html">ЧаП</a>). Будь ласка, створіть звіт про помилку.
zh_tw: 您可產生一份本機方針模組以允許這項 存取 - 請參閱 <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> 請提交一份錯誤報告。

source: you believe that $SOURCE_BASE_PATH should be allowed $ACCESS access on processes labeled $TARGET_TYPE by default.
as: আপুনি ভাৱে যে $SOURCE_BASE_PATH ক $TARGET_TYPE লেবেল কৰা প্ৰক্ৰিয়াসমূহত অবিকল্পিতভাৱে $ACCESS অভিগমৰ অনুমতি দিব লাগিব।
es: cree que de manera predeterminada, $SOURCE_BASE_PATH debería permitir acceso $ACCESS sobre procesos etiquetados como $TARGET_TYPE.
gu: તમે માનો છો કે મૂળભૂત રીતે પ્રક્રિયાઓ લેબલ થયેલ $TARGET_TYPE પર $SOURCE_BASE_PATH એ $ACCESS વપરાશની પરવાનગી આપવી જોઇએ.
ja: $SOURCE_BASE_PATH に、 $TARGET_TYPE にラベルされている $ACCESS アクセスがデフォルトで許可されるべきです。
kn: $TARGET_TYPE ಎಂದು ಲೇಬಲ್ ಮಾಡಲಾದ ಪ್ರಕ್ರಿಯೆಯಲ್ಲಿ ಪೂರ್ವನಿಯೋಜಿತವಾಗಿ $SOURCE_BASE_PATH $ACCESS ನಿಲುಕಣಾ ಸಾಮರ್ಥ್ಯವನ್ನು ಹೊಂದಲು ಅನುಮತಿ ಇರಬೇಕು ಎಂದು ನೀವು ನಂಬುತ್ತೀರಿ.
or: ଆପଣ ବିଶ୍ୱାସ କରୁଛନ୍ତି ଯେ $SOURCE_BASE_PATH କୁ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଭାବରେ ନାମିତ $TARGET_TYPE କୁ କାର୍ଯ୍ୟକାରୀ କରିବାକୁ $ACCESS ରେ ଅଭିଗମ୍ୟ ପାଇଁ ଅନୁମତି ଦେବା ଉଚିତ।
uk: ви вважаєте, що $SOURCE_BASE_PATH має бути надано типовий доступ $ACCESS до процесу з міткою $TARGET_BASE_PATH
zh_tw: 您認為 $SOURCE_BASE_PATH 就預設值應擁有標記為 $TARGET_TYPE 的程序的 $ACCESS 存取權限。

source: you believe that $SOURCE_BASE_PATH should have the $ACCESS capability by default.
as: আপুনি ভাৱে যে $SOURCE_BASE_PATH ৰ অবিকল্পিতভাৱে $ACCESS ক্ষমতা থাকিব লাগিব।
es: cree que $SOURCE_BASE_PATH debería tener la capacidad de $ACCESS de forma predeterminada.
gu: તમે માનો છો કે $SOURCE_BASE_PATH પાસે મૂળભૂત રીતે $ACCESS ક્ષમતા હોવી જોઇએ.
ja: $SOURCE_BASE_PATH は、 $ACCESS capability をデフォルトで持っているべきです。
kn: ಪೂರ್ವನಿಯೋಜಿತವಾಗಿ $SOURCE_BASE_PATH ಗೆ $ACCESS ಸಾಮರ್ಥ್ಯವು ಇರಬೇಕು ಎಂದು ನೀವು ನಂಬುತ್ತೀರಿ.
or: ଆପଣ ବିଶ୍ୱାସ କରୁଛନ୍ତି ଯେ $SOURCE_BASE_PATH ରେ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଭାବରେ $ACCESS କ୍ଷମତା ଅଛି।
te: మీరు $SOURCE_BASE_PATH అనునది $ACCESS సామర్థ్యమును అప్రమేయంగా కలిగివుండాలని నమ్ముచున్నారా.
uk: ви вважаєте, що $SOURCE_BASE_PATH має бути надано типову можливість $ACCESS.
zh_tw: 您認為 $SOURCE_BASE_PATH 就預設值應擁有 $ACCESS 能力。

source: you believe that $SOURCE_BASE_PATH should be allowed $ACCESS access on the $TARGET_BASE_PATH $TARGET_CLASS by default.
as: আপুনি ভাৱে যে $SOURCE_BASE_PATH ক $TARGET_BASE_PATH $TARGET_CLASS লে অবিকল্পিতভাৱে $ACCESS অভিগমৰ অনুমতি দিব লাগিব।
es: cree que de manera predeterminada, $SOURCE_BASE_PATH debería permitir acceso $ACCESS sobre $TARGET_BASE_PATH $TARGET_CLASS.
gu: તમે માનો છો કે મૂળભૂત રીતે $TARGET_BASE_PATH $TARGET_CLASS પર $SOURCE_BASE_PATH એ $ACCESS વપરાશની પરવાનગી આપવી જોઇએ.
ja: $SOURCE_BASE_PATH に、 $TARGET_BASE_PATH $TARGET_CLASS の $ACCESS アクセスがデフォルトで許可されるべきです。
kn: $TARGET_BASE_PATH $TARGET_CLASS ನಲ್ಲಿ ಪೂರ್ವನಿಯೋಜಿತವಾಗಿ $SOURCE_BASE_PATH $ACCESS ನಿಲುಕಣಾ ಸಾಮರ್ಥ್ಯವನ್ನು ಹೊಂದಲು ಅನುಮತಿ ಇರಬೇಕು ಎಂದು ನೀವು ನಂಬುತ್ತೀರಿ.
or: ଆପଣ ବିଶ୍ୱାସ କରୁଛନ୍ତି ଯେ $SOURCE_BASE_PATH କୁ ପୂର୍ବନିର୍ଦ୍ଧାରିତ ଭାବରେ $TARGET_BASE_PATH $TARGET_CLASS ଉପରେ $ACCESS ରେ ଅଭିଗମ୍ୟ ପାଇଁ ଅନୁମତି ଦେବା ଉଚିତ।
uk: якщо ви вважаєте, що $SOURCE_BASE_PATH має бути надано типовий доступ $ACCESS до $TARGET_BASE_PATH $TARGET_CLASS.
zh_tw: 您認為 $SOURCE_BASE_PATH 就預設值應擁有 $TARGET_BASE_PATH $TARGET_CLASS 的 $ACCESS 存取權限。

source: You should report this as a bug. You can generate a local policy module to allow this access.
as: আপুনি ইয়াক এটা বাগ হিচাপে সংবাদ দিব লাগিব। আপুনি এই অভিগমৰ অনুমতি দিবলে এটা স্থানীয় নীতি মডিউল সৃজন কৰিব পাৰে।
es: Debería reportar esto como un error. Puede generar un módulo de política local para permitir este acceso.
gu: તમે આ ભૂલનો અહેવાલ કરવો જોઇએ. તમે આ પ્રવેશને પરવાનગી આપવા માટે સ્થાનિક પોલિસીને ઉત્પન્ન કરી શકો છો.
ja: これをバグをして報告すべきです。 このアクセスを許可するために、ローカルポリシーモジュールを生成することができます。
kn: ನೀವು ಇದನ್ನು ಒಂದು ದೋಷ ಎಂದು ವರದಿ ಮಾಡಬೇಕು. ಈ ನಿಲುಕಣೆಯನ್ನು ಅನುಮತಿಸಲು ನೀವು ಒಂದು ಸ್ಥಳೀಯ ಪಾಲಿಸಿಯನ್ನು ಉತ್ಪಾದಿಸಬಹುದು.
or: ଆପଣ ଏହାକୁ ଗୋଟିଏ ତ୍ରୁଟି ଭାବରେ ଖବର କରିବା ଉଚିତ। ଏହି ଅଭିଗମ୍ୟକୁ ଅନୁମତି ଦେବା ପାଇଁ ଆପଣଙ୍କୁ ଗୋଟିଏ ସ୍ଥାନୀୟ ନିୟମାବଳୀ ଏକକାଂଶ ସୃଷ୍ଟିକରିବା ଉଚିତ।
te: మీరు దీనిని బగ్ వలె ఫిర్యాదు చేయాలి. ఈ యాక్సెస్‌ను అనుమతించుట ద్వారా మీరు స్థానిక పాలసీ మాడ్యూల్‌ను వుద్భవింప చేయగలరు.
uk: Вам слід повідомити про цю помилку як про ваду. Ви можете створити модуль локальних правил для надання подібного доступу.
zh_tw: 您應將此回報為錯誤。 您可產生本機政策模組，以允許這項存取。

source: Allow this access for now by executing: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
as: এতিয়াৰ বাবে এই অভিগমৰ অনুমতি দিয়ক প্ৰেৰণ কৰি: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
es: Permita el acceso momentáneamente executando: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
gu: ચલાવીને અત્યારે આ પ્રવેશને પરવાનગી આપો: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
ja: このアクセスを一時的に許可するには、以下を実行してください。: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
kn: ಇದನ್ನು ಕಾರ್ಯಗತಗೊಳಿಸುವ ಮೂಲಕ ಈ ನಿಲುಕಣೆಯನ್ನು ಅನುಮತಿಸಿ: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
uk: Надайте доступ за допомогою команд: # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp
zh_tw: 現在透過執行以下指令來允許此存取： # grep $SOURCE /var/log/audit/audit.log | audit2allow -M mypol # semodule -i mypol.pp

source: SELinux is preventing $SOURCE_PATH from connecting to port $PORT_NUMBER.
as: SELinux এ $SOURCE_PATH ক পোৰ্ট $PORT_NUMBER লগত সংযোগ কৰাৰ পৰা প্ৰতিৰোধ কৰি আছে।
es: SELinux está negando a $SOURCE_PATH la conexión con el puerto $PORT_NUMBER.
gu: SELinux એ $SOURCE_PATH ને પોર્ટ $PORT_NUMBER સાથે જોડાવાથી અટકાવી રહ્યું છે.
ja: SELinux は $SOURCE_PATH によるポート $PORT_NUMBER への接続を 阻止しています。
kn: $SOURCE_PATH ಅನ್ನು ಸಂಪರ್ಕಸ್ಥಾನ $PORT_NUMBER ಕ್ಕೆ ಬರೆಯದಂತೆ SELinux ತಡೆದಿದೆ
or: SELinux $SOURCE_PATH କୁ $PORT_NUMBER ସଂଯୋଗିକୀ ସହିତ ସଂଯୋଗ କରିବାରୁ ଅଟକାଉଛି।
te: SELinux అనునది $SOURCE_PATH ను పోర్ట్‍ $PORT_NUMBER కు అనుసంధానించుట నుండి నిరోధిస్తుంది.
uk: SELinux запобігає підключенню $SOURCE_PATH до порту $PORT_NUMBER.
zh_tw: SELinux 防止 $SOURCE_PATH 連至通訊埠 $PORT_NUMBER。

source: SELinux has denied $SOURCE from connecting to a network port $PORT_NUMBER which does not have an SELinux type associated with it. If $SOURCE should be allowed to connect on $PORT_NUMBER, use the <i>semanage</i> command to assign $PORT_NUMBER to a port type that $SOURCE_TYPE can connect to (%s). If $SOURCE is not supposed to connect to $PORT_NUMBER, this could signal a intrusion attempt.
as: SELinux এ $SOURCE ক এটা নেটৱাৰ্ক পোৰ্ট $PORT_NUMBER যাৰ এটা SELinux ধৰণ সংলঘ্ন নাই তাৰ সৈতে সংযোগ নাকচ কৰিছে। যদি $SOURCE ক $PORT_NUMBER ত সংযোগ কৰাৰ অনুমতি দিব লাগে, <i>semanage</i> কমান্ডক এটা পোৰ্ট ধৰণ যলে $SOURCE_TYPE সংযোগ কৰিব পাৰিব (%s) তাত $PORT_NUMBER ধাৰ্য্য কৰিবলে ব্যৱহাৰ কৰক। যদি $SOURCE এ $PORT_NUMBER ৰ সৈতে সংযোগ কৰাৰ কথা নহয়, ই এটা অনাধিকাৰ প্ৰৱেশৰ ইংগিত দিব পাৰে।
es: SELinux ha negado a $SOURCE la conexión al puerto de red $PORT_NUMBER que no tiene un tipo SELinux asociado a él. Si $SOURCE debería poder conectarse al puerto $PORT_NUMBER, use el comando <i>semanage</i> para asignar $PORT_NUMBER a un tipo de puerto al que $SOURCE_TYPE se pueda conectar (%s). Si $SOURCE no debería poder conectarse con el puerto $PORT_NUMBER, puede ser señal de un intento de intrusión.
gu: SELinux એ $SOURCE ને નેટવર્ક પોર્ટ $PORT_NUMBER સાથે જોડાવાથી નામંજૂર કરેલ છે કે જેને SELinux પ્રકાર તેની સાથે સંકળાયેલ નથી. જો $SOURCE એ આ $PORT_NUMBER પર જોડાવા માટે માન્ય હોવું જોઈએ, તો તમે આ $PORT_NUMBERને પોર્ટ પ્રકારમાં ઉમેરવા માટે <i>semanage</i> આદેશ વાપરી શકો કે જેને $SOURCE_TYPE (%s) માં જોડાઈ શકે. જો $SOURCE એ આ $PORT_NUMBER સાથે જોડાવુ નહિં જોઈએ,તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.
ja: $SOURCE によるポートに関連付けられた SELinux タイプを持たないネットワークポート $PORT_NUMBER への接続を、SELinux は拒否しました。 $SOURCE の $PORT_NUMBER での接続が許可されるべきである場合、<i>semanage</i> コマンドを使用して、$PORT_NUMBER を $SOURCE_TYPE が接続できるポートタイプに割り当てします (%s)。 $SOURCE による $PORT_NUMBER への接続が想定されていない場合、 これは不正侵入の試行を示唆している可能性があります。
kn: $SOURCE ಅನ್ನು ಜಾಲಬಂಧ ಸಂಪರ್ಕಸ್ಥಾನ $PORT_NUMBER ಕ್ಕೆ ಸಂಪರ್ಕಿತಗೊಳ್ಳದಂತೆ SELinux ನಿರ್ಬಂಧಿಸಿದೆ,ಆದರೆ ಇದಕ್ಕೆ ಹೊಂದಿಕೊಂಡಿರುವ ಒಂದು SELinux ಬಗೆ ಇಲ್ಲ. $PORT_NUMBER ಸಂಪರ್ಕಸ್ಥಾನಕ್ಕೆ ಸಂಪರ್ಕ ಹೊಂದಲು $SOURCE ಗೆ ಅನುಮತಿಸಬೇಕೆಂದಿದ್ದರೆ, $PORT_NUMBER ಅನ್ನು $SOURCE_TYPE ಯು ಬೈಂಡ್ ಆಗುವಂತಹ ಒಂದು ಸಂಪರ್ಕಸ್ಥಾನದ ಬಗೆಗೆ ಸೇರಿಸಲು <i>semanage</i> ಆಜ್ಞೆಯನ್ನು ಬಳಸಬಹುದು (%s). ಎಲ್ಲಿಯಾದರೂ $SOURCE ಈ ಸಂಪರ್ಕಸ್ಥಾನಕ್ಕೆ ಬೈಂಡ್ ಆಗಬಾರದಂತಿದ್ದಲ್ಲಿ, ಇದು ಒಂದು ಒಳನುಸುಳುವಿಕಾ ಪ್ರಯತ್ನ ಎಂದು ಸೂಚಿಸಲ್ಪಡುತ್ತದೆ.
or: SELinux $SOURCE କୁ ନେଟୱର୍କ ପୋର୍ଟ $PORT_NUMBER ସହିତ ସଂଯୋଗ ହେବାରୁବାରଣ କରିଥାଏ ଯେଉଁଥିରେ SELinux ପ୍ରକାର ସଂଶ୍ଳିଷ୍ଟ ନଥାଏ। ଯଦି $SOURCE କୁ $PORT_NUMBER ରେ ସଂଯୋଗ କରିବା ପାଇଁ ଅନୁମତି ଦେବା ଉଚିତ ହୁଏ, ତେବେ<i>semanage</i> ନିର୍ଦ୍ଦେଶକୁ $PORT_NUMBER ନ୍ୟସ୍ତ କରିବା ପାଇଁ ବ୍ୟବହାର କରାଯାଇଥାଏ ଯେଉଁଥିରେ $SOURCE_TYPE କୁ (%s) ସହିତ ସଂଯୋଗ କରାଯାଇଥାଏ। ଯଦି $SOURCE ଟି $PORT_NUMBER ସହିତ ସଂଯୋଗ ନହୁଏ, ତେବେ ଏହା ଗୋଟିଏ ବିନାଅନୁମତିରେ ପ୍ରବେଶକୁ ସୂଚାଇଥାଏ।
uk: SELinux заборонила $SOURCE підключатись до мережного порту $PORT_NUMBER, якому не заданий тип SELinux. Якщо $SOURCE повинен мати можливість підключатися до цього порту, ви можете використовувати команду semanage для додавання цього порту до типу, до якого $SOURCE_TYPE може підключатися. (%s). Якщо $SOURCE не має підключатися до цього порту, це може означати спробу вторгнення.
zh_tw: SELinux 已拒絕 $SOURCE 連至網路連接埠 $PORT_NUMBER，並且此連接埠沒有與其相聯的 SELinux 類型。 若 $SOURCE 應被允許連上 $PORT_NUMBER，請使用 <i>semanage</i> 指令來將 $PORT_NUMBER 指定為 $SOURCE_TYPE 所能連至的連接埠類型(%s)。 若 $SOURCE 不應連至 $PORT_NUMBER 的話，這即代表可能有入侵狀況。
